{
    "notificationCloseTitle":"Закрыть окно",
    "whatsNewInfo": "Что нового: приложение перенесено на React.js, теперь оно переведено и имеет переключатель темы. Подробнее читайте ",
    "whatsNewLink": "здесь",
    "darkModalMessage": "Добро пожаловать на сторону тьмы",
    "lightModalMessage": "Добро пожаловать на сторону света",
    "modalConfirm": "Погнали!",
    "modalHint": "Нажмите, чтобы закрыть модальное окно",
    "app_title": "Евгений Айрапетян - Портфолио",
    "языки":"Языки",
    "themeSwitcherLightHint": "Нажмите, чтобы перейти на светлую тему",
    "themeSwitcherDarkHint": "Нажмите, чтобы перейти на темную тему",
    "welcome text": "Привет, я Евгений!",
    "resume":"Резюме",
    "introduction": "Я веб-разработчик, увлеченный технологиями.",
    "experience": "Имея предыдущий опыт преподавания иностранных языков и написания академических текстов, я с удовольствием продолжаю карьеру веб-разработчика.",
    "first focus": "Я всегда сосредотачивался на выполнении высококачественной работы с соблюдением сроков, используя свои навыки решения проблем, тайм-менеджмента и логического мышления.",
    "second focus": "Я сосредотачиваюсь на том, чтобы объединить свой опыт с профессиональными устремлениями, чтобы помочь создавать функциональные, адаптивные и доступные программные решения.",
    "availability": "Я доступен для офисной и гибридной работы в Берлине и Потсдаме или удаленно.",
    "hobbies": "Помимо моего увлечения веб-разработкой, я также являюсь активным фотографом-любителем и энтузиастом фитнеса, и в любой другой день Вы можете встретить меня на улице, когда я фотографирую или поднимаю тяжелые предметы.",
    "code":"Код",
    "projects":"Проекты",
    "projectsInfo": "Здесь вы найдете текущие проекты веб-разработки, которые я завершил и над которыми работаю. Все они имеют гиперссылки на кодовую базу и кейсы проектов, большинство из них имеют ссылку на онлайн версию, а некоторые также имеют дополнительные ссылки",
    "projectsViewTip":"Используйте элементы управления для просмотра списка проектов. Наведите курсор на определенный слайд, чтобы перейти к ссылкам на проект. Коснитесь определенного слайда, чтобы просмотреть дополнительную информацию (на мобильном устройстве).",
    "r3playInfo": "Интерфейс Web API R3play позволяет пользователям регистрироваться и выходить из системы, просматривать информацию о фильмах, сериалах и аниме, а также управлять списками коллекций.",
    "r3playAPIInfo": "Веб-API, разработанный с использованием Node.js, Express и MongoDB, что позволяет пользователям регистрироваться, отменять регистрацию, просматривать информацию о фильмах, телешоу и аниме, а также управлять избранным.",
    "myFlixInfo": "Front-end для R3play Web API, разработанный с использованием Angular, Typescript и Material UI, который позволяет пользователям регистрироваться, просматривать информацию о фильмах и добавлять их в избранное.",
    "meetInfo": "Прогрессивное веб-приложение, написанное с использованием функций AWS Lambda, которое использует авторизацию и аутентификацию OAuth2 и отображает события из Google Calendar API CareerFoundry.",
    "owriteInfo": "React Native приложение, которое позволяет пользователям общаться в чате. Пользователи могут установить имя пользователя, выбрать цвет фона чата и отправлять текстовые сообщения, изображения и аудиозаписи.",
    "pokemonInfo": "Адаптивное приложение о покемонах, которое получает информацию о покемонах с помощью Ajax из внешнего API Pokedex и отображает данные о них, такие как рост, вес, идентификатор, а также изображения спереди и сзади",
    "toDoInfo": "Приложение на jQuery и Bootstrap, которое позволяет пользователям управлять делами. Пользователи могут добавлять, удалять и изменять порядок дел, создавать и удалять списки дел, а также просматривать руководство по использованию приложения.",
    "portfolioInfo":"Адаптивное веб-приложение, разработанное с учетом требований React, React Bootstrap и возможностей доступности, позволяющее пользователям просматривать информацию о моих проектах и т.д.",




    "r3playInfoTitle":"Нажмите, чтобы узнать больше о R3play API",
    "r3playInfoTitleAPIDeployed":"Нажмите, чтобы открыть R3play API",
    "r3playInfoTitleGithub":"Нажмите, чтобы открыть репозиторий R3play API на Github",
    "myFlixInfoTitle":"Нажмите, чтобы узнать больше о приложении MyFlix",
    "myFlixInfoTitleGithub":"Нажмите, чтобы открыть репозиторий приложения MyFlix на Github",
    "myFlixInfoTitleKanban":"Нажмите, чтобы открыть канбан-доску проекта приложения myFlix",
    "meetInfoTitle":"Нажмите, чтобы узнать больше о приложении Meet",
    "meetInfoTitleDeployed":"Нажмите, чтобы открыть приложение Meet",
    "meetInfoTitleGithub": "Нажмите, чтобы открыть репозиторий Meet App на Github",
    "owriteInfoTitle":"Нажмите, чтобы узнать больше о приложении Owrite",
    "owriteInfoTitleGithub":"Нажмите, чтобы открыть репозиторий Owrite App на Github",
    "pokemonInfoTitle": "Нажмите, чтобы узнать больше о приложении Pokemon",
    "pokemonInfoTitleDeployed":"Нажмите, чтобы открыть приложение Pokemon",
    "pokemonInfoTitleGithub":"Нажмите, чтобы открыть репозиторий приложения Pokemon на Github",
    "toDoInfoTitle":"Нажмите, чтобы узнать больше о приложении To-Do-List-App",
    "toDoInfoTitleDeployed":"Нажмите, чтобы открыть приложение To-Do-List-App",
    "toDoInfoTitleGithub":"Нажмите, чтобы открыть репозиторий приложения To-Do-List-App на Github",
    "portfolioInfoTitle":"Нажмите, чтобы узнать больше о приложении Portfolio",
    "portfolioInfoTitleDeployed":"Нажмите, чтобы открыть приложение Portfolio",
    "portfolioInfoTitleGithub":"Нажмите, чтобы открыть репозиторий приложения Portfolio на Github",
    "testimonialSliderMore":"Нажмите, чтобы просмотреть полный текст отзыва",




    "projectsSliderMore": "больше",
    "testimonials": "Отзывы",
    "wordOfMouth": "Я не был бы там, где я есть сегодня, без всех этих замечательных людей, с которыми я имел честь работать.",
    "testimonialsViewTip": "Используйте элементы управления, чтобы просмотреть список отзывов. Наведите курсор на заголовки отзывов, чтобы прочитать больше. Нажмите на конкретный отзыв, чтобы просмотреть дополнительную информацию (на мобильном устройстве)",
    "testimonial1": "Maya Septriana, консультант по вопросам карьеры, CareerFoundry",
    "testimonial2": "Nizar Triki, Менеджер по разработке программного обеспечения Chez Expensya",
    "testimonial3": "Dejan Gogov, веб-разработчик, Wild Code school",
    "testimonial1Text": "Евгений - это человек, с которым очень легко сотрудничать. Он всегда стремится к совершенству. Каждый раз, когда я даю ему обратную связь, он готов выслушать и скорректировать задание...",
    "testimonial2Text": "У меня была возможность быть наставником Евгения на протяжении всего его обучения веб-разработке в CareerFoundry. Самодостаточность Евгения, быстрое восприятие понятий...",
    "testimonial3Text": "Во время нашего 6-месячного Fullstack буткемпа Евгений неизменно демонстрировал позитивное и доброжелательное поведение. Он решительно подходил к задачам...",
    "testimonialsMore": "больше",
    "contact":"Связаться",
    "suggestion": "Хотите работать вместе или у вас есть предложение? Я открыт для возможностей рекрутинга и комментариев",
    "eMailMe": "Не стесняйтесь написать мне по электронной почте, используя форму ниже",
    "contactFormHeader":"Связаться",
    "firstName":"Имя",
    "firstNamePlaceholder":"Джои",
    "lastName": "Фамилия",
    "lastNamePlaceholder": "Триббиани",
    "phoneNumber": "Номер телефона",
    "phoneNumberPlaceholder": "+49 1234 5678910",
    "eMail":"Электронная почта",
    "eMailPlaceholder": "example@mail.com",
    "messageOrComment": "Сообщение или комментарий. Пожалуйста, будьте любезны!",
    "messageOrCommentPlaceholder": "Ваше сообщение",
    "contactFormTip": "Поля, отмеченные звездочкой, являются обязательными для заполнения",
    "contactFormPoweredBy":"Работает на базе",
    "caseWorkflow": "Рабочий процесс",
    "caseUpgrade":"Обновление",
    "caseDatabase":"База данных",
    "caseApi":"API",
    "caseInterface":"Интерфейс приложения",
    "caseTDD":"Разработка на основе тестирования",
    "caseServerAndApi": "Серверная часть и API",
    "caseAgile":"Рабочий процесс Agile",
    "caseOverview":"Обзор",
    "casePurpose": "Цель и контекст",
    "caseObjective":"Цель",
"caseServer":"Серверная часть",
"caseClient":"Клиентская часть",
"caseApproach": "Подход",
"caseDuration":"Продолжительность",
"caseRetrospective":"Ретроспектива",
"caseChallenges":"Вызовы",
"caseConclusion":"Выводы и ключевые задачи",
"caseMainTakeaways":"Основные выводы для будущих проектов",
"apiPreview":"Предварительный просмотр API",
"appPreview": "Предварительный просмотр приложения",
"caseTechnologies": "Используемые технологии / навыки",
"caseCredits": "Участники",



"portfolioCaseHeading": "Разбор кейса Portfolio App",
"portfolioCaseIntroduction": "Portfolio App - это адаптивное веб-приложение, разработанное с использованием React и React Bootstrap, которое предоставляет пользователям информацию о моих текущих проектах, отзывы, контакты и информацию о социальных платформах. Оно переведено на несколько иностранных языка. Пользователи имеют доступ к информации в отдельных интерфейсах, могут перевести приложение на желаемый язык и изменить тему оформления на светлую или темную.",
"PortfolioCaseRequired": "Приложение Portfolio было обязательным проектом, который я разработал в рамках своего курса \"Введение в веб-разработку\" в CareerFoundry, чтобы продемонстрировать мастерство в HTML, CSS и размещении веб-сайтов в интернете. Кроме того, я освоил широко распространенные методы веб-разработки, такие как тестирование приложений, минимизация CSS, доступность, поддержка старых браузеров и CSS-анимации.",
"portfolioCaseAim": "Целью проекта было разработать и разместить в интернете полнофункциональный статический веб-сайт, который я мог бы использовать в качестве своего профессионального портфолио. Проблема, которую я хотел решить, заключалась в использовании инструментов, изложенных в курсе \"Введение в веб-разработку\" в CareerFoundry, для создания и размещения онлайн рабочего веб-сайта, который я мог бы использовать в качестве профессионального портфолио.",
"portfolioCaseAboutWorkflow": "В начале процесса разработки я структурировал контент с помощью HTML, а затем стилизовал страницы с помощью обычного CSS. Плагин Totally.js помог структурировать и оформить веб-сайт в соответствии с рекомендациями по доступности веб-страниц. Эти рекомендации предназначены для того, чтобы помочь людям с физическими или другими ограничениями лучше ориентироваться в Интернете. Для этих целей были использованы специальные теги \"aria\", а также информативные описания и альтернативные текстовые данные. На заключительных этапах проекта я протестировал веб-сайт на предмет корректной работы в различных операционных системах и браузерах, включая привлечение резервного Javascript-кода для поддержки более старых версий браузера Internet Explorer.",
"portfolioCaseAboutUpgrade1": "После завершения программы веб-разработки в Careerfoundry и во время обучения на \"Курсе подготовки к работе\" в CareerFoundry я решил немного обновить приложение. Во-первых, на сайте появились новые страницы с примерами проектов, в которых я подробно описал, как я работал над каждым проектом во время учебы в CareerFoundry. Во-вторых, я обновил дизайн, сделав его более приятным визуально, функциональным и эстетичным. Однако, поскольку статические веб-сайты в настоящее время становятся все более устаревшими, пришло время перенести мое портфолио в одну из библиотек Javascript, которые широко используются сообществом веб-разработчиков. Так как, завершив несколько проектов в буткемпе с помощью React.js и, имея наибольший опыт работы с ним, я решил использовать его в качестве основы для своего проекта.",
"portfolioCaseAboutUpgrade2": "Я инициализировал работу с помощью команды Create React App, затем переместил и адаптировал все файлы HTML и CSS в отдельные функциональные компоненты и установил необходимые зависимости проекта. Проекты, отзывы и кейсы получили отдельные слайдеры с примерами и видео-обзорами. Позже я локализовал приложение на несколько иностранных языков, добавил темную тему и обновил приложение, реализовав возможность для пользователей сохранять настройки языка и темы. И, наконец, я превратил свое портфолио в прогрессивное веб-приложение. С помощью этой функции пользователи могут устанавливать приложение на настольные компьютеры и мобильные устройства, имитируя опыт нативного приложения, например, на платформах Android или Windows.",
"caseTotally": "Посетить GitHub репозиторий Totally.js ",
"portfolioCaseAboutClient": "Я создал интерфейс, чтобы предоставить пользователям возможность просматривать данные, относящиеся к моему профессиональному портфолио. Первоначально это был статический веб-сайт, разработанный с использованием обычных HTML, CSS и Totally.JS, плагина Javascript для проверки доступности приложения. Портфолио содержало отдельные HTML-страницы, например, главная, проекты, контакты и другие.",
"portfolioCaseDurationData": "На первоначальный проект ушло в общей сложности 2 недели, а на текущий результат-3-6 месяцев в целом",
"portfolioCaseConclusionData": "Приложение Portfolio было первым проектом в рамках учебного курса по веб-разработке CareerFoundry. Когда все было закончено, я начал \"курс полного погружения в фулстек разработку\" с работы над приложением Pokemon App.",
"portfolioCaseConclusionData2": "Это был полезный опыт разработки и отладки приложения от начального состояния до последних улучшений. Я также добавил новые и развил старые навыки (в том числе и при самостоятельной работе), такие как доработка текста, настройка размещения приложений React онлайн, использование библиотек для локализации, добавление и настройка функции изменения темы, работы с локальным хранилищем, улучшения визуального оформления и другие.",
"portfolioCaseChallenge": "Разработка оригинального проекта была относительно простой и безошибочной, поскольку у меня уже был опыт работы с технологиями, которые для этого требовались. Фактически, мне удалось завершить его за 1 неделю до крайнего срока, и мои работы были представлены в качестве примера для других студентов.",
"portfolioCaseChallenge2": "Однако, когда я самостоятельно перешел к более сложным технологиям и вышел за рамки требований проекта, я столкнулся с несколькими проблемами. Одна из проблем заключалась в том, что я не мог полностью Добавить темную тему в приложение. Когда я активировал темную тему, оформление приложения менялось лишь частично. Еще одна проблема была связана с трудностями размещения приложения онлайн и необходимыми для этого настройками React. К счастью, знания, полученные во время буткемпа, помогли мне преодолеть эти препятствия, и мне удалось:",
"portfolioCaseChallengeDetail1": "Использовать навыки поиска информации и устранения ошибок в коде, чтобы решить проблемы, связанные с темной темой",
"portfolioCaseChallengeDetail2": "Исследовать и устранить проблемы, связанные с размещением приложения онлайн",
"portfolioMainTakeaway1": "Настойчивость-важный навык в веб-разработке, а также умение идти на компромиссы и устанавливать новые приоритеты",
"portfolioMainTakeaway2": "иногда ошибка может возникнуть неожиданно, и решение требует большего внимания к деталям",
"portfolioMainTakeaway3": "В ваших проектах всегда есть возможность для улучшения, поэтому важно понять момент, когда нужно двигаться дальше и / или расставить приоритеты",
"portfolioMainTakeaway4": "Код (быстро) стареет или нуждается в обновлении, поэтому время от времени проверяйте свои старые проекты",

"portfolioSlide1Heading":"Основной интерфейс (светлая тема)",
"portfolioSlide2Heading":"Основной интерфейс (темная тема)",
"portfolioSlide3Heading":"Интерфейс локализованного кейса",
"portfolioSlide1Description": "Приложение Portfolio, где пользователи могут прочитать больше об авторе, получить доступ к кодовой базе и резюме (отображается в светлой теме)",
"portfolioSlide2Description": "Приложение Portfolio, где пользователи могут прочитать больше об авторе, получить доступ к кодовой базе и резюме (отображается в темной теме)",
"portfolioSlide3Description": "Интерфейс одного из кейсов проекта, который локализован (в данном примере на немецкый язык)",
    
    
"r3playCaseHeading": "Разбор кейса R3play App",
"r3playCaseIntroduction": "R3play - это веб-приложение, разработанное с использованием стека MERN, которое предоставляет пользователям информацию о фильмах, сериалах и аниме. Пользователи могут получить доступ к информации о фильмах, режиссерах и жанрах. Пользователи могут создать учетную запись, обновить свою информацию и создать список своих любимых фильмов, сериалов и аниме.",
"r3playCaseRequired": "R3play-это обязательный проект, который я разработал в рамках своего полноценного курса погружения в CareerFoundry, чтобы продемонстрировать свое мастерство полноценной веб-разработки с помощью JavaScript.",
"r3playCaseAim": "Проект был направлен на разработку полностью функционирующего приложения с использованием полного стека, которое я мог бы добавить в свое профессиональное портфолио. Проблема, которую я хотел решить, заключалась в том, чтобы создать целостное веб-приложение, объединив ранее разработанную серверную часть с клиентской частью с нуля.",
"r3playCaseAboutServer": "Я разработал RESTful API с помощью Node.js и Express, который взаимодействует с нереляционной базой данных (MongoDB). API использует общие методы HTTP, такие как GET, PUT, POST и DELETE. Методы CRUD используются для извлечения и хранения данных в базе данных. API предоставляет информацию о фильмах, сериалах и аниме в формате JSON.",
"caseViewEndpoints":"Просмотр конечных точек",
"r3playCasePostman": "Я использовал Postman для тестирования ответов и запросов API. Я также использовал базовую http-аутентификацию и аутентификацию JWT, чтобы обеспечить функции аутентификации и авторизации.",
"r3playCaseAboutClient": "Завершив проект API, я приступил к созданию клиента, который понадобился бы пользователям для взаимодействии с логикой и данными из API и базы данных. Это одностраничное адаптивное веб-приложение, разработанное с использованием React и React-Redux. Он отображает несколько интерфейсов, включая (но не ограничиваясь): главный (показывает список всех фильмов, телесериалов и аниме), отдельный фильм, телесериал и аниме (показывает данные об одном фильме, телесериале и аниме, а также позволяет пользователям добавлять или удалять их в или из своего списка избранного), страница входа, регистрации и создания профиля (где пользователи могут обновлять свои пользовательские данные и список избранных).",
"caseSliderTip": "Используйте елементы управления для просмотра списка проектов. Наведите курсор на заголовки слайдов, чтобы прочитать больше. Нажмите на определенный слайд, чтобы просмотреть дополнительную информацию (на мобильном устройстве)",
"r3playCaseDurationData":"Всего 12 недель (бэкэнд: 7 недель, фронтэнд: 5 недель)",
"r3playCaseConclusionData": "Приложение к фильму было лишь вторым полным веб-приложением, которое я разработал на курсе веб-разработки Full-Stack. Когда оно было закончено, я сосредоточился на повышении своих навыков веб-разработки, в частности на подходе, ориентированном на тестирование. Он требует внедрения фазы тестирования перед добавлением фактической функциональной логики, что позволяет разрабатывать быстрее и безопаснее и без ошибок.",
"myFlixCaseHeading": "Кейс приложения MyFlix",
"myFlixCaseIntroduction": "MyFlix-Angular-App - это веб-приложение, разработанное с использованием стека MEAN, которое предоставляет пользователям информацию о фильмах. Пользователи могут получить доступ к информации о фильмах, режиссерах и жанрах. Пользователи могут создать учетную запись, обновить свои данные и создать список своих любимых фильмов.",
"myFlixCaseRequired": "Приложение MyFlix-Angular-App было обязательным проектом, который я разработал во время курса полного погружения CareerFoundry, чтобы продемонстрировать свое мастерство в веб-разработке с помощью JavaScript. Кроме того, я практиковал управление проектами Agile, предоставление обратной связи и создание документации",
"myFlixCaseAboutServer": "Я разработал RESTful API с помощью Node.js и Express, который взаимодействует с нереляционной базой данных (MongoDB). API использует распространенные методы HTTP, такие как GET, PUT, POST и DELETE. Методы CRUD используются для извлечения данных из базы данных и их сохранения. API предоставляет информацию о фильмах, сериалах и аниме в формате JSON.",
"myFlixCasePostman": "Я использовал Postman для тестирования ответов и запросов к API. Я также использовал базовую HTTP-аутентификацию и JWT-аутентификацию для обеспечения функций аутентификации и авторизации.",
"myFlixCaseAgileData": "Работа над проектом началась с создания доски Kanban и заполнения ее требованиями проекта и пользовательскими историями. Когда задача проекта была выполнена, она перемещалась в раздел \"Готово\". Кроме того, я создал подробную документацию с помощью Typedoc в соответствии с требованиями проекта.",
"myFlixCaseAim": "Целью проекта было разработать полнофункциональное приложение, которое я мог бы добавить в свое профессиональное портфолио. Проблема, которую я хотел решить, заключалась в создании полноценного веб-приложения, разработанного с использованием полного стека, путем соединения ранее разработанной серверной и клиентской части приложения с нуля.",
"myFlixCaseConclusion": "Приложение myFlix было последним полноценным веб-приложением, которое я разработал в курсе веб-разработки полного стека. Когда все было закончено, я приступил к расширению своего портфолио",
"myFlixCaseAboutClient": "Я создал интерфейс, чтобы пользователи могли взаимодействовать с логикой и данными из API и базы данных. Это одностраничное адаптивное веб-приложение, разработанное с использованием Angular и Material UI. Он отображает несколько видов интерфейса, включая основной (отображает список всех фильмов, кнопку для управления списком избранного и кнопки для просмотра дополнительной информации о фильме), интерфейс входа / регистрации и интерфейс профиля (где пользователи могут обновлять свои пользовательские данные).",
"myFlixCaseConclusionData": "Приложение myFlix было последним полностековым веб-приложением, которое я разработал на курсе полного стека веб-разработки. Когда он был завершен, я приступил к расширению своего портфолио",
"myFlixCaseConclusionData2": "Трудности, с которыми я столкнулся, возникли в конце проекта и были больше связаны с функциями Angular и Github. Одна из проблем возникла, когда страницы Github долгое время отказывались отображать приложение. Другой случай произошел, когда локальные изменения в кодовой базе не отображались в готовой версии приложения. Чтобы решить эту проблему, я обратился к своему наставнику и тьютору, и во время сеанса парного программирования нам удалось устранить неполадки.",
"myFlixCaseConclusionData3": "Это также был полезный опыт в настройке приложения и устранении неполадок, использовании команд терминала git, особенностях работы с Angular и парных сессиях программирования. Я также добавил в свой арсенал новые навыки, такие как Typescript, Angular, Material UI, правильное комментирование кода, сотрудничество и другие.",
"myFlixCaseDurationData":"Почти 1,5 недели (10 дней)",
"myFlixCaseChallenge":"на разработку приложения myFlix ушло гораздо меньше времени и усилий по сравнению с приложением R3play на основе React, потому что:",
"myFlixCaseChallengeDetail1":"API уже был создан",
"myFlixCaseChallengeDetail2": "Практика работы с React помогла ускорить процесс разработки",
"myFlixCaseChallengeDetail3": "Я не добавил много дополнительных функций и выполнил основные требования курса",
"myFlixCaseChallengeDetail4": "Время, оставшееся в буткемпе, уже было ограничено",
"myFlixMainTakeaway1": "Улучшить функциональность, чтобы она соответствовала всем возможностям приложения R3play",
"myFlixMainTakeaway2": "Узнать больше о Typescript",
"myFlixMainTakeaway3": "Узнать больше о Material UI",
"myFlixMainTakeaway4":"Продолжать исследовать другие технологии и лучшие практики в веб-разработке",
    
"meetCaseHeading": "Разбор кейса Meet App",
"meetCaseIntroduction": "Meet App - это адаптивное прогрессивное веб-приложение, разработанное с использованием подхода разработки, основанного на тестировании, с использованием бессерверных лямбда-функций AWS, экрана аутентификации и авторизации Google OAuth2 и библиотеки Recharts, позволяющей пользователям просматривать события Google Calendar API. Пользователи могут войти в Google, указать город и количество событий, чтобы отобразить их, а также узнать о них больше. Приложение можно установить на рабочий стол или на мобильное устройство благодаря рекомендациям PWA, использовать как онлайн, так и офлайн. Он показывает сообщение при вводе неверных данных и / или потере интернет-соединения.",
"meetCaseRequired": "Meet App был обязательным проектом, который я разработал в рамках курса погружения в Full-stack разработку в буткемпе CareerFoundry, призванным продемонстрировать мое мастерство в тестировании приложений с использованием JavaScript и бессерверных технологий.",
"meetCaseAboutTDD": "Я разработал приложение, сначала написав пользовательские истории. С помощью подхода к разработке, основанного на тестировании, я применил такие методы тестирования как unit, integration, user acceptance, и end-to-end testing, чтобы написать необходимые тесты перед внедрением кода",
"meetCaseAboutServerAndApi": "Я разработал бэкэнд, используя бессерверные лямбда-функции AWS в качестве требования к проекту. Использование бессерверного интерфейса позволяет сократить объем дополнительной работы по управлению сервером и упрощает масштабируемость. Для сбора данных о событиях в приложении использовался Календарь Google от CareerFoundry. Экран аутентификации Google OAuth2 был настроен для аутентификации и авторизации пользователей в приложении. На последнем этапе разработки я использовал React service worker для преобразования Meet App в прогрессивное веб-приложение. Библиотека Recharts позволяет визуализировать данные о событиях в виде двух типов диаграмм (точечных и круговых).",
"meetCaseAim": "Целью проекта было разработать полнофункциональное приложение, которое я мог бы добавить в свое профессиональное портфолио. Проблема, которую я хотел решить, заключалась в создании полноценного веб-приложения с использованием технологий полного стека с использованием подхода разработки, основанного на тестировании, а также бессерверных лямбда-функций AWS, React.js и прогрессивных требований к веб-приложениям.",
"meetCaseAboutClient":"что касается визуальной части, интерфейс был адаптирован с использованием обычных CSS и JSX",
"meetCaseConclusionData": "Проект Meet App был сложным, но интересным. Когда он был завершен, я приступил к следующему проекту, включающему разработку нативного приложения с помощью React Native",
"meetCaseDurationData": "Почти 1 месяц (28 дней)",
"meetCaseChallenge1": "Самой большой проблемой для меня в этом проекте был сам подход к разработке, основанный на тестировании. До этого я писал код в стиле, основанном на разработке, и мне пришлось потратить некоторое время, чтобы привыкнуть к новому методу. Однако работа над приложением шла довольно успешно, и я быстро освоился с новой темой. Одной из проблем при работе над проектом была невозможность авторизации пользователей в приложении. Обратившись к своему учителю, я решил проблему, добавив тестовых пользователей вручную через консоль разработчика Google.",
"meetCaseChallenge2": "После устранения неполадок при установке приложения на смартфон я успешно превратил его в прогрессивное веб-приложение. Мне также понравилось работать с уведомлениями пользователей и библиотекой Recharts. Я также улучшил свои знания и навыки в отношении подхода TDD и настройки учетных записей разработчиков AWS и Google, а также подтвердил владение доменом.",
"meetMainTakeaway1": "Применять подход TDD в дополнительных проектах",
"meetMainTakeaway2":"Узнать больше о визуализации данных",



"owriteCaseHeading": "Кейс приложения Owrite",
"owriteCaseIntroduction": "OWrite-это приложение для общения в реальном времени на основе React Native, разработанное с использованием React Native, EXPO CLI, рекомендаций по доступности и Android Studio для самого приложения, а также Google Firebase и Firestore для базы данных. Он предоставляет пользователям функции общения в режиме реального времени, включая просмотр истории сообщений благодаря AsyncStorage, отправку сообщений, фотографий, аудиозаписей и данных о геолокации. Пользователи могут указать свое имя пользователя и выбрать цвет фона приложения.",
"owriteCaseRequired": "OWrite был обязательным проектом, который я разработал в рамках своего курса полного погружения в разработку полного стека в CareerFoundry, чтобы продемонстрировать свое мастерство в разработке собственных приложений с помощью React Native, EXPO CLI, Android Studio и Google Firebase / Firestore",
"owriteCaseAim": "Целью проекта было разработать полностью функционирующее нативное приложение, которое я мог бы добавить в свое профессиональное портфолио. Проблема, которую я хотел решить, заключалась в создании полноценного нативного приложения путем подключения базы данных Google Firebase/Firestore к интерфейсу приложения, разработанному с помощью React Native.",
"owriteCaseAboutDatabase": "Я разработал базу данных с помощью Google Firebase для хранения данных двух пользователей, необходимых для тестирования. Позже я использовал Google Firestore для хранения данных чата пользователей",
"owriteCaseAboutInterface": "Для тестирования интерфейса были использованы Android Studio и приложение Expo Go для Android. Для разработки двух интерфейсов приложения: начального интерфейса и интерфейса чата использовался React Native. Первоначальный интерфейс был разработан с использованием доступных элементов в соответствии с рекомендациями React Native. Он позволяет задать имя пользователя и выбрать цвет фона для интерфейса чата. В интерфейсе чата отображается имя пользователя, История сообщений, текстовое поле и меню с дополнительными файловыми опциями. Для разработки необходимых функций я использовал такие библиотеки, как Gifted Chat, Expo Media, Expo Image Picker, Stack Navigation и другие. AsyncStorage использовался для обеспечения автономного использования.",
"owriteCaseAboutServer": "Написание логики сервера началось с создания учетной записи в Google Firebase и ее настройки. Затем я приступил к настройке конфигурации Google Firebase.",
"owriteCaseConclusionData": "Приложение OWrite было предпоследним проектом, над которым я работал на курсе веб-разработки Full-Stack. Когда все было закончено, я сосредоточился на дальнейшем улучшении своих навыков разработки, в частности, добавил еще один фреймворк и систему проектирования в свой набор навыков, Angular и Material UI соответственно. Следующий проект потребовал создания интерфейса для API R3PLAY, на этот раз с использованием Angular и Material UI.",
"owriteCaseDurationData":"1 неделя",
"owriteCaseChallenge1": "Проблемы, с которыми я столкнулся во время этого проекта, были больше связаны с самим временем, оставшимся на курсе, чем с фактической работой над кодом. Как упоминалось ранее, поскольку я приложил дополнительные усилия для улучшения API и интерфейсов R3play App, до конца курса оставалось меньше времени. В результате мне пришлось спланировать свое расписание, чтобы завершить проект вовремя и сосредоточиться только на необходимых и рекомендуемых функциях.",
"owriteCaseChallenge2": "Мне особенно понравилось разрабатывать это приложение, потому что я всегда хотел погрузиться в разработку своих собственных приложений, и React Native был в моем списке дел. Кроме того, было приятно знать, что ранее приобретенные навыки (тайм-менеджмент и расстановка приоритетов) помогли мне очень быстро завершить проект и добавить новые навыки нативной разработки в мой набор инструментов.",
"owriteMainTakeaway1": "Практиковать создание real-time приложений на дополнительных проектах",
"owriteMainTakeaway2": "Исследовать тему разработки нативных приложений",
    
    
"pokedexLink":"API Pokedex",
"pokemonCaseHeading": "Кейс приложения Pokemon App",
"pokemonCaseIntroduction": "Pokemon App-это веб-приложение, разработанное с использованием HTML, CSS, Javascript и Bootstrap. Он предоставляет пользователям информацию о покемонах, полученную из API Pokedex. Пользователи могут получить доступ к следующей информации: идентификатор покемона, рост и вес, видеть изображения покемона спереди и сзади и искать покемона по имени.",
"PokemonCaseAim": "Приложение Pokemon было обязательным проектом, который я разработал в рамках курса полного погружения в разработку полного стека в CareerFoundry, чтобы продемонстрировать свое мастерство в веб-разработке с помощью JavaScript и Bootstrap",
"pokemonCaseAim": "Целью проекта было разработать полнофункциональное приложение, которое я мог бы добавить в свое профессиональное портфолио. Проблема, которую я хотел решить, заключалась в создании веб-приложения с использованием внешнего API и популярного CSS фреймворка.",
"pokemonCaseAboutApi": "Я использовал API Pokedex как часть необходимых инструментов проекта, чтобы заполнить приложение различной информацией о покемонах. Для этой цели были использованы Javascript promises для обработки асинхронных запросов и ответов К/из Pokedex API.",
"pokemonCaseAboutClient": "После завершения логической части программы я приступил к этапу стилизации, включив Bootstrap в качестве обязательного CSS-фреймворка. Задача состояла в том, чтобы использовать сетку, классы и компоненты Bootstrap для реализации необходимой функциональности. Наконец, я протестировал приложение на разных экранах, устройствах и операционных системах с помощью эмуляторов устройств/систем.",
"pokemonCaseConclusionData": "Приложение Pokemon стало первым проектом курса полного погружения в разработку полного стека. Когда он был завершен, я сосредоточился на улучшении своих навыков разработки, особенно на работе с Node.js, Express и API. Разработка моего собственного API была полезным и важным шагом на пути к дальнейшему овладению наиболее важными навыками серверной веб-разработки",
"pokemonCaseDurationData":"4 недели",
"pokemonCaseChallenge1": "Часть, которая требовала использования асинхронного Javascript, была наиболее трудоемкой, в то время как работа над стилизацией была относительно простой. В целом, на завершение проекта у меня ушел 1 месяц, что было примерно среднестатистическим на курсе. Также мне было трудно отобразить конкретную информацию о покемонах, как описано в документации Pokedex. Кроме того, мне пришлось решить проблему, из-за которой данные не отображались в интерфейсе.",
"pokemonCaseChallenge2": "Тем не менее, это был интересный и относительно простой в реализации проект. Мне понравилось погружаться в основы Javascript, изучая Ajax. Кроме того, меня вдохновила стилизация с помощью Bootstrap. Я также быстро приобрел полезные навыки работы с Javascript promises и API, чтения документации, стилизации с помощью CSS-фреймворков и устранения неполадок. К счастью, мой наставник помогал мне во время проекта, и я смог применить полученные навыки позже при внедрении дополнительных функций в веь-приложении.",
"pokemonMainTakeaway1": "Улучшить навыки решения проблем, практикуясь и используя образовательные ресурсы",
"pokemonMainTakeaway2": "Сохранять мотивацию, даже когда возникают временные трудности с обучением",
"pokemonMainTakeaway3": "Улучшить цифровую гигиену и найти время для отдыха",
    
    
    
"toDoCaseHeading": "Кейс To Do App",
"toDoCaseIntroduction": "To Do App-это адаптивное веб-приложение, разработанное с использованием HTML, Bootstrap и Javascript и предоставляющее пользователям возможность управлять своими задачами. Пользователи могут добавлять и удалять свои задачи, а также выполнять другие функции.",
"toDoCaseRequired": "To Do App был необходимым к выполнению мини-проект, который я разработал в рамках курса полного погружения в фулстек разработку в CareerFoundry, чтобы продемонстрировать свое мастерство работы с jQuery",
"toDoCaseAim": "Целью проекта было создать полнофункциональное веб-приложение, которым я мог бы пополнить свое профессиональное портфолио. Проблема, которую я хотел решить, заключалась в том, чтобы преобразовать обычный код Javascript в код jQuery.",
"toDoCaseAboutClient": "Получив исходный обычный код Javascript с базовой функциональностью приложения, я начал преобразовывать его в код jQuery. Эта задача позволила мне применить дополнительные функции и стили.",
"toDoCaseConclusionData": "Приложение To-Do было дополнительным мини-проектом, который я выполнял в рамках полного курса погружения, но мне нравилось добавлять к нему новые функции и стили, выходящие за рамки основные требования. Это быстро улучшило мои навыки jQuery, Bootstrap, отладки и работы с дополнительными библиотеками.",
"toDoCaseDurationData": "1 день на создание необходимой функциональности и около 3 недель для создания дополнительных функций.",
"toDoCaseChallenge1": "Разработка основных функций приложения не вызвала никаких трудностей, и я справился с задачей в течение 1 дня. Однако я не был доволен его функциональностью и решил найти дополнительное время для улучшения. Эти надстройки вызвали множество проблем с настройкой, поскольку различные библиотеки jQuery не работали должным образом вместе, как я планировал. К счастью, мой наставник помог мне устранить неполадки в работе. К дополнительным функциям, приложение мог:",
"toDoCaseChallenge2": "Благодаря новым функциям возможно:",
"toDoMainTakeaway1": "Улучшить навыки работы с Bootstrap",
"toDoMainTakeaway2": "Работать над навыками решения ошибок в коде",
"toDoMainTakeaway3": "Расширить возможности приложения в дальнейшем",
"toDoBeforeFeature1": "Добавлять / удалять задачи",
"toDoBeforeFeature2": "Изменять порядок задач в списке",
"toDoBeforeFeature3": "Вычеркивать задачи",
"toDoBeforeFeature4": "Показывать встроенные в браузер предупреждающие уведомления",
"toDoAfterFeature1": "Добавлять / удалять списки дел",
"toDoAfterFeature2": "Добавлять / удалять задачи в / из списка дел (включая нажатие клавиши \"Enter\" на клавиатуре)",
"toDoAfterFeature3": "Очистить поле ввода",
"toDoAfterFeature4": "Перемещать и вычеркивать задачи на мобильных устройствах с помощью jQuery Mobile и jQuery Touch Punch",
"toDoAfterFeature5": "Уведомления стали более привлекательными с помощью Bootstrap и jQuery UI",
"toDoAfterFeature6": "Просмотр руководства по использованию приложения на разных платформах с помощью Bootstrap",


"notFound": "Мы не смогли найти ресурс, который Вы искали",
"returnHomeParagraph": "Но вы всегда можете вернуться на ",
"returnHomeLink": "Главную страницу",

"copySkill": "Доработка текста",
"terminalSkill": "Работа в командной строке",
"accessibilitySkill":"Доступность",
"externalApiSkill": "Внешний API",
"nativeSkill":"Нативная разработка приложений",
"troubleshootingSkill":"Устранение ошибок в коде",
"TDDSkill":"Разработка на основе тестирования",
"kanbanSkill": "Kanban-доска",
"agileSkill": "Рабочий процесс Agile",
"documentationSkill" :"Умение документировать",
"userStoriesSkill":"Пользовательские истории",
"collabSkill": "командная работа",
"feedbackSkill": "Предоставление обратной связи",
"contributeSkill": "Участие в проекте",
"testingSkill": "Разработка с позиции тестирования",
"apiSkill": "Google Calendar API",
"pwsSkill":"Прогрессивные веб-приложения",
"responsiveSkill": "Адаптивный дизайн",
    "deploySkill": "Размещение веб-сайта онлайн",
    "caseLead":"Роль: ведущий разработчик",
    "caseTutor": "Tonny Ntambaazi:",
    "caseTutor2":"Творческий директор",
    "caseMentor": "Nizar Triki:",
    "caseMentor2":"Менеджер программного обеспечения",
    "r3playMainTakeaway1":"Сначала сосредоточиться на необходимой функциональности",
    "r3playMainTakeaway2":"Улучшить навыки тайм-менеджмента",
    "r3playMainTakeaway3": "Углубить знания об используемых технологиях, читая и практикуя больше",
    "r3playMainTakeaway4": "не сомневаться обратиться за помощью в случае технических вопросов",
    "r3playCaseChallenge1": "Разработка бэкэнда была самой трудоемкой, в то время как работа на стороне клиента была наиболее сложной технически. В результате мне потребовалось больше времени, чтобы завершить разработку полного стека по сравнению с обычной продолжительностью двух проектов CareerFoundry. Причина этого заключалась в том, что я сосредоточился на функциональных и визуальных улучшениях обоих проектов, которые превышали основные требования. Также мне потребовалось больше времени, чтобы решить проблемы условного рендеринга элементов JSX, как реализовать Redux в React и логику рендеринга предложений фильмов для пользователя.",
    "r3playCaseChallenge2": "Тем не менее, это был мой любимый проект. Мне понравилось разрабатывать пользовательский интерфейс и работать с информацией в базе данных. Я также быстро улучшил свои навыки работы в командной строке, работы с запросами в базе данных MongoDB NoSQL, условной визуализации, фильтрации данных, настройки компонентов React Bootstrap, а также навыки тайм-менеджмента и установления приоритетов. К счастью, мой квалифицированный учитель и наставник помогли мне во время проекта, и я смог применить полученные навыки позже, внедрив другие функции в приложение.",
    "r3playSlide1Heading":"Интерфейс входа в систему",
    "r3playSlide2Heading":"Интерфейс фильмов",
    "r3playSlide3Heading":"Интерфейс профиля",
    "r3playSlide1Description": "Интерфейс входа в приложение R3play, где пользователи могут войти в приложение",
    "r3playSlide2Description": "Интерфейс фильмов в приложении R3play, который отображает список фильмов, доступных в приложении",
    "r3playSlide3Description": "Интерфейс профиля в R3play App, где пользователи могут изменять информацию своего облікового запису",
    
    
    "myFlixSlide1Heading":"Интерфейс входа в систему",
"myFlixSlide2Heading":"Интерфейс фильмов",
"myFlixSlide3Heading":"Интерфейс профиля",
"myFlixSlide1Description": "Интерфейс входа в приложение MyFlix, где пользователи могут авторизоваться в приложении",
"myFlixSlide2Description": "Интерфейс фильмов в приложении MyFlix, который отображает список фильмов, доступных в приложении",
"myFlixSlide3Description": "Интерфейс профиля в приложении MyFlix, где пользователи могут изменять информацию о своей учетной записи",


"meetSlide1Heading":"Общий интерфейс",
"meetSlide2Heading":"Ошибки и предупреждения",
"meetSlide3Heading": "Сведения о событии",
"meetSlide1Description": "События Meet App отображаются в приложении с формой, позволяющей корректировать результаты",
"meetSlide2Description": "Интерфейс событий Meet App отображается с предупреждениями и ошибками из-за неправильно введенных данных",
"meetSlide3Description": "Интерфейс событий Meet App с информацией о событиях",


"owriteSlide1Heading":"Начальный интерфейс",
"owriteSlide2Heading":"Интерфейс чата",
"owriteSlide1Description": "Исходный интерфейс приложения Owrite, где пользователи могут выбрать тему и войти в чат",
"owriteSlide2Description": "Интерфейс чата приложения Owrite, в котором пользователи могут общаться, в том числе отправлять аудио и графические файлы",


"pokemonSlide1Heading": "Приветствие",
"pokemonSlide2Heading": "Результаты поиска покемонов",
"pokemonSlide3Heading": "Карточка покемонов",
"pokemonSlide1Description": "Главная страница приложения Pokemon с приветствием",
"pokemonSlide2Description": "Веб-приложение Pokemon отфильтровало результаты поиска покемонов, отображаемые в виде списка",
"pokemonSlide3Description": "карта покемонов с данными, которые пользователь может просмотреть, нажав на имя покемона",


"toDoSlide1Heading": "Главная страница",
"toDoSlide2Heading": "Новый список",
"toDoSlide3Heading": "Уведомления",
"toDoSlide1Description": "Главная страница приложения, где пользователи могут просматривать советы по использованию приложения и добавлению первого списка",
"toDoSlide2Description": "Добавлен новый список дел",
"toDoSlide3Description":"Когда пользователь оставляет поле ввода пустым и пытается добавить новую задачу, появляется уведомление",


"cookieInfo1": "Это приложение использует файлы cookie и собирает данные о посетителях. Узнайте больше об использовании ",
"cookieInfo2" : "и",
"cookieInfo3": "",
"cookieLink1": "Cookie",
"cookieLink2": "Конфиденциальности",
"cookieConfirm": "Я согласен",



"menu": {
"portfolioMenu": "Portfolio App",
"aboutMenu":"Информация",
"projectsMenu":"Проекты",
"casesMenu":"Кейсы",
"testimonialsMenu":"Рекомендации",
"contactMenu":"Контакт",
"resumeMenu":"Резюме",
"r3playMenu": "R3play App",
"myFlixMenu": "MyFlix App",
"meetMenu": "Meet App",
"owriteMenu": "Owrite App",
"pokemonMenu": "Pokemon App",
"toDoMenu": "To Do App",
"policiesMenu":"Политика",
"cookies": "Cookies",
"privacy": "Конфиденциальность"
},
"footer": {
"copy": " © Евгений Айрапетян, 2024. Все права защищены.",
"impressumFooter":"Отпечаток",
"toggleTitle": "Нажмите, чтобы переключить боковую панель"
},


"notFoundImageAlt": "Изображение, показывающее старый телевизор",
"caseHeroAlt": "Изображение, показывающее скриншот из кейса проекта",
"caseSliderAlt": "Изображение, показывающее скриншот из одного из интерфейсов приложения",
"logoAlt":"Изображение, показывающее логотип приложения",
"contactImageAlt": "Изображение, показывающее письменные принадлежности и пишущего человека",
"testimonialsSliderImageAlt": "Изображение, показывающее рецензента",
"testimonialsImageAlt": "Изображение, показывающее работу команды",
"projectsSliderImageAlt":"Изображение, показывающее скриншот, сделанный из живой версии приложения",
"projectsImageAlt": "Изображение рабочего места с ноутбуком и аксессуарами",
"aboutCvDeAlt": "Значок с изображением немецкого флага",
"aboutCvEnAlt": "Значок с изображением американского флага",
"aboutCvUkAlt": "Значок с изображением украинского флага",
"aboutCvDeTitle": "Нажмите здесь, чтобы загрузить мое резюме на немецкий язык. Возможно, вам придется использовать средство просмотра файлов, такое как Adobe Acrobat или подобное",
"aboutCvEnTitle": "Нажмите здесь, чтобы загрузить мое резюме на английском языке. Вам может понадобиться программа для просмотра файлов, например Adobe Acrobat или аналогичная",
"aboutCvUkTitle": "Нажмите здесь, чтобы загрузить мое резюме на украинском языке. Вам может понадобиться средство просмотра файлов, например Adobe Acrobat или аналогичный",
"toggleResumeTitle": "Показать или скрыть файлы резюме",
"checkOutCodeTitle": "Просмотр кода на Github",
"profileImageAlt": "Фотография, на которой изображен мужчина в куртке"
}