{
  "notificationCloseTitle":"Chiudi la finestra",
  "whatsNewInfo":"Novità: l'app è stata spostata su React.js, è ora localizzato, e ha un tema toggler. Leggi di più ",
  "whatsNewLink":"qui",
  "darkModalMessage": "Benvenuti nel lato oscuro",
"lightModalMessage": "Benvenuti dal lato della luce",
"modalConfirm": "Andiamo!",
"modalHint": "Clicca per chiudere il modale",
    "app_title": "Yevhenii Airapetian - Portafoglio",
    "languages": "Lingue",
    "themeSwitcherLightHint": "Clicca qui per passare al tema della luce",
"themeSwitcherDarkHint": "Clicca qui per passare al tema scuro",
    "welcome text": "Ciao, sono Yevhenii!",
    "resume": "Resume",
    "introduction":"Sono uno sviluppatore web appassionato di tecnologia",
    "experience":"Con precedenti esperienze nell'insegnamento delle lingue straniere e nella scrittura accademica, sono entusiasta di intraprendere una carriera come sviluppatore web.",
    "first focus":"Mi sono sempre concentrato sulla fornitura di un lavoro di alta qualità che rispettasse le scadenze, impiegando le mie raffinate capacità di problem solving, gestione del tempo e pensiero logico.",
    "second focus":"Il mio obiettivo è quello di combinare la mia esperienza con le mie aspirazioni professionali per contribuire a creare soluzioni software funzionali, reattive e accessibili.",
    "availability":"Sono disponibile per l'impiego in loco e ibrido nella zona di Berlino e Potsdam o da remoto.",
    "hobbies":"Oltre alle mie passioni nello sviluppo web, sono anche un fotografo di hobby attivo e appassionato di fitness, e qualsiasi altro giorno puoi trovarmi fuori a scattare foto o sollevare pesi pesanti.",
    "code":"Codice",
    "projects":"Progetti",
    "projectsInfo":"Qui troverai i progetti di sviluppo web attuali che ho completato e su cui ho lavorato. Tutti hanno collegamenti ipertestuali alla base di codice e ai casi di progetto, la maggior parte ha un collegamento alla versione distribuita e alcuni hanno anche collegamenti aggiuntivi.",
    "projectsViewTip": "Usa i controlli del cursore per fare clic sull'elenco dei progetti. Passa il mouse su una diapositiva specifica per accedere ai collegamenti del progetto. Toccare una diapositiva specifica per visualizzare ulteriori informazioni (sul dispositivo mobile)",    
    "r3playInfo":"Il front-end dell'API Web R3play che consente agli utenti di registrarsi e annullare la registrazione, visualizzare informazioni su film, serie TV e anime e gestire l'elenco dei preferiti.",
    "r3playAPIInfo":"Un'API Web sviluppata con Node.js, Express e MongoDB, che consentono agli utenti di registrarsi, annullare la registrazione, visualizzare informazioni su film, serie TV e anime e gestire i preferiti.",
    "myFlixInfo":"Una parte front-end per l'API Web R3play progettata con Angular, Typescript e Material UI che consente agli utenti di registrarsi, visualizzare informazioni sui film e aggiungere preferiti.",
    "meetInfo":"Un'app Web progressiva scritta con funzioni AWS Lambda che utilizza l'autorizzazione e l'autenticazione OAuth2 e visualizza gli eventi dall'API Google Calendar di CareerFoundry.",
    "owriteInfo":"Un'applicazione nativa React che consente agli utenti di chattare. Gli utenti possono impostare un nome utente, scegliere il colore di sfondo della chat e inviare messaggi di testo, immagini e registrazioni audio.",
    "pokemonInfo":"Un'app Pokemon reattiva che recupera Pokemon con Ajax da un'API Pokedex esterna e visualizza le loro informazioni come altezza, peso, ID e immagini anteriori e posteriori dei Pokemon",
    "toDoInfo":"Un jQuery e Bootstrap to-do app che consente agli utenti di gestire to-dos. Gli utenti possono aggiungere, eliminare e riorganizzare le cose da fare, creare ed eliminare elenchi di cose da fare e consultare una guida su come utilizzare l'app.",
    "portfolioInfo": "Un'applicazione Web responsive sviluppata con React, React Bootstrap e considerazioni sull'accessibilità, che consente agli utenti di visualizzare informazioni sui miei progetti, ecc.",
    
    
    "r3playInfoTitle": "Clicca per saperne di più sull'API R3play",
"R3playInfoTitleAPIDeployed": "Fai clic per aprire l'API R3play",
"r3playInfoTitleGithub": "Fai clic per aprire il repository Github dell'API R3play",
"myFlixInfoTitle": "Clicca per saperne di più sull'app MyFlix",
"myFlixInfoTitleGithub": "Fai clic per aprire il repository Github dell'app MyFlix",
"myFlixInfoTitleKanban": "Fai clic per aprire la scheda Kanban del progetto myFlix App",
"meetInfoTitle": "Fai clic per saperne di più sull'app Meet",
"meetInfoTitleDeployed": "Fai clic per aprire l'app Meet",
"meetInfoTitleGithub": "Fai clic per aprire il repository Github dell'app Meet",
"owriteInfoTitle": "Clicca per saperne di più sull'App Owrite",
"owriteInfoTitleGithub": "Fai clic per aprire il repository Github dell'app Owrite",
"pokemonInfoTitle": "Clicca per saperne di più sull'App Pokemon",
"pokemonInfoTitleDeployed": "Clicca per aprire l'app Pokemon",
"pokemonInfoTitleGithub": "Fai clic per aprire il repository Github dell'app Pokemon",
"toDoInfoTitle": "Clicca per saperne di più sull'app ToDoList",
"toDoInfoTitleDeployed": "Fai clic per aprire l'app ToDoList",
"toDoInfoTitleGithub": "Fai clic per aprire il repository Github dell'app ToDoList",
"portfolioInfoTitle": "Clicca per saperne di più sull'App Portfolio",
"portfolioInfoTitleDeployed": "Clicca per aprire l'App Portfolio",
"portfolioInfoTitleGithub": "Fai clic per aprire il repository Github dell'app Portfolio",
"testimonialSliderMore":"Clicca per vedere il testo completo della testimonianza",
  
    
    "projectsSliderMore":"Altro",
    "testimonials":"Passaparola",
    "wordOfMouth":"Non sarei dove sono oggi senza tutte le persone meravigliose con cui ho avuto il privilegio di lavorare.",
    "testimonialsViewTip": "Usa i controlli del cursore per fare clic sull'elenco delle testimonianze. Passa il mouse sopra le intestazioni delle testimonianze per saperne di più. Tocca una testimonianza specifica per visualizzare ulteriori informazioni (sul dispositivo mobile)",    "testimonial1":"Maya Septriana, Consulente di carriera, CareerFoundry",
    "testimonial2":"Nizar Triki, Responsabile dello sviluppo software chez Expensya",
    "testimonial3":"Dejan Gogov, Sviluppatore Web, Wild Code School",
    "testimonial1Text":"Yevhenii è qualcuno con cui è così facile collaborare. Cerca sempre l'eccellenza. Ogni volta che gli do un feedback sarebbe disposto ad ascoltare e regolare la presentazione...",
    "testimonial2Text":"Ho avuto l'opportunità di fare da mentore a Yevhenii durante la sua formazione di sviluppo web presso CareerFoundry. Autosufficienza di Yevhenii, rapida comprensione dei concetti...",
    "testimonial3Text":"Durante il nostro bootcamp Fullstack di 6 mesi, Yevhenii ha costantemente mostrato un comportamento positivo e amichevole. Ha affrontato i compiti con determinazione...",
    "testimonialsMore":"Altro",
    "contact":"Contatto",
    "suggestion":"Vuoi lavorare insieme o avere un suggerimento? Sono aperto a opportunità di reclutamento e commenti",
    "eMailMe":"Sentitevi liberi di scrivermi utilizzando il modulo sottostante",
    "contactFormHeader":"Contatto",
    "firstName":"Nome",
    "firstNamePlaceholder":"Joey",
    "lastName":"Cognome",
    "lastNamePlaceholder":"Tribbiani",
    "phoneNumber":"Numero di telefono",
    "phoneNumberPlaceholder":"+49 1234 5678910",
    "eMail":"E-mail",
    "eMailPlaceholder":"example@mail.com",
    "messageOrComment":"Messaggio o commento. Per favore sii gentile!",
    "messageOrCommentPlaceholder":"Il tuo messaggio",
    "contactFormTip":"I campi contrassegnati con l'asterisco sono obbligatori",
    "contactFormPoweredBy":"Alimentato da",
    "caseWorkflow":"Flusso di lavoro",
"caseUpgrade":"Aggiornamento",
    "caseDatabase":"Database",
    "caseApi": "API",
    "caseInterface":"Interfaccia app",
    "caseTDD":"Sviluppo guidato da test",
    "caseServerAndApi":"Lato server e API",
    "caseAgile":"Flusso di lavoro agile",
    "caseOverview":"Panoramica",
    "casePurpose":"Scopo e contesto",
    "caseObjective":"Obiettivo",
    "caseServer":"Lato server",
    "caseClient":"Lato client",
    "caseApproach":"Approccio",
    "caseDuration":"Durata",
    "caseRetrospective":"Retrospettiva",
    "caseChallenges":"Sfide",
    "caseConclusion":" Risultati principali",
    "caseMainTakeaways":"Principali take away per progetti futuri",
    "apiPreview":"Anteprima API",
    "appPreview":"Anteprima app",
    "caseTechnologies":"Tecnologie utilizzate / Competenze",
    "caseCredits":"Crediti",
    "r3playCaseHeading":"Caso di studio dell'app R3play",
    "r3playCaseIntroduction":"R3play è un'applicazione web, sviluppata utilizzando lo stack MERN, che fornisce agli utenti informazioni su film, serie TV e anime. Gli utenti possono accedere alle informazioni su film, registi e generi. Gli utenti possono creare un account, aggiornare le proprie informazioni e creare un elenco di film, serie TV e anime preferiti.",
    "r3playCaseRequired":"R3play era un progetto richiesto che ho sviluppato come parte del mio corso full-stack immersion a CareerFoundry per dimostrare la mia padronanza dello sviluppo web full-stack utilizzando JavaScript.",
    "r3playCaseAim":"Il progetto mirava a sviluppare un'app full-stack completamente funzionante che avrei potuto aggiungere al mio portfolio professionale. Il problema che volevo risolvere era quello di creare l'applicazione Web full-stack completa collegando il lato server precedentemente progettato e il lato client per l'applicazione da zero.",
    "r3playCaseAboutServer":"Ho sviluppato un'API RESTful usando Node.js ed Express, che interagisce con un database non relazionale (MongoDB). L'API utilizza metodi HTTP comuni come GET, PUT, POST ed DELETE. Per recuperare i dati da e memorizzare i dati nel database, vengono utilizzati metodi CRUD. L'API fornisce informazioni su film, serie TV e anime in formato JSON.",
    "caseViewEndpoints":"Visualizza endpoint",
    "r3playCasePostman":"Ho usato Postman per testare le risposte e le richieste all'API. Ho anche fatto uso di autenticazione HTTP di base e autenticazione JWT per fornire le funzionalità di autenticazione e autorizzazione.",
    "r3playCaseAboutClient":"Dopo aver completato il progetto API, ho proceduto a creare l'interfaccia front-end di cui gli utenti avrebbero bisogno quando interagivano con la logica e i dati dall'API e dal database. Si tratta di una singola pagina, applicazione web reattivo, sviluppato con React e React-Redux. Visualizza diverse viste dell'interfaccia, tra cui (ma non solo) una vista principale (mostra un elenco di tutti i film, serie TV e anime), un singolo film, serie TV e viste anime (mostra i dati su un singolo film, serie TV e anime e consente agli utenti di aggiungerli o eliminarli dalla loro lista di preferiti), una vista di accesso, una vista di registrazione e una vista del profilo (in cui gli utenti possono aggiornare i loro dati utente e l'elenco dei preferiti).",
    "caseSliderTip": "Usa i controlli del cursore per fare clic sull'elenco dei progetti. Passa il mouse sopra le intestazioni delle diapositive per saperne di più. Tocca una diapositiva specifica per visualizzare ulteriori informazioni (sul dispositivo mobile)",    "r3playCaseDurationData":"12 settimane in totale (backend: 7 settimane, frontend: 5 settimane)",
    "r3playCaseConclusionData":"L'app movie è stata solo la seconda applicazione web completa che ho sviluppato nel corso di sviluppo web Full-Stack. Quando è stato finito, mi sono concentrato sul miglioramento delle mie capacità di sviluppo, in particolare l'approccio di sviluppo guidato dai test. Richiede l'implementazione della fase di test prima di aggiungere la logica funzionale effettiva, consentendo uno sviluppo più sicuro, privo di bug e più rapido.",
    
    

    "portfolioCaseHeading": "Portfolio App Caso di studio",
    "portfolioCaseIntroduction":"Portfolio App è un'applicazione web responsive, sviluppata utilizzando React e React Bootstrap, che fornisce agli utenti informazioni sui miei progetti attuali, testimonianze, contatti e informazioni sulle piattaforme social ed è localizzata in diverse lingue straniere. Gli utenti possono accedere alle informazioni in viste separate, tradurre l'app nella loro lingua preferita e cambiare lo stile in un tema chiaro o scuro. ",
    "portfolioCaseRequired":"Portfolio App era un progetto richiesto che ho sviluppato come parte del mio \"Intro to web-development course\" a CareerFoundry per dimostrare la mia padronanza di HTML, CSS e implementazione di siti web. Inoltre, ho padroneggiato pratiche di sviluppo web diffuse come test delle app, minimizzazione CSS, accessibilità, supporto di browser più vecchi e animazioni CSS.",
    "portfolioCaseAim": "Il progetto mirava a sviluppare e implementare un sito web statico pienamente funzionante che potessi utilizzare come mio portfolio professionale. Il problema che volevo risolvere era quello di utilizzare gli strumenti trattati nel \"Intro to web-development course\" a CareerFoundry per costruire e distribuire un frontend funzionante che sarebbe stato utilizzato come mio portfolio professionale.",
    "portfolioCaseAboutWorkflow": "Nelle prime fasi del processo di sviluppo, ho strutturato il contenuto con HTML e poi disegnato le pagine con CSS semplice. Il Totalmente.il plugin js ha contribuito a strutturare e modellare il sito Web secondo le linee guida consigliate per l'accessibilità web. Queste linee guida esistono per aiutare le persone con limitazioni fisiche o di altro tipo ad avere una migliore esperienza utente su Internet. Per questi scopi sono stati utilizzati tag speciali \"aria\", descrizioni informative e dati testuali alternativi. Nelle fasi finali del progetto, ho testato il sito Web per un corretto lavoro su vari sistemi operativi e browser, incluso l'utilizzo di javascript di fallback per il supporto del browser Internet Explorer più vecchio.",
    "portfolioCaseAboutUpgrade1":"Dopo il completamento della mia carriera di Fonderia \"Full-Stack Web-Development Program\" e mentre studiavo al CareerFoundry \" Job Preparation course\", ho deciso di modificare l'app in vari modi. In primo luogo, il sito Web ha ottenuto nuove pagine con i dati dei casi dei progetti, dove ho descritto in dettaglio come ho lavorato su ciascun progetto mentre studiavo a CareerFoundry. In secondo luogo, ho aggiornato lo stile per essere più visivamente piacevole, funzionale ed estetico. Tuttavia, dal momento che i siti Web statici diventano sempre più obsoleti al giorno d'oggi, era il momento di migrare il mio portafoglio in una delle librerie Javascript ampiamente utilizzate dalla comunità di sviluppatori. Come, dopo aver completato diversi progetti nel bootcamp con React.js, ed essendo più esperto con esso, ho deciso di usarlo come scheletro del mio progetto.",
    "portfolioCaseAboutUpgrade2": "Ho inizializzato il lavoro con un comando create react app, quindi spostato e riscritto tutti i file HTML e CSS per separare i componenti della funzione e installato le dipendenze del progetto necessarie. I progetti, le testimonianze e i casi hanno ottenuto i loro cursori separati con esempi e video walk-through. Più tardi, ho localizzato l'app in diverse lingue straniere, introdotto un tema scuro e aggiornato l'app per salvare le preferenze di lingua e tema dell'utente. E alla fine, ho trasformato il mio portafoglio in un'applicazione Web progressiva. Con questa funzione, gli utenti possono installare l'app su dispositivi desktop e mobili, imitando un'esperienza app nativa come su piattaforme Android o Windows.",
    "caseTotally": "Visita totalmente.archivio js Github",
    "portfolioCaseAboutClient": "Ho costruito l'interfaccia front-end per fornire agli utenti la possibilità di interagire con i dati relativi al mio portfolio professionale. In origine era un sito web statico, sviluppato utilizzando HTML semplice, CSS e Totalmente.js, un plugin Javascript per testare l'accessibilità. Aveva pagine HTML separate per le principali, i progetti, i contatti e altre informazioni.",
    "portfolioCaseDurationData": "2 settimane in totale per il progetto iniziale. 3-6 mesi in somma per il risultato corrente",
    "portfolioCaseConclusionData": "Il sito web Portfolio è stato il primo progetto nel bootcamp di sviluppo web di Career Foundry. Quando è stato finito, ho iniziato il \"corso Full-Stack Immersion\" con il lavoro sull'app Pokemon.",
    "portfolioCaseConclusionData2": "È stata un'esperienza fantastica e gratificante progettare e eseguire il debug dell'app nel suo stato iniziale fino agli ultimi miglioramenti che ha. Ho anche aggiunto nuove e costruito sulle vecchie abilità (anche quando lavoro da solo), come la lucidatura della copia, il debug della distribuzione di app React, l'utilizzo di librerie di localizzazione, l'introduzione e la personalizzazione dei temi, il lavoro con l'archiviazione locale, pratiche di stile migliori e altri.",
    "portfolioCaseChallenge": "Lo sviluppo del progetto iniziale è stato relativamente facile e privo di errori poiché avevo già esperienza nelle tecnologie necessarie per questo. In effetti, sono riuscito a completarlo 1 settimana prima della scadenza richiesta e ho presentato le mie osservazioni come esempio per gli altri studenti.",
    "portfolioCaseChallenge2": "Tuttavia, quando mi sono trasferito alle tecnologie più complesse e oltre i requisiti del progetto da solo, ho riscontrato diversi problemi. Un problema era che non potevo introdurre completamente il tema scuro nell'app. Quando ho acceso il tema scuro, solo una parte dell'app ha cambiato il suo stile. Un altro relativo alle difficoltà di distribuzione e alle impostazioni di reazione richieste per esso. Fortunatamente, le conoscenze acquisite durante il bootcamp mi hanno aiutato a risolvere questi ostacoli e sono stato in grado di:",
    "portfolioCaseChallengeDetail1": "Usa le mie capacità di ricerca e risoluzione dei problemi per risolvere i problemi relativi al tema oscuro",
    "portfolioCaseChallengeDetail2": "Ricerca e risoluzione dei problemi relativi alla distribuzione",
    "portfolioMainTakeaway1": "La persistenza è un'abilità importante nello sviluppo web, così come la scelta di compromettere e impostare le priorità",
    "portfolioMainTakeaway2": "A volte un bug può essere causato inaspettatamente e una soluzione ha bisogno di una migliore attenzione ai dettagli",
    "portfolioMainTakeaway3": "C'è sempre spazio per migliorare nei tuoi progetti, quindi è fondamentale capire il momento in cui andare avanti e / o dare priorità",
    "portfolioMainTakeaway4": "Il codice (rapidamente) diventa obsoleto o ha bisogno di un aggiornamento, quindi il check-in dei progetti più vecchi di volta in volta è una buona idea ",
    
    "portfolioSlide1Heading": "Informazioni sulla vista (tema luce)",
    "portfolioSlide2Heading": "Informazioni sulla vista (tema scuro)",
    "portfolioSlide3Heading": "Vista caso progetto localizzato",
    "portfolioSlide1Description": "L'app Portfolio Informazioni sulla vista in cui gli utenti possono leggere di più sull'autore, accedere alla base di codice e riprendere (visualizzato nel tema light)",
    "portfolioSlide2Description": "L'app Portfolio Informazioni sulla vista in cui gli utenti possono leggere di più sull'autore, accedere alla base di codice e riprendere (visualizzato in tema scuro)",
    "portfolioSlide3Description": "Una delle viste dei casi dei progetti localizzata (nella lingua tedesca in questo esempio)",


    
    "myFlixCaseHeading":"MyFlix App caso di studio",
    "myFlixCaseIntroduction":"MyFlix-Angular-App è un'app web, sviluppata utilizzando lo stack MEAN, che fornisce agli utenti informazioni sui film. Gli utenti possono accedere alle informazioni su film, registi e generi. Gli utenti possono creare un account, aggiornare le proprie informazioni e creare un elenco di film preferiti.",
    "myFlixCaseRequired":"MyFlix-Angular-App era un progetto richiesto che ho sviluppato come parte del mio corso full-stack immersion a CareerFoundry per dimostrare la mia padronanza dello sviluppo web full-stack utilizzando JavaScript. Inoltre, ho praticato la gestione agile del progetto, la fornitura di feedback e le capacità di generazione della documentazione.",
    "myFlixCaseAboutServer":"Ho sviluppato un'API RESTful usando Node.js ed Express che interagisce con un database non relazionale (MongoDB). L'API utilizza metodi HTTP comuni come GET, PUT, POST ed DELETE. Per recuperare i dati da e memorizzare i dati nel database, vengono utilizzati metodi CRUD. L'API fornisce informazioni su film, serie TV e anime in formato JSON.",
    "myFlixCasePostman":"Ho usato Postman per testare le risposte e le richieste all'API. Ho anche fatto uso di autenticazione HTTP di base e autenticazione JWT per fornire le funzionalità di autenticazione e autorizzazione.",
    "myFlixCaseAgileData":"Il lavoro sul progetto è iniziato con la creazione della scheda Kanban e il riempimento con i requisiti del progetto e le storie degli utenti. Quando un'attività di progetto è stata completata, è stata spostata nella sezione \" Fatto\". Inoltre, ho generato una documentazione dettagliata con Typedoc secondo i requisiti del progetto.",
    "myFlixCaseAim": "Il progetto mirava a sviluppare un'app full-stack completamente funzionante che potessi aggiungere al mio portfolio professionale. Il problema che volevo risolvere era quello di creare l'applicazione Web full-stack completa collegando il lato server precedentemente progettato e il lato client per l'applicazione da zero.",
"myFlixCaseConclusion": "L'app myFlix è stata l'ultima applicazione web completa che ho sviluppato nel corso di sviluppo web Full-Stack. Quando è stato finito, ho proceduto a migliorare il mio portafoglio.",
"myFlixCaseAboutClient": "Ho creato l'interfaccia front-end per consentire agli utenti di interagire con la logica e i dati dall'API e dal database. Si tratta di una singola pagina, applicazione web reattivo, sviluppato con Angular e Material UI. Visualizza diverse viste dell'interfaccia, tra cui una vista principale (mostra un elenco di tutti i film, un pulsante per gestire i preferiti e pulsanti per visualizzare informazioni aggiuntive sul film), una vista di accesso/registrazione e una vista profilo (in cui gli utenti possono aggiornare i propri dati utente).",
"myFlixCaseConclusionData": "L'app myFlix è stata l'ultima applicazione web completa che ho sviluppato nel corso di sviluppo web Full-Stack. Quando è stato finito, ho proceduto a migliorare il mio portafoglio.",
"myFlixCaseConclusionData2": "Le difficoltà che ho incontrato sono accadute alla fine del progetto e legate più alle peculiarità di Angular e Github. Un problema si è verificato quando Github pages ha rifiutato di distribuire l'app per un lungo periodo. L'altro si è verificato quando le modifiche locali alla base di codice non sono state visualizzate nell'app distribuita. Per risolvere questo problema, ho contattato il mio mentore e tutor e, durante una sessione di programmazione in coppia, siamo riusciti a risolvere i problemi.",
"myFlixCaseConclusionData3": "È stata anche un'esperienza utile nel debug e nella risoluzione dei problemi, utilizzando i comandi del terminale git, le specifiche di lavoro con Angular e le sessioni di programmazione delle coppie. Ho anche aggiunto nuove competenze al mio arsenale, come Typescript, Angular, Material UI, commenting del codice corretto, collaboration e altri.",
"myFlixCaseDurationData": "Quasi 1,5 settimane (10 giorni)",
"myFlixCaseChallenge": "Lo sviluppo dell'app myFlix ha richiesto molto meno tempo e sforzi rispetto all'app R3play React poiché:",
"myFlixCaseChallengeDetail1": "L'API è già stata creata",
"myFlixCaseChallengeDetail2":" L'ampia pratica con React ha aiutato a progredire più velocemente",
"myFlixCaseChallengeDetail3": "Non ho aggiunto molte funzionalità aggiuntive e ho rispettato i requisiti del corso di base",
"myFlixCaseChallengeDetail4":" Il tempo rimasto nel programma era già limitato",
"myFlixMainTakeaway1": "Migliora le funzionalità dell'app per riflettere le caratteristiche dell'app R3play",
"myFlixMainTakeaway2": "Ricerca di più su Typescript",
"myFlixMainTakeaway3": "Per saperne di più su Material UI",
"myFlixMainTakeaway4": "Continua ad esplorare altre tecnologie e best practice nello sviluppo web",



"meetCaseHeading":"Meet App caso di studio",
"meetCaseIntroduction": "Meet App è un'applicazione Web progressiva reattiva, sviluppata utilizzando l'approccio di sviluppo test-driven utilizzando le funzioni AWS Serverless Lambda, la schermata di autenticazione e autorizzazione di OAuth2 Google e la libreria Recharts per consentire agli utenti di visualizzare gli eventi API di Google Calendar. Gli utenti possono autenticarsi con Google, specificare la città e il numero di eventi per visualizzare gli eventi, e leggere di più su di loro. L'app può essere installata su desktop / mobile grazie alle raccomandazioni PWA, utilizzata sia online che offline, e mostra notifiche quando vengono inseriti dati errati e/o la connessione Internet viene persa.",
"meetCaseRequired": "Meet App era un progetto richiesto che ho sviluppato come parte del mio corso full-stack immersion presso CareerFoundry per dimostrare la mia padronanza delle competenze di sviluppo web full-stack basate su test utilizzando JavaScript e tecnologie serverless.",
"meetCaseAboutTDD": "Ho sviluppato l'applicazione scrivendo prima le storie degli utenti. Con l'aiuto dell'approccio di sviluppo test-driven, ho incorporato l'unità, l'integrazione, l'accettazione dell'utente e i metodi di test end-to-end per scrivere i test richiesti prima di implementare il codice.",
"meetCaseAboutServerAndApi": "Ho sviluppato il lato server utilizzando le funzioni Lambda serverless AWS come requisito per il progetto. L'uso del serverless consente di ridurre il lavoro extra per la gestione di un server e semplifica la scalabilità. Per i dati degli eventi dell'app, è stato utilizzato Google Calendar di CareerFoundry. La schermata di autenticazione di Google OAuth2 è stata configurata per autenticare e autorizzare gli utenti all'app. Nelle fasi finali dello sviluppo, ho utilizzato il service worker di React per trasformare l'app in un'applicazione Web progressiva. La libreria Recharts consente la visualizzazione dei dati degli eventi sotto forma di due tipi di grafici (Scatter e Pie).",
"meetCaseAim": "Il progetto mirava a sviluppare un'app full-stack completamente funzionante che potessi aggiungere al mio portfolio professionale. Il problema che volevo risolvere era quello di creare un'applicazione Web completa full-stack utilizzando l'approccio di sviluppo test-driven utilizzando le funzioni AWS serverless Lambda, React.js e i requisiti delle Progressive Web App.",
"meetCaseAboutClient": "Per la parte visiva, il frontend era responsivamente in stile con CSS e JSX regolari.",
"meetCaseConclusionData": "L'app Meet è stato uno degli ultimi progetti del corso di sviluppo web Full-Stack. Quando è stato finito, mi sono concentrato sul miglioramento delle mie capacità di sviluppo di React, in particolare immergendomi in un nuovo argomento: lo sviluppo di app native con React Native e Android Studio.",
"meetCaseDurationData": "Quasi 1 mese (28 giorni)",
"meetCaseChallenge1": "La sfida più grande per me in questo progetto è stato l'approccio di sviluppo test-driven stesso. Avendo scritto codice nello stile behavior-driven prima, ho dovuto passare un po ' di tempo ad abituarmi al nuovo metodo. Tuttavia, il lavoro sull'app è andato abbastanza bene e mi sono abituato rapidamente al nuovo argomento. Uno dei problemi durante il lavoro sul progetto era l'incapacità degli utenti di autenticarsi all'app. Dopo aver contattato il mio tutor, ho risolto il problema aggiungendo manualmente gli utenti di test tramite la Google Developer Console.",
"meetCaseChallenge2": "Dopo aver risolto il problema dell'installazione dell'app su uno smartphone, l'ho trasformata con successo in una Progressive Web App. Mi è piaciuto anche lavorare con le notifiche degli utenti e la libreria di ricariche. Ho anche migliorato le mie conoscenze e competenze sull'approccio TDD e la configurazione degli account per sviluppatori AWS e Google, oltre a confermare la proprietà del dominio.",
"meetMainTakeaway1": "Pratica l'approccio TDD sui progetti collaterali",
"meetMainTakeaway2": "Scopri di più sulla visualizzazione dei dati",


"owriteCaseHeading": "Caso di studio dell'app Owrite",
"owriteCaseIntroduction": "OWrite è un'applicazione di chat in tempo reale React Native, sviluppata utilizzando React Native, Expo CLI, linee guida per l'accessibilità e Android Studio per l'app stessa e Google Firebase e Firestore per il database. Fornisce agli utenti funzionalità di chat in tempo reale, tra cui la visualizzazione della cronologia dei messaggi grazie a AsyncStorage, l'invio di messaggi, foto, registrazioni audio e dati di geolocalizzazione. Gli utenti possono impostare il proprio nome utente e scegliere il colore di sfondo dell'app.",
"owriteCaseRequired": "OWrite era un progetto richiesto che ho sviluppato come parte del mio corso full-stack immersion a CareerFoundry per dimostrare la mia padronanza dello sviluppo di app native utilizzando React Native, Expo CLI, Android Studio e Google Firebase/Firestore.",
"owriteCaseAim": "Il progetto mirava a sviluppare un'app nativa pienamente funzionante che potessi aggiungere al mio portfolio professionale. Il problema che volevo risolvere era quello di costruire l'applicazione nativa completa collegando il database di Google Firebase/Firestore all'interfaccia dell'app progettata con React Native.",
"owriteCaseAboutDatabase": "Ho sviluppato il database utilizzando Google Firebase per memorizzare due utenti necessari per il test. Più tardi, ho impiegato Google Firestore per contenere i dati della chat degli utenti.",
"owriteCaseAboutInterface": "Per l'interfaccia, Android Studio e Expo Go Android App sono stati incorporati per scopi di test. React Native è stato utilizzato per progettare due schermate di app: una schermata di benvenuto e una schermata di chat. La schermata di benvenuto è stata progettata con elementi accessibili secondo le raccomandazioni di React Native, consente di impostare un nome utente e scegliere un colore di sfondo per la schermata della chat. La schermata chat visualizza il nome dell'utente, la cronologia dei messaggi, un campo di testo e un menu con opzioni di file aggiuntive. Per sviluppare le funzionalità richieste, ho incorporato librerie come Gifted Chat, Expo Media, Expo Image Picker, Stack Navigation e altre. Per consentire un utilizzo offline, è stato utilizzato AsyncStorage.",
"owriteCaseAboutServer": "La creazione della logica del server è iniziata con la creazione di un account su Google Firebase e la configurazione. Ho proceduto quindi ad aggiungere le impostazioni di configurazione di Google Firebase alla base di codice.",
"owriteCaseConclusionData": "L'app OWrite è stato il penultimo progetto a cui ho lavorato nel corso di sviluppo web Full-Stack. Quando è stato finito, mi sono concentrato sull'ulteriore miglioramento delle mie capacità di sviluppo, in particolare aggiungendo un altro framework front-end e un sistema di progettazione al mio skillset, Angular e Material UI rispettivamente. Il progetto successivo ha richiesto di ricreare il front-end per l'API R3play con Angular e Material UI questa volta.",
"owriteCaseDurationData": "1 settimana",
"owriteCaseChallenge1": "Le sfide che ho affrontato durante questo progetto erano più legate alla timeline del corso stesso che al lavoro effettivo sulla base di codice. Come accennato in precedenza, dal momento che ho dedicato uno sforzo extra per migliorare l'API e l'app R3play, ha lasciato meno tempo per la fine del corso di immersione. Di conseguenza, ho dovuto pianificare il mio programma per finire il progetto in tempo e concentrarmi solo sulle funzionalità richieste e consigliate.",
"owriteCaseChallenge2": "Mi è piaciuto particolarmente sviluppare l'app perché ho sempre voluto immergermi nello sviluppo di app native e React Native era nella mia lista di controllo. Inoltre, è stato piacevole sapere che le competenze acquisite in precedenza (gestione del tempo e definizione delle priorità) mi hanno aiutato a completare il progetto molto rapidamente e ad aggiungere nuove competenze di sviluppo nativo alla mia cassetta degli attrezzi.",
"owriteMainTakeaway1": "Pratica la creazione di applicazioni in tempo reale su progetti collaterali",
"owriteMainTakeaway2": "Scopri di più sullo sviluppo di app native",


"pokedexLink": "API Pokedex",
"pokemonCaseHeading": "Caso di studio dell'app Pokemon",
"pokemonCaseIntroduction": "Pokemon App è un'applicazione web, sviluppata utilizzando HTML, CSS, Javascript e Bootstrap. Esso fornisce agli utenti informazioni su Pokemon recuperato dal Pokedex API. Gli utenti possono accedere alle informazioni su ID Pokemon, altezza e peso, vedere l'immagine anteriore e posteriore di un Pokemon e cercare un Pokemon per nome.",
"pokemonCaseRequired": "Pokemon App era un progetto richiesto che ho sviluppato come parte del mio corso full-stack immersion a CareerFoundry per dimostrare la mia padronanza dello sviluppo web utilizzando JavaScript e Bootstrap.",
"pokemonCaseAim": "Il progetto mirava a sviluppare un'app pienamente funzionante che potessi aggiungere al mio portfolio professionale. Il problema che volevo risolvere era quello di costruire e modellare un'applicazione web utilizzando un'API esterna e un popolare framework CSS.",
"pokemonCaseAboutApi": "Ho usato l'API Pokedex come parte delle dipendenze richieste dal progetto per fornire all'app varie informazioni su Pokemon. A questo scopo, le promesse Javascript sono state utilizzate per gestire richieste asincrone e risposte a/dall'API Pokedex.",
"pokemonCaseAboutClient": "Dopo aver terminato la parte logica dell'app, ho iniziato la fase di stilizzazione incorporando Bootstrap come framework CSS richiesto dal progetto. Il compito era quello di utilizzare la griglia, le classi e i componenti di Bootstrap per implementare le funzionalità e la reattività richieste. Infine, ho testato l'app su vari schermi, dispositivi e sistemi operativi utilizzando gli emulatori di dispositivo/sistema.",
"pokemonCaseConclusionData": "L'app Pokemon è stato il primo progetto di corso Full-Stack Immersion. Quando è stato finito, mi sono concentrato sul miglioramento delle mie capacità di sviluppo, in particolare immergendomi in Node.js, espresso e API. Progettare la mia API è stato un passo utile e importante per padroneggiare ulteriormente le cruciali capacità di sviluppo web di back-end.",
"pokemonCaseDurationData":"4 settimane",
"pokemonCaseChallenge1": "La parte che richiedeva l'uso di Javascript asincrono era la più dispendiosa in termini di tempo, mentre il lavoro sullo styling era relativamente facile. Nel complesso, mi ci sono voluti 1 mese per completare il progetto che era intorno al tempo medio trascorso. In primo luogo, ho avuto difficoltà a visualizzare le informazioni specifiche Pokemon come descritto nella documentazione Pokedex. Inoltre, ho dovuto risolvere il problema quando i dati non venivano visualizzati sul front-end.",
"pokemonCaseChallenge2": "Tuttavia, questo è stato un progetto divertente e relativamente facile da lavorare. Mi sono divertito a immergermi nelle basi di Javascript imparando AJAX. È stato anche motivante imparare lo stile con l'aiuto di Bootstrap. Ho anche rapidamente acquisito competenze utili nel lavorare con le promesse e le API Javascript, leggendo la documentazione, disegnando con i framework CSS e risolvendo i problemi. Per fortuna, il mio mentore e tutor mi ha assistito durante il progetto e sono stato in grado di applicare le competenze acquisite in seguito quando implementavo funzionalità aggiuntive all'app.",
"pokemonMainTakeaway1": "Migliora le abilità di debug praticando e utilizzando risorse educative esterne.",
"pokemonMainTakeaway2": "Rimani motivato anche quando si verificano difficoltà educative temporanee.",
"pokemonMainTakeaway3": "Migliora l'auto-cura digitale per quanto riguarda il tempo di riposo",




"toDoCaseHeading":"Per fare caso di studio App",
"toDoCaseIntroduction": "To-Do-List App è un'applicazione web reattiva, sviluppata utilizzando HTML, Bootstrap e Javascript e fornisce agli utenti la possibilità di gestire le loro cose da fare. Gli utenti possono aggiungere ed eliminare le loro cose da fare tra le altre caratteristiche.",
"toDoCaseRequired": "To-Do-List App era un mini-progetto laterale richiesto che ho sviluppato come parte del mio corso full-stack immersion a CareerFoundry per dimostrare la mia padronanza di lavorare con jQuery.",
"toDoCaseAim": "Il progetto mirava a progettare una web app pienamente funzionante che potessi aggiungere al mio portfolio professionale. Il problema che volevo risolvere era quello di trasformare il semplice Javascript in jQuery.",
"toDoCaseAboutClient": "Dopo aver ricevuto il codice Javascript normale iniziale con funzionalità di base dell'app, ho iniziato a trasformarlo in uno jQuery. Questo tipo di lavoro mi ha permesso di introdurre funzionalità e stili aggiuntivi.",
"toDoCaseConclusionData": "L'app To-Do-List era solo un mini-progetto laterale che ho fatto nel corso full-stack immersion ma mi sono divertito ad aggiungere nuove funzionalità e styling sopra i requisiti di base. Ha rapidamente migliorato le mie abilità in jQuery, Bootstrap, debug e lavoro con librerie aggiuntive.",
"toDoCaseDurationData": "1 giorno per le funzionalità richieste e circa 3 settimane per le funzionalità aggiuntive",
"toDoCaseChallenge1": "Lo sviluppo delle funzionalità di base dell'app non ha creato alcuna difficoltà e ho terminato l'attività entro 1 giorno. Tuttavia, non ero soddisfatto della funzionalità che aveva e ho deciso di trovare più tempo per aggiungere miglioramenti. Queste aggiunte hanno causato un sacco di debug perché diverse librerie jQuery non funzionavano bene insieme e come previsto. Per fortuna, il mio mentore e tutor mi ha aiutato a risolvere il lavoro. Prima di introdurre funzioni extra, l'app potrebbe:",
"toDoCaseChallenge2": "Con le nuove funzionalità, consente di:",
"toDoMainTakeaway1": "Migliora le abilità Bootstrap",
"toDoMainTakeaway2": "Lavora sulle abilità di debug",
"toDoMainTakeaway3": "Estendere le funzionalità dell'app in seguito",
"toDoBeforeFeature1": "Aggiungi / elimina cose da fare",
"toDoBeforeFeature2": "Riorganizzare le cose da fare sul desktop",
"toDoBeforeFeature3": "Cross-out to-dos",
"toDoBeforeFeature4": "Mostra le notifiche di avviso del browser integrate",
"toDoAfterFeature1": "Aggiungi / elimina liste di cose da fare",
"toDoAfterFeature2": "Aggiungi / elimina le cose da fare da / verso gli elenchi di cose da fare (incluso premere \"Enter\" sulla tastiera)",
"toDoAfterFeature3": "Cancella il campo di input",
"toDoAfterFeature4": "Riorganizzare e cross-out to-dos sul cellulare con l'aiuto di jQuery Mobile e jQuery Touch Punch",
"toDoAfterFeature5": "Mostra notifiche più belle con l'aiuto di Bootstrap e jQuery UI",
"toDoAfterFeature6": "Visualizza una guida su come utilizzare l'app su diverse piattaforme con l'aiuto di Bootstrap",


"notFound": "Non siamo riusciti a trovare la risorsa che stavi cercando.",
"returnHomeParagraph": "Ma puoi sempre tornare alla ",
"returnHomeLink": "Pagina principale",


"copySkill": "Lucidatura della copia",
"terminalSkill": "Lavorare nel terminale",
"accessibilitySkill":"Accessibilità",
"externalApiSkill": "API esterna",
"nativeSkill":"Sviluppo di app native",
"troubleshootingSkill":"Risoluzione dei problemi",
"TDDSkill":"Sviluppo guidato da test",
"kanbanSkill":"Scheda Kanban",
"agileSkill": "Flusso di lavoro agile",
"documentationSkill":"Documentazione",
"userStoriesSkill":"Storie utente",
"collabSkill":"Collaborazione",
"feedbackSkill": "Fornire feedback",
"contributeSkill":"Contribuire",
"testingSkill": "Test",
"apiSkill": "Google Calendar API",
"pwsSkill": "Applicazioni Web progressive",
"responsiveSkill":"Responsive design",
"deploySkill": "Distribuzione di un sito web",
"caseLead": "Ruolo: Sviluppatore principale",
"caseTutor": "Tonny Ntambaazi:",
"caseTutor2":"Direttore creativo",
"caseMentor": "Nizar Triki:",
"caseMentor2":"Software Engineering Manager",
"r3playMainTakeaway1": "Concentrati prima sulla funzionalità richiesta",
"r3playMainTakeaway2": "Migliorare le capacità di gestione del tempo",
"r3playMainTakeaway3": "Approfondire la conoscenza delle tecnologie utilizzate leggendo e praticando di più",
"r3playMainTakeaway4": "Non dubitare di chiedere aiuto in caso di problemi tecnici",
"r3playCaseChallenge1": "Lo sviluppo del lato back-end è stato il più dispendioso in termini di tempo, mentre il lavoro sul lato client è stato il più impegnativo tecnicamente. Di conseguenza, mi ci è voluto più tempo per completare lo stack completo rispetto alla solita durata di due risultati di CareerFoundry. La ragione di ciò era che mi sono concentrato sui miglioramenti funzionali e visivi di entrambi i risultati al di sopra dei requisiti di base e avevo bisogno di più tempo per risolvere il rendering condizionale degli elementi JSX, come implementare Redux in React e la logica condizionale dietro il rendering dei suggerimenti di film per l'utente.",
"r3playCaseChallenge2": "Tuttavia, questo era il mio progetto preferito. Mi è piaciuto sviluppare l'interfaccia utente e lavorare con le informazioni del database. Ho anche migliorato rapidamente le mie capacità di terminale, la comprensione dell'interrogazione del database MongoDB NoSQL, il rendering condizionale, il filtraggio dei dati, la personalizzazione dei componenti di React Bootstrap, nonché le capacità di gestione del tempo e di prioritizzazione. Per fortuna, il mio esperto tutor e mentore mi ha assistito durante il progetto e sono stato in grado di applicare le competenze acquisite in seguito quando implementavo funzionalità aggiuntive all'app.",




"r3playSlide1Heading":"Vista accesso",
"r3playSlide2Heading":"Visualizzazione filmato",
"r3playSlide3Heading":"Vista profilo",
"r3playSlide1Description": "La vista di accesso all'app R3play in cui gli utenti possono accedere all'app",
"r3playSlide2Description": "La visualizzazione filmato dell'app R3play che visualizza un elenco di filmati disponibili nell'app",
"r3playSlide3Description": "La visualizzazione del profilo dell'app R3play in cui gli utenti possono modificare le informazioni del proprio account",  
   

"myFlixSlide1Heading":"Vista accesso",
"myFlixSlide2Heading":"Visualizzazione filmato",
"myFlixSlide3Heading": "Vista profilo",
"myFlixSlide1Description": "La vista di accesso all'app MyFlix in cui gli utenti possono accedere all'app",
"myFlixSlide2Description": "La visualizzazione dei filmati dell'app MyFlix che visualizza un elenco di filmati disponibili nell'app",
"myFlixSlide3Description": "La visualizzazione del profilo dell'app MyFlix in cui gli utenti possono modificare le informazioni del proprio account",


"meetSlide1Heading": "Interfaccia generale",
"meetSlide2Heading": "Errori e avvisi",
"meetSlide3Heading":"Dettagli evento",
"meetSlide1Description": "Gli eventi dell'app Meet caricati nell'app con i campi del modulo che consentono di regolare i risultati",
"meetSlide2Description": "La schermata degli eventi dell'app Meet è stata dimostrata con avvisi ed errori dovuti ai dati errati inseriti",
"meetSlide3Description": "La schermata eventi dell'app Meet con una scheda eventi espansa",


"owriteSlide1Heading": "Schermata di benvenuto",
"owriteSlide2Heading": "Schermata chat",
"owriteSlide1Description": "La schermata di benvenuto dell'app Owrite in cui gli utenti possono scegliere un tema ed entrare nella chat room",
"owriteSlide2Description": "La schermata di chat dell'app Owrite in cui gli utenti possono chattare, incluso l'invio di file audio e immagini",


"pokemonSlide1Heading": "Messaggio di benvenuto",
"pokemonSlide2Heading": "Risultati Pokemon",
"pokemonSlide3Heading": "Carta Pokemon",
"pokemonSlide1Description": "La pagina principale dell'app Pokemon con un messaggio di benvenuto",
"pokemonSlide2Description": "L'App Pokemon filtrata Pokemon risultati visualizzati come un elenco",
"pokemonSlide3Description": "La carta Pokemon con i dati che l'utente può vedere cliccando su un nome Pokemon",


"toDoSlide1Heading": "Vista iniziale",
"toDoSlide2Heading": "Nuovo elenco",
"toDoSlide3Heading":"Notifica",
"toDoSlide1Description": "La vista iniziale dell'app da fare in cui gli utenti visualizzano suggerimenti su come utilizzare l'app e aggiungere un primo elenco",
"toDoSlide2Description":"È stato aggiunto un nuovo elenco di cose da fare",
"toDoSlide3Description": "Quando l'utente lascia vuoto l'input fieled e tenta di aggiungere una nuova attività, viene visualizzato un messaggio di notifica",


"cookieInfo1":"Questa applicazione utilizza i cookie e raccoglie i dati dei visitatori. Leggi di più sulle ",
"cookieInfo2" : " e ",
"cookieInfo3": "", 
"cookieLink1": "politiche sui cookie",
"cookieLink2": "sulla privacy",
"cookieConfirm":"Io sono d'accordo",


"menu": {
  "aboutMenu":"Su",
  "projectsMenu":"Progetti",
  "portfolioMenu": "Portfolio App",
  "casesMenu":"Casi",
  "testimonialsMenu":"Testimonianze",
  "contactMenu":"Contatto",
  "resumeMenu":"Resume",
  "r3playMenu": "R3play App",
  "myFlixMenu": "MyFlix App",
  "meetMenu": "Meet App",
  "owriteMenu": "Owrite App",
  "pokemonMenu": "Pokemon App",
  "toDoMenu": "To Do App",
  "policiesMenu":"Politica",
  "cookie": "Cookie",
"privacy": "Privacy"
  },
  "footer":{
  "copy": "© Yevhenii Airapetian, 2024. Tutti i diritti riservati.",
  "impressumFooter":"Impronta",
  "toggleTitle": "Fai clic per attivare o disattivare la barra laterale"
  },


  "notFoundImageAlt": "Un'immagine che mostra una vecchia TV",
"caseHeroAlt": "Un'immagine che mostra uno screenshot dal caso del progetto",
"caseSliderAlt": "Un'immagine che mostra uno screenshot da una delle viste dell'applicazione",
"logoAlt": "Un'immagine che mostra il logo dell'applicazione",
"contactImageAlt": "Un'immagine che mostra utensili da scrittura e una persona che scrive",
"testimonialsSliderImageAlt": "Un'immagine che mostra un recensore",
"testimonialsImageAlt": "Un'immagine che mostra un team di lavoro",
"projectsSliderImageAlt": "Un'immagine che mostra uno screenshot realizzato da un'app distribuita",
"projectsImageAlt": "Un'immagine che mostra un posto di lavoro con un computer portatile e accessori",
  "aboutCvDeAlt": "Un'icona che mostra la bandiera tedesca",
"aboutCvEnAlt": "Un'icona che mostra la bandiera americana",
"aboutCvUkAlt": "Un'icona che mostra la bandiera ucraina",
"aboutCvDeTitle": "Clicca qui per scaricare il mio curriculum in tedesco. Potrebbe essere necessario utilizzare un visualizzatore di file come Adobe Acrobat o simili",
"aboutCvEnTitle": "Clicca qui per scaricare il mio curriculum in inglese. Potrebbe essere necessario utilizzare un visualizzatore di file come Adobe Acrobat o simili",
"aboutCvUkTitle": "Clicca qui per scaricare il mio curriculum in ucraino. Potrebbe essere necessario utilizzare un visualizzatore di file come Adobe Acrobat o simili",
"toggleResumeTitle":"Attiva / disattiva file riprendi",
"checkOutCodeTitle": "Controlla il codice su Github",
"profileImageAlt": "Un'immagine che mostra un uomo in giacca"
  }