{
    "notificationCloseTitle":"Cerrar",
    "whatsNewInfo":"Qué hay nuevo: la aplicación se movió a React.js, ahora está localizado y tiene un alternador de temas.Leer más ",
    "whatsNewLink":"aquí",
    "darkModalMessage": "Bienvenido al lado oscuro",
    "lightModalMessage": "Bienvenido al lado de la luz",
"modalConfirm": "¡Vamos!",
"modalHint": "Haz clic para cerrar el modal",
    "app_title": "Yevhenii Airapetian - Portafolio",
    "languages": "lenguas",
    "themeSwitcherLightHint": "Haga clic aquí para cambiar al tema de la luz",
    "themeSwitcherDarkHint": "Haga clic aquí para cambiar al tema oscuro",
    "welcome text": "Hola, soy Yevhenii",
    "resume": "Currículum",
    "introduction": "Soy un desarrollador web apasionado por la tecnología",
    "experience": "Tengo experiencia en la enseñanza de lenguas extranjeras y en redacción académica, y me entusiasma trabajar en desarrollo web.",
    "first focus": "Siempre me he centrado en ofrecer un trabajo de alta calidad que cumpliera los plazos, empleando mis refinadas habilidades de resolución de problemas, gestión del tiempo y pensamiento lógico.",
    "second focus": "Mi objetivo es combinar mi experiencia con mis aspiraciones profesionales para ayudar a crear soluciones de software funcionales, receptivas y accesibles.",
    "availability": "Estoy disponible para trabajo de oficina e híbrido en la zona de Berlín y Potsdam o a distancia.",
    "hobbies": "Además de mis pasiones en el desarrollo web, también soy un fotógrafo aficionado activo y un entusiasta del fitness, y en cualquier otro día puedes encontrarme fuera haciendo fotos o levantando pesas.",
    "code": "Código",
    "projects": "Proyectos",
    "projectsInfo": "Aquí encontrarás los proyectos actuales de desarrollo web que he completado y en los que he trabajado. Todos ellos tienen hipervínculos a la base de código y los casos del proyecto, la mayoría tienen un enlace a la versión desplegada, y algunos también tienen enlaces adicionales.",
    "projectsViewTip": "Usa los controles deslizantes para hacer clic en la lista de proyectos. Desplácese sobre una diapositiva específica para acceder a los enlaces del proyecto. Toque una diapositiva específica para ver más información (en dispositivos móviles)",    
    "r3playInfo": "La interfaz de la API web de R3play que permite a los usuarios registrarse y darse de baja, ver información sobre películas, series de televisión y anime, y gestionar su lista de favoritos.",
    "r3playAPIInfo": "API web desarrollada con Node.js, Express y MongoDB que permite a los usuarios registrarse, darse de baja, ver información sobre películas, programas de televisión y animes, y gestionar favoritos.",
    "myFlixInfo": "Una parte front-end para la API web de R3play diseñada con Angular, Typescript y Material UI que permite a los usuarios registrarse, ver información sobre películas y añadir favoritos.",
    "meetInfo": "Una Progressive Web App escrita con AWS Lambda Functions que utiliza autorización y autenticación OAuth2 y muestra eventos de la API de Google Calendar de CareerFoundry.",
    "owriteInfo": "Una aplicación React Native que permite a los usuarios chatear. Los usuarios pueden establecer un nombre de usuario, elegir el color de fondo del chat y enviar mensajes de texto, imágenes y grabaciones de audio.",
    "pokemonInfo": "Una app Pokemon responsive que recupera Pokemon con Ajax desde una API Pokedex externa y muestra su información como tamaño, peso, ID, imágenes frontales y traseras",
    "toDoInfo": "Una aplicación de tareas pendientes jQuery y Bootstrap que permite a los usuarios gestionar las tareas pendientes. Los usuarios pueden añadir, eliminar y reordenar tareas, crear y eliminar listas de tareas pendientes y ver instrucciones de uso de la app.",
    "portfolioInfo":"Una aplicación web responsiva desarrollada con React, React Bootstrap y consideraciones de accesibilidad, que permite a los usuarios ver información sobre mis proyectos, etc.",
    
    
    
    "r3playInfoTitle": "Haga clic para leer más sobre la API de R3play",
"r3playInfoTitleAPIDeployed": "Haz clic para abrir la API de R3play",
"r3playInfoTitleGithub": "Haz clic para abrir el repositorio Github de la API de R3play",
"myFlixInfoTitle": "Haga clic para leer más sobre la aplicación MyFlix",
"myFlixInfoTitleGithub": "Haga clic para abrir el repositorio Github de la aplicación MyFlix",
"myFlixInfoTitleKanban": "Haga clic para abrir el tablero Kanban del proyecto de la aplicación myFlix",
"meetInfoTitle": "Haga clic para leer más sobre la aplicación Meet",
"meetInfoTitleDeployed": "Haz clic para abrir la aplicación Meet",
"meetInfoTitleGithub": "Haz clic para abrir el repositorio Github de Meet App",
"owriteInfoTitle": "Haga clic para leer más sobre la aplicación Owrite",
"owriteInfoTitleGithub": "Haz clic para abrir el repositorio Github de la aplicación Owrite",
"pokemonInfoTitle": "Haz clic para leer más sobre la aplicación Pokemon",
"pokemonInfoTitleDeployed": "Haz clic para abrir la aplicación Pokemon",
"pokemonInfoTitleGithub": "Haz clic para abrir el repositorio Github de la aplicación Pokemon",
"toDoInfoTitle": "Haz clic para leer más sobre la aplicación ToDoList",
"toDoInfoTitleDeployed": "Haz clic para abrir la aplicación ToDoList",
"toDoInfoTitleGithub": "Haz clic para abrir el repositorio Github de la aplicación ToDoList",
"portfolioInfoTitle": "Haga clic para leer más sobre la aplicación Portfolio",
"portfolioInfoTitleDeployed": "Haga clic para abrir la aplicación Portfolio",
"portfolioInfoTitleGithub": "Haga clic para abrir el repositorio Github de la aplicación Portfolio",
"testimonialSliderMore":"Haga clic para ver el texto completo del testimonio",
  
    
    "projectsSliderMore": "más",
    "testimonials": "La gente dice",
    "wordOfMouth": "No estaría donde estoy hoy sin toda la gente maravillosa con la que he tenido el privilegio de trabajar",
    "testimonialsViewTip": "Usa los controles deslizantes para hacer clic en la lista de testimonios. Desplácese sobre los encabezados de los testimonios para leer más. Toque un testimonio específico para ver información adicional (en el móvil)",    "testimonial1": "Maya Septriana, Consultora de Carrera, CareerFoundry",
    "testimonial2": "Nizar Triki, Gerente de Ingeniería de Software chez Expensya",
    "testimonial3": "Dejan Gogov, Desarrollador Web, Wild Code School",
    "testimonial1Text": "Yevhenii es alguien con quien es muy fácil colaborar. Siempre se esfuerza por alcanzar la excelencia. Cada vez que le doy mi opinión, está dispuesto a escuchar y ajustar la presentación...",
    "testimonial2Text": "Tuve la oportunidad de ser mentor de Yevhenii a lo largo de su formación en desarrollo web en CareerFoundry. La autosuficiencia de Yevhenii, la rápida comprensión de los conceptos...",
    "testimonial3Text": "Durante nuestro bootcamp Fullstack de 6 meses, Yevhenii mostró constantemente un comportamiento positivo y amistoso. Abordaba las tareas con determinación...",
    "testimonialsMore": "más",
    "contact": "Contacto",
    "suggestion": "¿Quieres trabajar juntos o tienes una sugerencia? Estoy abierto a oportunidades de reclutamiento y comentarios",
    "eMailMe": "Siéntase libre de enviarme un correo electrónico utilizando el siguiente formulario",
    "contactFormHeader": "Contacto",
    "firstName": "Nombre",
    "firstNamePlaceholder": "Joey",
    "lastName": "Apellido",
    "lastNamePlaceholder": "Tribbiani",
    "phoneNumber": "Número de teléfono",
    "phoneNumberPlaceholder": "+49 1234 5678910",
    "eMail": "Correo electrónico",
    "eMailPlaceholder": "example@mail.com",
    "messageOrComment": "Mensaje o comentario. ¡Por favor, sé amable!",
    "messageOrCommentPlaceholder": "Tu mensaje",
    "contactFormTip": "Los campos marcados con un asterisco son obligatorios",
    "contactFormPoweredBy": "Desarrollado por",
    "caseWorkflow":"Flujo de trabajo",
    "caseUpgrade":"Actualización",
    "caseDatabase": "Base de datos",
    "caseApi": "API",
    "caseInterface":"Interfaz de la aplicación",
    "caseTDD":"Desarrollo impulsado por pruebas",
    "caseServerAndApi":"Lado del servidor y API",
    "caseAgile":"Flujo de trabajo ágil",
    "caseOverview": "Visión general",
    "casePurpose": "Propósito y contexto",
    "caseObjective": "Objetivo",
    "caseServer": "Lado del servidor",
    "caseClient": "Lado del cliente",
    "caseApproach": "Enfoque",
    "caseDuration": "Duración",
    "caseRetrospective": "Retrospectiva",
    "caseChallenges": "Desafíos.",
    "caseConclusion": " Conclusión y conclusiones clave",
    "caseMainTakeaways": "Principales conclusiones para futuros proyectos",
    "apiPreview": "Vista previa de la API",
    "appPreview": "Vista previa de la aplicación",
    "caseTechnologies": "Tecnologías utilizadas/Competencias",
    "caseCredits": "Créditos",
    "r3playCaseHeading":"Estudio de caso de la aplicación R3play",
    "r3playCaseIntroduction":"R3play es una aplicación web, desarrollada utilizando la pila MERN, que proporciona a los usuarios información sobre películas, series de televisión y anime. Los usuarios pueden acceder a información sobre películas, directores y géneros. Los usuarios pueden crear una cuenta, actualizar su información y crear una lista de sus películas favoritas, series de televisión y anime.",
    "r3playCaseRequired":"R3play fue un proyecto requerido que desarrollé como parte de mi curso de inmersión de pila completa en CareerFoundry para demostrar mi dominio del desarrollo web de pila completa usando JavaScript.",
    "r3playCaseAim": "El objetivo del proyecto era desarrollar una aplicación de pila completa que pudiera añadir a mi cartera profesional. El problema que quería resolver era construir la aplicación web completa de pila completa conectando el lado del servidor previamente diseñado y el lado del cliente para la aplicación desde cero.",
    "r3playCaseAboutServer": "Desarrollé una API RESTful usando Node.js y Express, que interactúa con una base de datos no relacional (MongoDB). La API emplea métodos HTTP comunes como GET, PUT, POST y DELETE. Para recuperar y almacenar datos en la base de datos, se utilizan métodos CRUD. La API proporciona películas, series de televisión e información de anime en formato JSON.",
    "caseViewEndpoints": "Ver puntos finales",
    "r3playCasePostman": "Utilicé Postman para probar respuestas y solicitudes a la API. También hice uso de la autenticación HTTP básica y la autenticación JWT para proporcionar las características de autenticación y autorización.",
    "r3playCaseAboutClient": "Después de completar el proyecto de API, procedí a construir la interfaz front-end que los usuarios necesitarían al interactuar con la lógica y los datos de la API y la base de datos. Es una aplicación web de una sola página, sensible, desarrollada con React y React-Redux. Muestra varias vistas de la interfaz, incluyendo (pero no limitado a) una vista principal (muestra una lista de todas las películas, series de televisión y anime), una sola película, series de televisión y vistas de anime (muestra datos sobre una sola película, serie de televisión y anime, y permite a los usuarios agregarlos o eliminarlos de su lista de favoritos), una vista de inicio de sesión, una vista de registro y una vista de perfil (donde los usuarios pueden actualizar sus datos de usuario y la lista de favoritos).",
    "caseSliderTip": "Usa los controles deslizantes para hacer clic en la lista de proyectos. Desplácese sobre los encabezados de las diapositivas para leer más. Toque una diapositiva específica para ver información adicional (en dispositivos móviles)",    "r3playCaseDurationData": "12 semanas en total (backend: 7 semanas, frontend: 5 semanas)",
    "r3playCaseConclusionData": "La aplicación de películas fue solo la segunda aplicación web completa que desarrollé en el curso de desarrollo web Full-Stack. Cuando se terminó, me enfoqué en mejorar mis habilidades de desarrollo, específicamente el enfoque de desarrollo basado en pruebas. Requiere implementar la fase de prueba antes de agregar la lógica funcional real, permitiendo un desarrollo más seguro, libre de errores y más rápido.",
    


    "portfolioCaseHeading":"Estudio de caso de la aplicación Portfolio",
"portfolioCaseIntroduction": "Portfolio App es una aplicación web receptiva, desarrollada con React y React Bootstrap, que brinda a los usuarios información sobre mis proyectos actuales, testimonios, información de contacto y plataformas sociales, y está localizada en varios idiomas extranjeros. Los usuarios pueden acceder a la información en vistas separadas, traducir la aplicación a su idioma preferido y cambiar el estilo a un tema claro u oscuro. ",
"portfolioCaseRequired": "Portfolio App fue un proyecto obligatorio que desarrollé como parte de mi \"Curso de Introducción al desarrollo web\" en CareerFoundry para demostrar mi dominio de HTML, CSS y la implementación de sitios web. Además, dominé prácticas de desarrollo web tan extendidas como las pruebas de aplicaciones, la minimización de CSS, la accesibilidad, el soporte de navegadores antiguos y las animaciones CSS.",
"portfolioCaseAim": "El proyecto tenía como objetivo desarrollar e implementar un sitio web estático en pleno funcionamiento que pudiera usar como mi portafolio profesional. El problema que quería resolver era emplear las herramientas cubiertas en el \"Curso de Introducción al desarrollo web\" en CareerFoundry para construir e implementar una interfaz de trabajo que se usaría como mi portafolio profesional.",
"portfolioCaseAboutWorkflow": "En las primeras etapas del proceso de desarrollo, estructuré el contenido con HTML y luego diseñé las páginas con CSS simple. El Totalmente.el complemento js ayudó a estructurar y diseñar el sitio web de acuerdo con las pautas recomendadas de accesibilidad web. Estas pautas existen para ayudar a las personas con limitaciones físicas u otras a tener una mejor experiencia de usuario en Internet. Se han utilizado etiquetas especiales \"aria\" para estos fines, así como descripciones informativas y datos de texto alternativos. En las etapas finales del proyecto, probé el sitio web para verificar que funcionara correctamente en varios sistemas operativos y navegadores, incluido el uso de javascript alternativo para la compatibilidad con navegadores Internet Explorer más antiguos.",
"portfolioCaseAboutUpgrade1": "Después de completar mi Carrera de Fundición \"Programa de Desarrollo Web Completo\" y mientras estudiaba en el \"Curso de Preparación Laboral\" de CareerFoundry, decidí modificar la aplicación de varias maneras. Primero, el sitio web obtuvo nuevas páginas con los datos de los casos de los proyectos, donde describí en detalle cómo trabajé en cada proyecto mientras estudiaba en CareerFoundry. En segundo lugar, actualicé el estilo para que fuera más agradable visualmente, funcional y estético. Sin embargo, dado que los sitios web estáticos se vuelven cada vez más obsoletos en la actualidad, era hora de migrar mi Portafolio a una de las bibliotecas de Javascript ampliamente utilizadas por la comunidad de desarrolladores. Como, después de completar varios proyectos en el bootcamp con React.js, y siendo más experimentado con él, decidí usarlo como esqueleto de mi proyecto.",
"portfolioCaseAboutUpgrade2": "Inicialicé el trabajo con un comando create react app, luego moví y reescribí todos los archivos HTML y CSS en componentes de funciones separados, e instalé las dependencias necesarias del proyecto. Los proyectos, testimonios y casos obtuvieron sus controles deslizantes separados con ejemplos y recorridos en video. Más tarde, localicé la aplicación a varios idiomas extranjeros, introduje un tema oscuro y actualicé la aplicación para guardar las preferencias de idioma y tema del usuario. Y por fin, convertí mi Portafolio en una Aplicación Web Progresiva. Con esta función, los usuarios pueden instalar la aplicación en dispositivos de escritorio y móviles, imitando una experiencia de aplicación nativa como en las plataformas Android o Windows.",
"caseTotally": "Visita totalmente.repositorio Github js",
"portfolioCaseAboutClient": "Construí la interfaz front-end para brindar a los usuarios la posibilidad de interactuar con los datos relacionados con mi cartera profesional. Originalmente era un sitio web estático, desarrollado utilizando HTML simple, CSS y Totalmente.js, un complemento de Javascript para probar la accesibilidad. Tenía páginas HTML separadas para la información principal, proyectos, contactos y otra información.",
"portfolioCaseDurationData":" 2 semanas en total para el proyecto inicial. 3-6 meses en suma para el resultado actual",
"portfolioCaseConclusionData":"El sitio web de Portfolio fue el primer proyecto en el campamento de desarrollo web de Career Foundry. Cuando terminó, comencé el \"Curso de Inmersión de Pila Completa\" con el trabajo en la aplicación Pokémon.",
"portfolioCaseConclusionData2": "Fue una experiencia genial y gratificante diseñar y depurar la aplicación en su estado inicial hasta las últimas mejoras que tiene. También agregué nuevas habilidades y las desarrollé sobre las antiguas (incluso cuando trabajaba por mi cuenta), como pulir la copia, depurar la implementación de aplicaciones React, usar bibliotecas de localización, introducir y personalizar temas, trabajar con almacenamiento local, mejores prácticas de estilo y otros.",
"portfolioCaseChallenge":" El desarrollo del proyecto inicial fue relativamente fácil y sin errores ya que ya tenía experiencia en las tecnologías que se requerían para ello. De hecho, logré completarlo 1 semana antes de la fecha límite requerida y mostré mis presentaciones como ejemplo para otros estudiantes.",
"portfolioCaseChallenge2": "Sin embargo, a medida que pasé a tecnologías más complejas y más allá de los requisitos del proyecto por mi cuenta, me encontré con varios problemas. Un problema fue que no pude introducir completamente el tema oscuro en la aplicación. Cuando activé el tema oscuro, solo una parte de la aplicación cambió de estilo. Otro relacionado con las dificultades de implementación y la configuración de React requerida para ello. Afortunadamente, el conocimiento adquirido durante el campamento de entrenamiento me ayudó a resolver estos obstáculos y pude:",
"portfolioCaseChallengeDetail1": "Utilizar mis habilidades de investigación y resolución de problemas para solucionar los problemas relacionados con el tema oscuro",
"portfolioCaseChallengeDetail2": "Investigue y solucione los problemas relacionados con la implementación",
"portfolioMainTakeaway1": "La persistencia es una habilidad importante en el desarrollo web, así como la elección de comprometerse y establecer prioridades",
"portfolioMainTakeaway2":"A veces, un error puede ser causado inesperadamente y una solución necesita una mejor atención al detalle",
"portfolioMainTakeaway3": "Siempre hay margen de mejora en tus proyectos, por lo que es crucial entender el momento en el que seguir adelante y / o priorizar",
"portfolioMainTakeaway4": "El código (rápidamente) se vuelve obsoleto o necesita una actualización, por lo que es una buena idea revisar sus proyectos más antiguos de vez en cuando ",

"portfolioSlide1Heading": "Acerca de la vista (tema ligero)",
"portfolioSlide2Heading": "Acerca de la vista (Tema oscuro)",
"portfolioSlide3Heading": "Vista de Caso de Proyecto localizado",
"portfolioSlide1Description": "La vista Acerca de la aplicación Portfolio donde los usuarios pueden leer más sobre el autor, acceder a la base de código y reanudar (se muestra en tema claro)",
"portfolioSlide2Description": "La vista Acerca de la aplicación Portfolio donde los usuarios pueden leer más sobre el autor, acceder a la base de código y reanudar (que se muestra en el tema oscuro)",
"portfolioSlide3Description": "Una de las vistas de casos de los proyectos que está localizada (al idioma alemán en este ejemplo)",


    
    "myFlixCaseHeading":"Estudio de caso de la aplicación MyFlix",
    "myFlixCaseIntroduction":"MyFlix-Angular-App es una aplicación web, desarrollada utilizando la pila MEAN, que proporciona a los usuarios información sobre películas. Los usuarios pueden acceder a información sobre películas, directores y géneros. Los usuarios pueden crear una cuenta, actualizar su información y crear una lista de películas favoritas.",
    "myFlixCaseRequired":"MyFlix-Angular-App fue un proyecto requerido que desarrollé como parte de mi curso de inmersión de pila completa en CareerFoundry para demostrar mi dominio del desarrollo web de pila completa usando JavaScript. Además, practiqué gestión de proyectos ágil, suministro de retroalimentación y habilidades de generación de documentación.",
    "myFlixCaseAboutServer":"Desarrollé una API RESTful usando Node.js y Express que interactúa con una base de datos no relacional (MongoDB). La API emplea métodos HTTP comunes como GET, PUT, POST y DELETE. Para recuperar y almacenar datos en la base de datos, se utilizan métodos CRUD. La API proporciona películas, series de televisión e información de anime en formato JSON.",
    "myFlixCasePostman":"Utilicé Postman para probar respuestas y solicitudes a la API. También hice uso de la autenticación HTTP básica y la autenticación JWT para proporcionar las características de autenticación y autorización.",
    "myFlixCaseAgileData":"El trabajo en el proyecto comenzó con la creación de la junta de Kanban y llenarlo con los requisitos del proyecto y las historias de usuario. Cuando se completó una tarea de proyecto, se trasladó a la sección \"Hecho\". Además, generé documentación detallada con Typedoc según los requisitos del proyecto.",
   
    "myFlixCaseAim":"El objetivo del proyecto era desarrollar una aplicación de pila completa que pudiera añadir a mi cartera profesional. El problema que quería resolver era construir la aplicación web completa de pila completa conectando el lado del servidor previamente diseñado y el lado del cliente para la aplicación desde cero." ,
    "myFlixCaseConclusion":"La aplicación myFlix fue la última aplicación web completa que desarrollé en el curso de desarrollo web Full-Stack. Cuando se terminó, procedí a mejorar mi cartera.",
    "myFlixCaseAboutClient":"Construí la interfaz front-end para que los usuarios pudieran interactuar con la lógica y los datos de la API y la base de datos. Es una aplicación web de una sola página, sensible, desarrollada con interfaz de usuario angular y material. Muestra varias vistas de la interfaz, incluyendo una vista principal (muestra una lista de todas las películas, un botón para administrar favoritos y botones para ver información adicional de la película), una vista de inicio de sesión/registro y una vista de perfil (donde los usuarios pueden actualizar sus datos de usuario)." ,
    "myFlixCaseConclusionData":"La aplicación myFlix fue la última aplicación web completa que desarrollé en el curso de desarrollo web Full-Stack. Cuando se terminó, procedí a mejorar mi cartera.",
    "myFlixCaseConclusionData2":"Las dificultades que encontré ocurrieron al final del proyecto y se relacionaron más con las peculiaridades de Angular y Github. Un problema ocurrió cuando las páginas de Github se negaron a implementar la aplicación durante mucho tiempo. La otra ocurrió cuando los cambios locales en la base de código no se mostraron en la aplicación desplegada. Para solucionar este problema, me puse en contacto con mi mentor y tutor y, durante una sesión de programación de par, nos las arreglamos para solucionar los problemas.",
    "myFlixCaseConclusionData3":"También fue una experiencia útil en depuración y solución de problemas, usando comandos de terminal git, detalles de trabajo con Angular y sesiones de programación de pares. También agregué nuevas habilidades a mi arsenal, como Typescript, Angular, Material UI, comentario de código adecuado, colaboración y otros.",
    "myFlixCaseDurationData":"Casi 1,5 semanas (10 días)",
    "myFlixCaseChallenge":"El desarrollo de la aplicación myFlix tomó mucho menos tiempo y esfuerzo en comparación con la aplicación R3play React desde:",
    "myFlixCaseChallengeDetail1":"La API ya ha sido construida",
    "myFlixCaseChallengeDetail2":"La amplia práctica con React ayudó a progresar más rápido",
    "myFlixCaseChallengeDetail3":"No agregué muchas características adicionales y me atengo a los requisitos básicos del curso",
    "myFlixCaseChallengeDetail4":"El tiempo que quedaba en el programa ya era limitado",    
    "myFlixMainTakeaway1":"Mejorar la funcionalidad de la aplicación para reflejar las características de la aplicación R3play",
    "myFlixMainTakeaway2":"Investiga más sobre Typescript",
    "myFlixMainTakeaway3":"Leer más sobre Material UI",
    "myFlixMainTakeaway4":"Continuar explorando otras tecnologías y mejores prácticas en el desarrollo web",
    

    "meetCaseHeading": "Estudio de caso de Meet App",
    "meetCaseIntroduction": "Meet App es una aplicación Web progresiva receptiva, desarrollada utilizando el enfoque de desarrollo basado en pruebas utilizando las funciones Lambda sin servidor de AWS, la pantalla de autenticación y autorización de Google OAuth2 y la biblioteca Recharts para permitir a los usuarios ver los eventos de la API de Google Calendar. Los usuarios pueden autenticarse con Google, especificar la ciudad y el número de eventos para mostrar los eventos y leer más sobre ellos. La aplicación se puede instalar en escritorio / móvil gracias a las recomendaciones de la PWA, se usa tanto en línea como fuera de línea, y muestra notificaciones cuando se ingresan datos incorrectos y/o se pierde la conexión a Internet.",
    "meetCaseRequired": "Meet App fue un proyecto obligatorio que desarrollé como parte de mi curso de inmersión de pila completa en CareerFoundry para demostrar mi dominio de las habilidades de desarrollo web de pila completa impulsadas por pruebas utilizando JavaScript y tecnologías sin servidor.",
    "meetCaseAboutTDD": "Desarrollé la aplicación escribiendo primero las historias de usuario. Con la ayuda del enfoque de desarrollo basado en pruebas, incorporé la unidad, la integración, la aceptación del usuario y los métodos de prueba de extremo a extremo para escribir las pruebas requeridas antes de implementar el código.",
    "meetCaseAboutServerAndApi": "Desarrollé el lado del servidor utilizando las funciones Lambda sin servidor de AWS como requisito para el proyecto. El uso de serverless permite reducir el trabajo adicional para administrar un servidor y facilita la escalabilidad. Para los datos de eventos de la aplicación, se utilizó el Calendario de Google de CareerFoundry. La pantalla de autenticación de Google OAuth2 se configuró para autenticar y autorizar a los usuarios a la aplicación. En las etapas finales de desarrollo, hice uso del service worker de React para transformar la aplicación en una aplicación Web Progresiva. La librería Recharts permite la visualización de datos de eventos en forma de dos tipos de gráficos (Scatter y Pie).",
    "meetCaseAim": "El proyecto tenía como objetivo desarrollar una aplicación full-stack completamente funcional que pudiera agregar a mi cartera profesional. El problema que quería resolver era crear una aplicación web completa de pila completa empleando el enfoque de desarrollo basado en pruebas utilizando las funciones Lambda sin servidor de AWS, React.js, y los requisitos de la Aplicación Web Progresiva.",
    "meetCaseAboutClient":"Para la parte visual, la interfaz se diseñó de manera receptiva con CSS y JSX normales.",
    "meetCaseConclusionData":"La aplicación Meet fue uno de los últimos proyectos en el curso de desarrollo web Full-Stack. Cuando terminó, me concentré en mejorar mis habilidades de desarrollo de React, específicamente sumergiéndome en un nuevo tema: el desarrollo de aplicaciones nativas con React Native y Android Studio.",
    "meetCaseDurationData": "Casi 1 mes (28 días)",
    "meetCaseChallenge1": "El mayor desafío para mí en este proyecto fue el enfoque de desarrollo basado en pruebas en sí mismo. Habiendo escrito código en el estilo impulsado por el comportamiento antes, tuve que dedicar un tiempo a acostumbrarme al nuevo método. Sin embargo, el trabajo en la aplicación fue bastante bien y me acostumbré al nuevo tema rápidamente. Uno de los problemas mientras trabajaba en el proyecto fue la incapacidad de los usuarios para autenticarse en la aplicación. Después de comunicarme con mi tutor, resolví el problema agregando manualmente los usuarios de prueba a través de la consola de desarrolladores de Google.",
    "meetCaseChallenge2": "Después de solucionar problemas de instalación de la aplicación en un teléfono inteligente, la convertí con éxito en una Aplicación Web Progresiva. También disfruté trabajando con las notificaciones de usuario y la biblioteca Recharts. También mejoré mis conocimientos y habilidades del enfoque TDD y configuré las cuentas de desarrollador de AWS y Google, además de confirmar la propiedad del dominio.",    
    "meetMainTakeaway1": "Practique el enfoque TDD en proyectos paralelos",
    "meetMainTakeaway2": "Descubra más sobre la visualización de datos",

    "owriteCaseHeading":"Estudio de caso de la aplicación Owrite",
    "owriteCaseIntroduction": "OWrite es una aplicación de chat en tiempo real React Native, desarrollada utilizando React Native, Expo CLI, pautas de accesibilidad y Android Studio para la propia aplicación, y Google Firebase y Firestore para la base de datos. Proporciona a los usuarios funciones de chat en tiempo real, incluida la visualización del historial de mensajes gracias al almacenamiento asíncrono, el envío de mensajes, fotos, grabaciones de audio y datos de geolocalización. Los usuarios pueden establecer su nombre de usuario y elegir el color de fondo de la aplicación.",
    "owriteCaseRequired": "OWrite fue un proyecto obligatorio que desarrollé como parte de mi curso de inmersión de pila completa en CareerFoundry para demostrar mi dominio del desarrollo de aplicaciones nativas usando React Native, Expo CLI, Android Studio y Google Firebase / Firestore.",
    "owriteCaseAim": "El proyecto tenía como objetivo desarrollar una aplicación nativa en pleno funcionamiento que pudiera agregar a mi cartera profesional. El problema que quería resolver era crear la aplicación nativa completa conectando la base de datos Google Firebase/Firestore a la interfaz de la aplicación diseñada con React Native.",
    "owriteCaseAboutDatabase": "Desarrollé la base de datos usando Google Firebase para almacenar dos usuarios necesarios para las pruebas. Más tarde, empleé Google Firestore para contener los datos de chat de los usuarios.",
    "owriteCaseAboutInterface": "Para la interfaz, se incorporaron Android Studio y Expo Go Android App con fines de prueba. React Native se utilizó para diseñar dos pantallas de aplicaciones: una de bienvenida y una de chat. La pantalla de bienvenida fue diseñada con elementos accesibles según las recomendaciones de React Native, permite establecer un nombre de usuario y elegir un color de fondo para la pantalla de chat. La pantalla de chat muestra el nombre del usuario, el historial de mensajes, un campo de texto y un menú con opciones de archivo adicionales. Para desarrollar las funciones requeridas, incorporé bibliotecas como Gifted Chat, Expo Media, Selector de imágenes de Expo, Navegación de pila y otras. Para permitir un uso sin conexión, se utilizó AsyncStorage.",
    "owriteCaseAboutServer": "La creación de la lógica del servidor comenzó con la configuración de una cuenta en Google Firebase y su configuración. Luego procedí a agregar los ajustes de configuración de Google Firebase al código base.",
    "owriteCaseConclusionData": "La aplicación OWrite fue el penúltimo proyecto en el que trabajé en el curso de desarrollo web Full-Stack. Cuando estuvo terminado, me concentré en mejorar aún más mis habilidades de desarrollo, específicamente agregando otro marco front-end y sistema de diseño a mi conjunto de habilidades, Angular y Material UI, respectivamente. El siguiente proyecto requirió recrear el front-end para la API de R3play con Angular y Material UI esta vez.",
    "owriteCaseDurationData": "1 semana",
    "owriteCaseChallenge1": "Los desafíos a los que me enfrenté durante este proyecto estaban más relacionados con la línea de tiempo del curso en sí que con el trabajo real en la base del código. Como se mencionó anteriormente, dado que dediqué un esfuerzo adicional a mejorar la API y la aplicación R3play, dejó menos tiempo para el final del curso de Inmersión. Como resultado, tuve que planificar mi agenda para terminar el proyecto a tiempo y concentrarme solo en las características requeridas y recomendadas.",
    "owriteCaseChallenge2": "Disfruté particularmente desarrollando la aplicación porque siempre quise sumergirme en el desarrollo de aplicaciones nativas, y React Native estaba en mi lista de verificación. Además, fue agradable saber que las habilidades adquiridas anteriormente (gestión del tiempo y priorización) me ayudaron a completar el proyecto muy rápidamente y agregar nuevas habilidades de desarrollo nativas a mi caja de herramientas.",
    "owriteMainTakeaway1": "Practica la creación de aplicaciones en tiempo real en proyectos paralelos",
    "owriteMainTakeaway2": "Descubre más sobre el desarrollo de aplicaciones nativas",
    
    
    "pokedexLink":"API de Pokedex",
    "pokemonCaseHeading":"Estudio de caso de la aplicación Pokemon",
    "pokemonCaseIntroduction": "Pokemon App es una aplicación web, desarrollada con HTML, CSS, Javascript y Bootstrap. Proporciona a los usuarios información sobre Pokémon obtenida de la API de Pokedex. Los usuarios pueden acceder a información sobre la identificación, la altura y el peso de un Pokémon, ver la imagen frontal y posterior de un Pokémon y buscar un Pokémon por nombre.",
    "pokemonCaseRequired": "La aplicación Pokemon fue un proyecto obligatorio que desarrollé como parte de mi curso de inmersión de pila completa en CareerFoundry para demostrar mi dominio del desarrollo web usando JavaScript y Bootstrap.",
    "pokemonCaseAim": "El proyecto tenía como objetivo desarrollar una aplicación completamente funcional que pudiera agregar a mi cartera profesional. El problema que quería resolver era crear y diseñar una aplicación web empleando una API externa y un marco CSS popular.",
    "pokemonCaseAboutApi": "Utilicé la API de Pokedex como parte de las dependencias requeridas del proyecto para proporcionar a la aplicación información diversa sobre Pokémon. Para este propósito, se utilizaron promesas de Javascript para manejar solicitudes y respuestas asincrónicas hacia / desde la API de Pokedex.",
    "pokemonCaseAboutClient": "Después de terminar la parte lógica de la aplicación, comencé la fase de estilización incorporando Bootstrap como el marco CSS requerido del proyecto. La tarea consistía en utilizar la cuadrícula, las clases y los componentes de Bootstrap para implementar la funcionalidad y la capacidad de respuesta requeridas. Finalmente, probé la aplicación en varias pantallas, dispositivos y sistemas operativos usando los emuladores de dispositivo/sistema.",
    "pokemonCaseConclusionData":" La aplicación Pokemon fue el primer proyecto de curso de Inmersión de pila Completa. Cuando terminó, me concentré en mejorar mis habilidades de desarrollo, específicamente sumergiéndome en Node.js, Express y API. Diseñar mi propia API fue un paso útil e importante para dominar aún más las habilidades cruciales de desarrollo web de back-end.",
    "pokemonCaseDurationData":" 4 semanas",
    "pokemonCaseChallenge1": "La parte que requería usar Javascript asíncrono consumía más tiempo, mientras que el trabajo de diseño era relativamente fácil. En general, me llevó 1 mes completar el proyecto, que era aproximadamente el tiempo promedio empleado. Primero, tuve dificultades para mostrar la información específica de Pokémon como se describe en la documentación de Pokedex. Además, tuve que solucionar el problema cuando los datos no se mostraban en el front-end.",
    "pokemonCaseChallenge2": "Sin embargo, este fue un proyecto divertido y relativamente fácil de trabajar. He disfrutado sumergiéndome en los conceptos básicos de Javascript aprendiendo AJAX. También fue motivador aprender a estilizar con la ayuda de Bootstrap. También adquirí rápidamente habilidades útiles para trabajar con promesas y API de Javascript, leer documentación, diseñar con marcos CSS y solucionar problemas. Afortunadamente, mi mentor y tutor me ayudaron durante el proyecto y pude aplicar las habilidades adquiridas más adelante al implementar funciones adicionales en la aplicación.",
    "pokemonMainTakeaway1": "Mejora las habilidades de depuración practicando y utilizando recursos educativos externos.",
    "pokemonMainTakeaway2": "Mantente motivado incluso cuando ocurran dificultades educativas temporales.",
    "pokemonMainTakeaway3": "Mejorar el autocuidado digital con respecto al tiempo de descanso",
    
    
    
    
    "toDoCaseHeading":"Estudio de Caso de la Aplicación para Hacer",
    "toDoCaseIntroduction": "La aplicación To-Do-List es una aplicación web receptiva, desarrollada con HTML, Bootstrap y Javascript, que brinda a los usuarios la capacidad de administrar sus tareas pendientes. Los usuarios pueden agregar y eliminar sus tareas pendientes, entre otras funciones.",
    "toDoCaseRequired": "La aplicación To-Do-List fue un mini proyecto secundario obligatorio que desarrollé como parte de mi curso de inmersión de pila completa en CareerFoundry para demostrar mi dominio del trabajo con jQuery.",
    "toDoCaseAim": "El proyecto tenía como objetivo diseñar una aplicación web en pleno funcionamiento que pudiera agregar a mi cartera profesional. El problema que quería resolver era convertir Javascript simple en jQuery.",
    "toDoCaseAboutClient": "Después de recibir el código Javascript simple inicial con la funcionalidad básica de la aplicación, comencé a convertirlo en jQuery. Este tipo de trabajo me permitió introducir características y estilos adicionales.",
    "toDoCaseConclusionData":" La Aplicación de la Lista de tareas pendientes fue solo un mini proyecto secundario que hice en el curso de inmersión de pila completa, pero disfruté agregándole nuevas funciones y estilos por encima de los requisitos básicos. Rápidamente mejoró mis habilidades en jQuery, Bootstrap, depuración y trabajo con bibliotecas adicionales.",
    "toDoCaseDurationData": "1 día para la funcionalidad requerida y alrededor de 3 semanas para funciones adicionales",
    "toDoCaseChallenge1": "El desarrollo de las funciones básicas de la aplicación no creó ninguna dificultad y terminé la tarea en 1 día. Sin embargo, no estaba satisfecho con la funcionalidad que tenía y decidí buscar tiempo extra para agregar mejoras. Estas adiciones causaron mucha depuración porque las diferentes bibliotecas jQuery no funcionaban bien juntas y como las planeé. Afortunadamente, mi mentor y tutor me ayudaron a solucionar el problema del trabajo. Antes de introducir funciones adicionales, la aplicación podría:",
    "toDoCaseChallenge2": "Con las nuevas funcionalidades, permite:",
    "toDoMainTakeaway1": "Mejora las habilidades de arranque",
    "toDoMainTakeaway2": "Trabajar en las habilidades de depuración",
    "toDoMainTakeaway3": "Ampliar las funcionalidades de la app más adelante",
    "toDoBeforeFeature1": "Agregar / eliminar tareas pendientes",
    "toDoBeforeFeature2": "Reorganizar las tareas pendientes en el escritorio",
    "toDoBeforeFeature3": "Tachar tareas pendientes",
    "toDoBeforeFeature4": "Mostrar notificaciones de alerta integradas en el navegador",
    "toDoAfterFeature1": "Agregar / eliminar listas de tareas pendientes",
    "toDoAfterFeature2": "Agregar / eliminar tareas pendientes a / de las listas de tareas pendientes (incluida la pulsación de \" Enter\" en el teclado)",
    "toDoAfterFeature3": "Borrar el campo de entrada",
    "toDoAfterFeature4": "Reorganiza y tacha tareas pendientes en dispositivos móviles con la ayuda de jQuery Mobile y jQuery Touch Punch",
    "toDoAfterFeature5": "Muestra notificaciones más bonitas con la ayuda de Bootstrap y jQuery UI",
    "toDoAfterFeature6": "Ver una guía sobre cómo usar la aplicación en diferentes plataformas con la ayuda de Bootstrap",

    "notFound": "No pudimos encontrar el recurso que estabas buscando.",
    "returnHomeParagraph": "Pero siempre puedes volver a la ",
    "returnHomeLink": "página de inicio",

    "copySkill": "Pulir la copia",
    "terminalSkill": "Trabajar en la terminal",
    "accessibilitySkill": "Accesibilidad",
    "externalApiSkill":"API externa",
    "nativeSkill": "Desarrollo de aplicaciones nativas",
    "troubleshootingSkill":"Solución de problemas",
    "TDDSkill":"Desarrollo impulsado por pruebas",
    "kanbanSkill":"Junta de Kanban",
    "agileSkill":"Flujo de trabajo ágil",
    "userStoriesSkill":"Historias de usuarios",
    "documentationSkill": "Documentación",
    "collabSkill":"Colaboración",
    "feedbackSkill":"Proporcionar retroalimentación",
    "contributeSkill":"Contribuir",
    "testingSkill": "Pruebas",
    "apiSkill": "Google Calendar API",
    "pwsSkill": "Aplicaciones web progresivas",
    "responsiveSkill": "Diseño sensible",
    "deploySkill": "Implementación de un sitio web",
    "caseLead": "Rol: Desarrollador principal",
    "caseTutor": "Tonny Ntambaazi:",
    "caseTutor2": "Director creativo",
    "caseMentor": "Nizar Triki:",
    "caseMentor2": "Administrador de ingeniería de software",
    "r3playMainTakeaway1": "Centrarse en la funcionalidad requerida primero",
    "r3playMainTakeaway2": "Mejorar las habilidades de gestión del tiempo",
    "r3playMainTakeaway3": "Profundizar en el conocimiento de las tecnologías utilizadas leyendo y practicando más",
    "r3playMainTakeaway4": "No dudo en pedir ayuda en caso de problemas técnicos",
    "r3playCaseChallenge1": "El desarrollo del lado del backend fue el más lento, mientras que el trabajo en el lado del cliente fue el más difícil técnicamente. Como resultado, me tomó más tiempo completar la pila completa en comparación con la duración habitual de dos logros de CareerFoundry. La razón de esto fue que me concentré en las mejoras funcionales y visuales de ambos logros por encima de los requisitos básicos, y necesitaba más tiempo para solucionar los problemas de la representación condicional de los elementos JSX, cómo implementar Redux en React, y la lógica condicional detrás de la representación de las sugerencias de películas para el usuario." ,
    "r3playCaseChallenge2": "Sin embargo, este fue mi proyecto favorito. He disfrutado desarrollando la interfaz de usuario y trabajando con la información de la base de datos. También mejoré rápidamente mis habilidades de terminal, comprensión de la consulta de la base de datos MongoDB NoSQL, renderizado condicional, filtrado de datos, personalización de los componentes de React Bootstrap, así como habilidades de administración de tiempo y priorización. Afortunadamente, mi tutor y mentor me ayudó durante el proyecto y pude aplicar las habilidades adquiridas más tarde al implementar características adicionales a la aplicación." ,
    "r3playSlide1Heading": "Vista de inicio de sesión",
    "r3playSlide2Heading": "Vista de película",
    "r3playSlide3Heading": "Vista de perfil",
    "r3playSlide1Description": "La vista de inicio de sesión de la aplicación R3 play donde los usuarios pueden iniciar sesión en la aplicación",
    "r3playSlide2Description": "La vista de películas de la aplicación R3play, que muestra una lista de películas disponibles en la aplicación",
    "r3playSlide3Description": "La vista de perfil de la aplicación R3play donde los usuarios pueden cambiar la información de su cuenta",
    

    "myFlixSlide1Heading":"Vista de inicio de sesión",
    "myFlixSlide2Heading": "Vista de película",
    "myFlixSlide3Heading": "Vista de perfil",
    "myFlixSlide1Description":" La vista de inicio de sesión de la aplicación MyFlix donde los usuarios pueden iniciar sesión en la aplicación",
    "myFlixSlide2Description":" La vista de películas de la aplicación MyFlix que muestra una lista de películas disponibles en la aplicación",
    "myFlixSlide3Description": "La vista de perfil de la aplicación MyFlix donde los usuarios pueden modificar la información de su cuenta",
    
    
    "meetSlide1Heading": "Interfaz general",
    "meetSlide2Heading": "Errores y advertencias",
    "meetSlide3Heading":"Detalles del evento",
    "meetSlide1Description":" Los eventos de Meet App cargados en la app con los campos del formulario permitiendo ajustar los resultados",
    "meetSlide2Description": "La pantalla de eventos de la aplicación Meet se mostró con advertencias y errores debido a los datos incorrectos ingresados",
    "meetSlide3Description": "La pantalla de eventos de la aplicación Meet con una tarjeta de eventos expandida",
    
    
    "owriteSlide1Heading": "Pantalla de bienvenida",
    "owriteSlide2Heading": "Pantalla de chat",
    "owriteSlide1Description": "La pantalla de bienvenida de la aplicación Owrite donde los usuarios pueden elegir un tema e ingresar a la sala de chat",
    "owriteSlide2Description": "La pantalla de Chat de la aplicación Owrite donde los usuarios pueden chatear, incluido el envío de archivos de audio e imagen",
    
    
    "pokemonSlide1Heading": "Mensaje de bienvenida",
    "pokemonSlide2Heading":"Resultados de Pokémon",
    "pokemonSlide3Heading": "Carta de Pokémon",
    "pokemonSlide1Description": "La página principal de la aplicación Pokemon con un mensaje de bienvenida",
    "pokemonSlide2Description": "La Aplicación Pokémon filtró los resultados de Pokémon mostrados como una lista",
    "pokemonSlide3Description":" La tarjeta Pokémon con datos que el usuario puede ver al hacer clic en el nombre de un Pokémon",
    

    "cookieInfo1": "Esta aplicación utiliza cookies y recopila datos sobre los visitantes. Obtenga más información sobre el uso ",
"cookieInfo2":"y",
"cookieInfo3": "",
"cookieLink1": "de Cookies",
"cookieLink2":"la privacidad",
"cookieConfirm":"Yo estoy de acuerdo",
    
    "toDoSlide1Heading": "Vista inicial",
    "toDoSlide2Heading": "Nueva lista",
    "toDoSlide3Heading":"Notificación",
    "toDoSlide1Description": "La vista inicial de Tareas pendientes de la aplicación donde los usuarios ven consejos sobre cómo usar la aplicación y agregan una primera lista",
    "toDoSlide2Description": "Se ha añadido una nueva lista de tareas pendientes",
    "toDoSlide3Description": "Cuando el usuario deja la entrada en blanco e intenta agregar una nueva tarea, aparece un mensaje de notificación",

    "menu": {
        "aboutMenu": "Información",
        "portfolioMenu": "Portfolio App",
        "projectsMenu": "Proyectos",
        "casesMenu": "Casos",
        "testimonialsMenu": "Testimonios",
        "contactMenu": "Contacto",
        "resumeMenu": "Currículum",
        "r3playMenu": "R3play App",
        "myFlixMenu": "MyFlix App",
        "meetMenu": "Meet App",
        "owriteMenu": "Owrite App",
        "pokemonMenu": "Pokemon App",
        "toDoMenu": "To Do App",
        "policiesMenu":"Política",
        "cookies": "Cookies",
        "privacy": "Privacidad"
    },
    "footer": {
        "copy": "© Yevhenii Airapetian, 2024 Todos los derechos reservados.",
        "impressumFooter": "Impresión",
        "toggleTitle": "Haz clic para alternar la barra lateral"
    },

    "notFoundImageAlt":" Una imagen que muestra un televisor viejo",
"caseHeroAlt": "Una imagen que muestra una captura de pantalla del caso del proyecto",
"caseSliderAlt":" Una imagen que muestra una captura de pantalla de una de las vistas de la aplicación",
"logoAlt": "Una imagen que muestra el logotipo de la aplicación",
"contactImageAlt": "Una imagen que muestra utensilios de escritura y una persona escribiendo",
"testimonialsSliderImageAlt": "Una imagen que muestra a un crítico",
"testimonialsImageAlt": "Una imagen que muestra a un equipo trabajando",
"projectsSliderImageAlt":" Una imagen que muestra una captura de pantalla realizada desde una aplicación implementada",
"projectsImageAlt": "Una imagen que muestra un lugar de trabajo con una computadora portátil y accesorios",
    "aboutCvDeAlt": "Un icono que muestra la bandera alemana",
"aboutCvEnAlt": "Un icono que muestra la bandera estadounidense",
"aboutCvUkAlt": "Un icono que muestra la bandera ucraniana",
"aboutCvDeTitle": "Haga clic aquí para descargar mi currículum en alemán. Es posible que deba utilizar un visor de archivos como Adobe Acrobat o similar",
"aboutCvEnTitle": "Haga clic aquí para descargar mi currículum en inglés. Es posible que deba utilizar un visor de archivos como Adobe Acrobat o similar",
"aboutCvUkTitle": "Haga clic aquí para descargar mi currículum en ucraniano. Es posible que deba utilizar un visor de archivos como Adobe Acrobat o similar",
"toggleResumeTitle": "Alternar archivos de reanudación",
"checkOutCodeTitle": "Verificar el código en Github",
"profileImageAlt": "Una imagen que muestra a un hombre con una chaqueta"
}