{
    "notificationCloseTitle":"Закрити",
    "whatsNewInfo":"Що нового: додаток перенесено на React.js, тепер він локалізований і має перемикач теми. Детальніше читайте ",
    "whatsNewLink":"тут",   
  "darkModalMessage":"Ласкаво просимо на бік темряви",
  "lightModalMessage":"Ласкаво просимо на бік світла",
  "modalConfirm":"Погнали!",
  "modalHint": "Натисніть, щоб закрити модальне вікно",
    "app_title": "Євгеній Айрапетян - Портфоліо",
    "languages": "Мови",
    "themeSwitcherLightHint":"Натисніть, щоб перейти на світлу тему",
    "themeSwitcherDarkHint":"Натисніть, щоб перейти на темну тему",
    "welcome text": "Привіт, я Євгеній!",
    "resume": "Резюме",
    "introduction": "Я веб-розробник, захоплений технологіями.",
    "experience": "Маючи попередній досвід викладання іноземних мов та написання академічних текстів, я із задоволенням продовжую кар'єру веб-розробника.",
    "first focus": "Я завжди зосереджувався на виконанні високоякісної роботи з дотриманням дедлайнів, використовуючи свої навички вирішення проблем, тайм-менеджменту та логічного мислення.",
    "second focus": "Я зосереджуюсь на тому, щоб об'єднати мій досвід з моїми професійними прагненнями, щоб допомогти створювати функціональні, адаптивні та доступні програмні рішення.",
    "availability": "Я доступний для офісної та гібридної роботи в Берліні та Потсдамі або віддалено.",
    "hobbies": "Окрім мого захоплення веб-розробкою, я також є активним фотографом-любителем та ентузіастом фітнесу, і в будь-який інший день ви можете зустріти мене на вулиці, коли я фотографую або піднімаю важкі предмети.",
    "code": "Код",
    "projects": "Проекти",
    "projectsInfo": "Тут ви знайдете поточні проекти з веб-розробки, які я завершив і над якими працюю. Всі вони мають гіперпосилання на кодову базу та кейси проектів, більшість з них мають посилання на онлайн версію, а деякі також мають додаткові посилання",
    "projectsViewTip":"Використовуйте елементи керування для перегляду списку проектів. Наведіть курсор на певний слайд, щоб перейти до посилань на проект. Торкніться певного слайду, щоб переглянути додаткову інформацію (на мобільному пристрої).",
    "r3playInfo": "Інтерфейс Web API R3play дозволяє користувачам реєструватися та виходити з системи, переглядати інформацію про фільми, серіали та аніме, а також керувати списками колекцій.",
    "r3playAPIInfo": "Веб-API, розроблений за допомогою Node.js, Express та MongoDB, що дозволяє користувачам реєструватися, скасовувати реєстрацію, переглядати інформацію про фільми, телешоу та аніме, а також керувати обраним.",
    "myFlixInfo": "Front-end для R3play Web API, розроблена за допомогою Angular, Typescript та Material UI, що дозволяє користувачам реєструватися, переглядати інформацію про фільми та додавати їх до обраного.",
    "meetInfo": "Прогресивний веб-додаток, написаний за допомогою функцій AWS Lambda, який використовує авторизацію та автентифікацію OAuth2 і відображає події з Google Calendar API CareerFoundry.",
    "owriteInfo": "React Native додаток, який дозволяє користувачам спілкуватися в чаті. Користувачі можуть встановити ім'я користувача, вибрати колір фону чату та надсилати текстові повідомлення, зображення та аудіозаписи.",
    "pokemonInfo": "Адаптивний додаток про покемонів, який отримує інформацію про покемонів за допомогою Ajax із зовнішнього API Pokedex та відображає дані про них, такі як зріст, вага, ідентифікатор, а також зображення спереду та ззаду",
    "toDoInfo": "Додаток на jQuery та Bootstrap, який дозволяє користувачам керувати справами. Користувачі можуть додавати, видаляти та змінювати порядок справ, створювати та видаляти списки справ, а також переглядати гід з використання програми.",
    "portfolioInfo":"Адаптивний веб-додаток, розроблений із використанням React, React Bootstrap і врахуванням вимог доступності, що дозволяє користувачам переглядати інформацію про мої проекти і т.д.",
    
    
    
    "r3playInfoTitle":"Натисніть, щоб дізнатися більше про R3PLAY API",
"r3playInfoTitleAPIDeployed": "Натисніть, щоб відкрити R3PLAY API",
"r3playInfoTitleGithub": "Натисніть, щоб відкрити репозиторій R3PLAY API на Github",
"myFlixInfoTitle":"Натисніть, щоб дізнатися більше про додаток MyFlix",
"myFlixInfoTitleGithub":"Натисніть, щоб відкрити репозиторій додатку MyFlix на Github",
"myFlixInfoTitleKanban": "Натисніть, щоб відкрити канбан-дошку проекту myFlix",
"meetInfoTitle": "Натисніть, щоб дізнатися більше про додаток Meet",
"meetInfoTitleDeployed": "Натисніть, щоб відкрити додаток Meet",
"meetInfoTitleGithub": "Натисніть, щоб відкрити репозиторій Meet App на Github",
"owriteInfoTitle": "Натисніть, щоб дізнатися більше про додаток Owrite",
"owriteInfoTitleGithub": "Натисніть, щоб відкрити додаток Owrite на Github",
"pokemonInfoTitle": "Натисніть, щоб дізнатися більше про додаток Pokemon",
"pokemonInfoTitleDeployed": "Натисніть, щоб відкрити додаток Pokemon",
"pokemonInfoTitleGithub": "Натисніть, щоб відкрити репозиторій додатку Pokemon на Github",
"toDoInfoTitle": "Натисніть, щоб дізнатися більше про додаток To-Do-List-App",
"toDoInfoTitleDeployed": "Натисніть, щоб відкрити додаток To-Do-List-App",
"toDoInfoTitleGithub": "Натисніть, щоб відкрити репозиторій додатку To-Do-List-App на Github",
"portfolioInfoTitle": "Натисніть, щоб дізнатися більше про додаток Portfolio",
"portfolioInfoTitleDeployed": "Натисніть, щоб відкрити додаток Portfolio",
"portfolioInfoTitleGithub": "Натисніть, щоб відкрити репозиторій додатку Portfolio на Github",
"testimonialSliderMore":"Натисніть, щоб переглянути повний текст відгуку",
   


    "projectsSliderMore": "Більше",
    "testimonials": "З вуст в уста",
    "wordOfMouth": "Я не був би там, де я є сьогодні, без усіх цих чудових людей, з якими я мав честь працювати.",
    "testimonialsViewTip": "Використовуйте елементи керування для перегляду списку відгуків. Наведіть курсор на заголовки відгуків, щоб прочитати більше. Натисніть на конкретний відгук, щоб переглянути додаткову інформацію (на мобільному пристрої)",
    "testimonial1": "Maya Septriana, Кар'єрний консультант, CareerFoundry",
    "testimonial2": "Nizar Triki, Менеджер з розробки програмного забезпечення chez Expensya",
    "testimonial3": "Dejan Gogov, Веб-розробник, Wild Code School",
    "testimonial1Text": "Євгеній – це людина, з якою дуже легко співпрацювати. Він завжди прагне до досконалості. Кожного разу, коли я даю йому зворотний зв'язок, він готовий вислухати і скорегувати завдання...",
    "testimonial2Text": "У мене була можливість бути ментором Євгенія протягом усього його навчання веб-розробці в CareerFoundry. Самодостатність Євгенія, швидке сприйняття понять...",
    "testimonial3Text": "Під час нашого 6-місячного Fullstack буткемпу Євгеній незмінно демонстрував позитивну та доброзичливу поведінку. Він рішуче підходив до завдань...",
    "testimonialsMore": "Більше",
    "contact": "Зв'язатися",
    "suggestion": "Хочете працювати разом або маєте пропозицію? Я відкритий до можливостей рекрутингу та коментарів",
    "eMailMe": "Не соромтеся надіслати мені електронного листа, використовуючи форму нижче",
    "contactFormHeader": "Зв'язатися",
    "firstName": "Ім'я",
    "firstNamePlaceholder": "Джої",
    "lastName": "Прізвище",
    "lastNamePlaceholder": "Тріббіані",
    "phoneNumber": "Номер телефону",
    "phoneNumberPlaceholder": "+49 1234 5678910",
    "eMail": "Електронна пошта",
    "eMailPlaceholder": "example@mail.com",
    "messageOrComment": "Повідомлення або коментар. Будь ласка, будьте люб'язні!",
    "messageOrCommentPlaceholder": "Ваше повідомлення",
    "contactFormTip": "Поля, позначені зірочкою, є обов'язковими для заповнення",
    "contactFormPoweredBy": "Працює на базі",
    "caseWorkflow":"Робочий процес",
"caseUpgrade":"Оновлення",
    "caseDatabase":"База даних",
    "caseApi":"API",
    "caseInterface":"Інтерфейс додатку",
    "caseTDD": "Розробка на основі тестування",
    "caseServerAndApi": "Серверна частина і API",
    "caseAgile": "Робочий процес Agile",
    "caseOverview": "Огляд",
    "casePurpose": "Мета і контекст",
    "caseObjective": "Мета",
    "caseServer": "Серверна частина",
    "caseClient": "Клієнтська частина",
    "caseApproach": "Підхід",
    "caseDuration": "Тривалість",
    "caseRetrospective": "Ретроспектива",
    "caseChallenges": "Виклики",
    "caseConclusion": "Висновки та ключові завдання",
    "caseMainTakeaways": "Основні висновки для майбутніх проектів",
    "apiPreview": "Попередній перегляд API",
    "appPreview": "Попередній перегляд додатку",
    "caseTechnologies": "Використані технології / навички",
    "caseCredits": "Учасники",
    
    

    "portfolioCaseHeading": "Розбір кейсу Portfolio App",
"portfolioCaseIntroduction": "Portfolio App - це адаптивний веб-додаток, розроблений за допомогою React та React Bootstrap, який надає користувачам інформацію про мої поточні проекти, відгуки, контакти та інформацію про соціальні платформи. Він локалізований декількома іноземними мовами. Користувачі мають доступ до інформації в окремих інтерфейсах, можуть перекласти додаток на бажану мову і змінювати тему оформлення на світлу або темну.",
"portfolioCaseRequired":"Portfolio App був обов'язковим проектом, який я розробив у рамках свого курсу \"Вступ до веб-розробки\" в CareerFoundry, щоб продемонструвати майстерність в HTML, CSS та розміщенні веб-сайтів онлайн. Крім того, я освоїв такі широко поширені методи веб-розробки, як тестування додатків, мінімізація CSS, доступність, підтримка старих браузерів та CSS анімації.",
"portfolioCaseAim": "Метою проекту було розробити та розмістити онлайн повнофункціональний статичний веб-сайт, який я міг би використовувати як своє професійне портфоліо. Проблема, яку я хотів вирішити, полягала у використанні інструментів, викладених у курсі \"Вступ до веб-розробки\" в CareerFoundry, для створення та розміщення онлайн робочого веб-сайту, який я би міг використати в якості професійного портфоліо.",
"portfolioCaseAboutWorkflow": "На початку процесу розробки я структурував вміст за допомогою HTML, а потім стилізував сторінки за допомогою звичайного CSS. Плагін Totally.js допоміг структурувати та оформити веб-сайт відповідно до рекомендацій щодо доступності веб-сторінок. Ці рекомендації призначені для того, щоб допомогти людям з фізичними або іншими обмеженнями краще орієнтуватися в Інтернеті. Для цих цілей були використані спеціальні теги \"aria\", а також інформативні описи та альтернативні текстові дані. На завершальних етапах проекту я протестував веб-сайт на предмет коректної роботи в різних операційних системах і браузерах, включаючи залучення резервного Javascript-коду для підтримки старіших версій браузера Internet Explorer.",
"portfolioCaseAboutUpgrade1":"Після завершення програми веб-розробки в Careerfoundry та під час навчання на \"Курсі підготовки до роботи\" в CareerFoundry я вирішив дещо оновити додаток. По-перше, на сайті з'явилися нові сторінки з кейсами проектів, де я детально описав, як я працював над кожним проектом під час навчання в CareerFoundry. По-друге, я оновив дизайн, зробивши його більш приємним візуально, функціональнішим та естетичнішим. Однак, оскільки в даний час статичні веб-сайти стають все більш застарілими, настав час перенести моє портфоліо в одну з бібліотек Javascript, які широко використовуються спільнотою веб-розробників. Оскільки, завершивши кілька проектів у буткемпі за допомогою React.js і маючи найбільший досвід роботи з ним, я вирішив використати його як основу свого проекту.",
"portfolioCaseAboutUpgrade2": "Я ініціалізував роботу за допомогою команди Create React App, потім перемістив і адаптував усі файли HTML і CSS в окремі функціональні компоненти та встановив необхідні залежності проекту. Проекти, відгуки та кейси отримали окремі слайдери з прикладами і відео-оглядами. Пізніше я локалізував додаток на кілька іноземних мов, додав темну тему та оновив додаток, реалізувавши можливість для користувачів зберігати налаштування мови та теми. І нарешті я перетворив своє портфоліо на прогресивний веб-додаток. За допомогою цієї функції користувачі можуть встановлювати додаток на настільні комп'ютери та мобільні пристрої, імітуючи досвід нативного додатка, наприклад, на платформах Android або Windows.",
"caseTotally": "Відвідати Github репозиторій Totally.js ",
"portfolioCaseAboutClient": "Я створив інтерфейс, щоб надати користувачам можливість переглядати дані, які стосуються мого професійного портфоліо. Спочатку це був статичний веб-сайт, розроблений із використанням звичайних HTML, CSS та Totally.JS, плагіна Javascript для перевірки доступності додатку. Портфоліо містило окремі HTML-сторінки, наприклад, головна, проекти, контакти та інші.",
"portfolioCaseDurationData": "На початковий проект пішло в цілому 2 тижні, а на поточний результат - 3-6 місяців в цілому",
"portfolioCaseConclusionData": "Додаток Portfolio був першим проектом в рамках навчального курсу з веб-розробки Career Foundry. Коли все було закінчено, я розпочав \"Курс повного занурення в фулстек розробку\" з роботи над додатком Pokemon App.",
"portfolioCaseConclusionData2": "Це був корисний досвід розробки та налагодження додатку від початкового стану до останніх удосконалень. Я також додав нові і розвинув старі навички (в тому числі і при самостійній роботі), такі як доопрацювання тексту, налаштування розміщення додатків React онлайн, використання бібліотек для локалізації, додавання та налаштування функції зміни теми, роботи з локальним сховищем, покращення візуального оформлення та інші.",
"portfolioCaseChallenge": "Розробка оригінального проекту була відносно простою та безпомилковою, оскільки я вже мав досвід роботи з технологіями, які для цього були потрібні. Насправді мені вдалося завершити його за 1 тиждень до закінчення терміну, і мої роботи були представлені як приклад для інших студентів.",
"portfolioCaseChallenge2": "Однак, коли я самостійно перейшов до більш складних технологій і вийшов за рамки вимог проекту, я зіткнувся з кількома проблемами. Однією з проблем було те, що я не зміг цілком додати темну тему в додаток. Коли я активував темну тему, оформлення додатку змінювалося лише частково. Ще одна проблема була пов'язана з труднощами розміщення додатку онлайн та необхідними для цього налаштуваннями React. На щастя, знання, отримані під час буткемпу, допомогли мені подолати ці перешкоди, і мені вдалося:",
"portfolioCaseChallengeDetail1": "Використати навички пошуку інформації та усунення помилок в коді, щоб вирішити проблеми, пов'язані з темною темою",
"portfolioCaseChallengeDetail2": "Дослідити і усунути проблеми, пов'язані з розміщенням додатку онлайн",
"portfolioMainTakeaway1": "Наполегливість - важливий навик у веб-розробці, а також вміння йти на компроміси і встановлювати нові пріоритети",
"portfolioMainTakeaway2": "Іноді помилка може виникнути несподівано, і рішення вимагає більшої уваги до деталей",
"portfolioMainTakeaway3": "У ваших проектах завжди є місце для вдосконалення, тому важливо зрозуміти момент, коли потрібно рухатися далі та / або розставити пріоритети",
"portfolioMainTakeaway4": "Код (швидко) старіє або потребує оновлення, тому час від часу перевіряйте свої старі проекти",

"portfolioSlide1Heading": "Головний інтерфейс (світла тема)",
"portfolioSlide2Heading": "Головний інтерфейс (темна тема)",
"portfolioSlide3Heading": "Інтерфейс локалізованого кейсу",
"portfolioSlide1Description": "Додаток Portfolio, де користувачі можуть прочитати більше про автора, отримати доступ до кодової бази та резюме (відображається у світлій темі)",
"portfolioSlide2Description": "Додаток Portfolio, де користувачі можуть прочитати більше про автора, отримати доступ до кодової бази та резюме (відображається у темній темі)",
"portfolioSlide3Description": "Інтерфейс одного з кейсів проекту, який локалізовано (в даному прикладі німецькою мовою)",

    
    
    "r3playCaseHeading": "Розбір кейсу R3play App",
    "r3playCaseIntroduction": "R3play - це веб-додаток, розроблений за допомогою стека MERN, який надає користувачам інформацію про фільми, телесеріали та аніме. Користувачі можуть отримати доступ до інформації про фільми, режисерів та жанри. Користувачі можуть створити обліковий запис, оновити свою інформацію та створити список улюблених фільмів, серіалів та аніме.",
    "r3playCaseRequired": "R3play - це обов'язковий проект, який я розробив у рамках свого повноцінного курсу занурення в CareerFoundry, щоб продемонструвати свою майстерність повноцінної веб-розробки за допомогою JavaScript.",
    "r3playCaseAim": "Проект мав на меті розробити повністю функціонуючий додаток повного стеку, який я міг би додати до свого професійного портфоліо. Проблема, яку я хотів вирішити, полягала в тому, щоб створити цілісний веб-додаток, поєднавши раніше розроблену серверну сторону із клієнтською з нуля.",
    "r3playCaseAboutServer": "Я розробив API RESTful за допомогою Node.js та Express, який взаємодіє з нереляційною базою даних (MongoDB). API використовує загальні методи HTTP, такі як GET, PUT, POST та DELETE. Для отримання даних та зберігання даних у базі даних використовуються методи CRUD. API надає інформацію про фільми, телесеріали та аніме у форматі JSON.",
    "caseViewEndpoints": "Перегляд кінцевих точок",
    "r3playCasePostman": "Я використовував Postman для тестування відповідей та запитів на API. Я також скористався базовою аутентифікацією HTTP та автентифікацією JWT, щоб забезпечити функції аутентифікації та авторизації.",
    "r3playCaseAboutClient": "Завершивши проект API, я продовжив створення клієнта, який би знадобився користувачам під час взаємодії з логікою та даними з API та бази даних. Це односторінковий, адаптивний веб-додаток, розроблений за допомогою React та React-Redux. Він відображає декілька інтерфейсів, включаючи (але не обмежуючись) головний (показує список усіх фільмів, телесеріалів та аніме), окремий фільм, телесеріал та аніме (показує дані про один фільм, телесеріал та аніме, а також дозволяє користувачам додавати або видаляти їх до або зі свого списку улюблених), сторінка входу, реєстрації та створення профілю (де користувачі можуть оновлювати свої дані користувача та список вибраних).",
    "caseSliderTip": "Використовуйте елементи керування для перегляду списку проектів. Наведіть курсор на заголовки слайдів, щоб прочитати більше. Натисніть на певний слайд, щоб переглянути додаткову інформацію (на мобільному пристрої)",
    "r3playCaseDurationData": "Загалом 12 тижнів (бекенд: 7 тижнів, фронтенд: 5 тижнів)",
    "r3playCaseConclusionData": "Додаток до фільму був лише другим повним веб-додатком, який я розробив на курсі веб-розробки Full-Stack. Коли його було закінчено, я зосередився на підвищенні своїх навичок веб-розробки, зокрема підходу, орієнтованого на тестуванні. Він вимагає впровадження фази тестування перед тим, як додати фактичну функціональну логіку, що дозволяє розробляти швидше і безпечніше, і без помилок.",
    "myFlixCaseHeading": "Кейс додатку MyFlix",
    "myFlixCaseIntroduction": "MyFlix-Angular-App - Це веб-додаток, розроблений за допомогою стека MEAN, який надає користувачам інформацію про фільми. Користувачі можуть отримати доступ до інформації про фільми, режисерів та жанри. Користувачі можуть створити обліковий запис, оновити свої дані та створити список улюблених фільмів.",
    "myFlixCaseRequired": "Додаток MyFlix-Angular-App був обов'язковим проектом, який я розробив під час курсу повного занурення CareerFoundry, щоб продемонструвати свою майстерність у веб-розробці за допомогою JavaScript. Крім того, я практикував управління проектами Agile, надання зворотного зв'язку та створення документації",
    "myFlixCaseAboutServer": "Я розробив RESTful API за допомогою Node.js та Express, який взаємодіє з нереляційною базою даних (MongoDB). API використовує такі поширені методи HTTP, як GET, PUT, POST та DELETE. Для вилучення даних з бази даних та їх збереження в ній використовуються методи CRUD. API надає інформацію про фільми, серіали та аніме у форматі JSON.",
    "myFlixCasePostman": "Я використовував Postman для тестування відповідей та запитів до API. Я також використовував базову автентифікацію HTTP та автентифікацію JWT для забезпечення функцій автентифікації та авторизації.",
"myFlixCaseAgileData": "Робота над проектом розпочалася зі створення дошки Kanban та заповнення її вимогами проекту та історіями користувачів. Коли завдання проекту була виконано, вона переміщалося в розділ \"Готово\". Крім того, я створив детальну документацію за допомогою Typedoc відповідно до вимог проекту.",
"myFlixCaseAim": "Метою проекту було розробити повнофункціональний додаток, який я міг би додати до свого професійного портфоліо. Проблема, яку я хотів вирішити, полягала у створенні повноцінної веб-програми розробленої за допомогою повного стеком, з'єднавши раніше розроблену серверну та клієнтську частину програми з нуля.",
"myFlixCaseConclusion": "Додаток myFlix був останнім повноцінним веб-додатком, який я розробив у курсі веб-розробки повного стеку. Коли все було закінчено, я приступив до розширення свого портфоліо",
    "myFlixCaseAboutClient": "Я створив інтерфейс, щоб користувачі могли взаємодіяти з логікою та даними з API та бази даних. Це односторінковий адаптивний веб-додаток, розроблений за допомогою Angular та Material UI. Він відображає кілька видів інтерфейсу, включаючи основний (відображає список усіх фільмів, кнопку для керування списком улюбленого та кнопки для перегляду додаткової інформації про фільм), інтерфейс входу / реєстрації та інтерфейс профілю (де користувачі можуть оновлювати свої дані Користувача).",
    "myFlixCaseConclusionData": "Додаток myFlix був останнім повностековим веб-додатком, який я розробив на курсі повного стеку веб-розробки. Коли він був завершений, я приступив до розширення свого портфоліо",
    "myFlixCaseConclusionData2": "Труднощі, з якими я зіткнувся, виникли в кінці проекту і були більше пов'язані з особливостями Angular та Github. Одна з проблем виникла, коли сторінки Github довгий час відмовлялися відображати додаток. Інший випадок стався, коли локальні зміни в кодовій базі не відображалися в готовій версії додатку. Щоб вирішити цю проблему, я звернувся до свого наставника та тьютора, і під час сеансу парного програмування нам вдалося усунути неполадки.",
    "myFlixCaseConclusionData3": "Це також був корисний досвід у налаштуванні додатку та усуненні неполадок, використанні команд терміналу git, особливостях роботи з Angular і парних сесіях програмування. Я також додав до свого арсеналу нові навички, такі як Typescript, Angular, Material UI, правильне коментування коду, співпраця та інші.",
    "myFlixCaseDurationData": "майже 1,5 тижні (10 днів)",
    "myFlixCaseChallenge": "На Розробку додатку myFlix знадобилось набагато менше часу та зусиль порівняно з додатком R3play на основі React, оскільки:",
    "myFlixCaseChallengeDetail1":"API вже було створено",
    "myFlixCaseChallengeDetail2": "Практика роботи з React допомогла прискорити процес розробки",
    "myFlixCaseChallengeDetail3": "Я не додав багато необов'язкових функцій і дотримувався основних вимог курсу",
    "myFlixCaseChallengeDetail4": "Час, що залишався в буткемпі, вже був обмежений",
    "myFlixMainTakeaway1": "Покращити функціональність, щоб вона відповідала усім можливостям додатку R3play",
    "myFlixMainTakeaway2": "Дізнатися більше про Typescript",
    "myFlixMainTakeaway3": "Дізнатися більше про Material UI",
    "myFlixMainTakeaway4": "продовжувати досліджувати інші технології та найкращі практики у веб-розробці",
    
    
    "meetCaseHeading": "Розбір кейсу Meet App",
    "meetCaseIntroduction":"Meet App - це адаптивний прогресивний веб-додаток, розроблений з використанням підходу до розробки, заснованого на тестуванні, з використанням безсерверних лямбда-функцій AWS, екрану аутентифікації та авторизації Google OAuth2 і бібліотеки Recharts, що дозволяє користувачам переглядати події Google Calendar API. Користувачі можуть увійти в Google, вказати місто та кількість подій, щоб відобразити їх, а також дізнатися більше про них. Додаток можна встановити на робочий стіл або на мобільний пристрій завдяки рекомендаціям PWA, використовувати як онлайн, так і офлайн. Він показує повідомлення при введенні невірних даних і / або втрати інтернет-з'єднання.",
    "meetCaseRequired": "Meet App був обов'язковим проектом, який я розробив у рамках курсу занурення в full-stack розробку в буткемпі CareerFoundry, покликаним продемонструвати мою майстерність в тестуванні повнофункціональної веб-розробки з використанням JavaScript і безсерверних технологій.",
    "meetCaseAboutTDD": "Я розробив додаток, спочатку написавши історії користувачів. За допомогою підходу до розробки, заснованого на тестуванні, я застосував такі методи тестування як unit, integration, user acceptance, та end-to-end testing, щоб написати необхідні тести перед впровадженням коду",
    "meetCaseAboutServerAndApi": "Я розробив бекенд, використовуючи безсерверні лямбда-функції AWS як вимогу до проекту. Використання безсерверного інтерфейсу дозволяє скоротити обсяг додаткової роботи з управління сервером і спрощує масштабованість. Для збору даних про події в додатку використовувався Google Calendar від CareerFoundry. Екран автентифікації Google OAuth2 був налаштований для автентифікації та авторизації користувачів у додатку. На завершальній стадії розробки я використовував React service worker для перетворення Meet App у прогресивний веб-додаток. Бібліотека Recharts дозволяє візуалізувати дані про події у вигляді двох типів діаграм (точкових і кругових).",
    "meetCaseAim": "Метою проекту було розробити повнофункціональний додаток, який я міг би додати до свого професійного портфоліо. Проблемою, яку я хотів вирішити, було створення повноцінного веб-додатку із використанням технологій повного стеку, використовуючи підхід до розробки, заснованого на тестуванні, а також безсерверні лямбда-функції AWS, React.js і прогресивні вимоги до веб-додатків.",
    "meetCaseAboutClient": "Що стосується візуальної частини, інтерфейс був адаптований за допомогою звичайних CSS та JSX",
    "meetCaseConclusionData":"Проект Meet App був складним, але цікавим. Коли він був завершений, я приступив до наступного проекту, який включав розробку нативного додатка за допомогою React Native",
    "meetCaseDurationData":"Майже 1 місяць (28 днів)",
    "meetCaseChallenge1": "Найбільшою проблемою для мене в цьому проекті був сам підхід до розробки, заснованого на тестуванні. До цього я писав код у стилі, заснованому на розробці, і мені довелося витратити деякий час, щоб звикнути до нового методу. Однак робота над додатком йшла досить успішно, і я швидко освоївся з новою темою. Однією з проблем під час роботи над проектом була неможливість авторизації користувачів в додатку. Звернувшись до свого викладача, я вирішив проблему, додавши тестових користувачів вручну через консоль розробника Google.",
    "meetCaseChallenge2": "Після усунення несправностей під час встановлення додатку на смартфон, я успішно перетворив його на прогресивний веб-додаток. Мені також сподобалося працювати з сповіщеннями користувачів та бібліотекою Recharts. Я також вдосконалив свої знання та навички щодо підходу TDD та налаштування облікових записів розробника AWS та Google, а також підтвердив право власності на домен.",
    "meetMainTakeaway1": "Застосовувати підхід TDD у додаткових проектах",
    "meetMainTakeaway2": "Дізнатися більше про візуалізацію даних",



    "owriteCaseHeading": "Кейс додатку Owrite",
    "owriteCaseIntroduction": "OWrite - це додаток для спілкування в режимі реального часу на основі React Native, розроблений з використанням React Native, Expo CLI, рекомендацій щодо доступності та Android Studio для самого додатку, а також Google Firebase та Firestore для бази даних. Він надає користувачам функції спілкування в режимі реального часу, включаючи перегляд історії повідомлень завдяки AsyncStorage, відправку повідомлень, фотографій, аудіозаписів і даних про геолокацію. Користувачі можуть вказати своє ім'я користувача та вибрати колір фону програми.",
    "owriteCaseRequired": "OWrite був обов'язковим проектом, який я розробив у рамках свого курсу повного занурення в розробку повного стеку в CareerFoundry, щоб продемонструвати свою майстерність у розробці нативних додатків за допомогою React Native, Expo CLI, Android Studio та Google Firebase/Firestore",
    "owriteCaseAim": "Метою проекту було розробити повністю функціонуючий нативний додаток, який я міг би додати до свого професійного портфоліо. Проблемою, яку я хотів вирішити, було створення повноцінного нативного додатку шляхом підключення бази даних Google Firebase/Firestore до інтерфейсу додатку, розробленого за допомогою React Native.",
    "owriteCaseAboutDatabase": "Я розробив базу даних за допомогою Google Firebase для зберігання даних двох користувачів, необхідних для тестування. Пізніше я використовував Google Firestore для зберігання даних чату користувачів",
    "owriteCaseAboutInterface": "Для тестування інтерфейсу були використані Android Studio і додаток Expo Go для Android. Для розробки двох інтерфейсів додатку: початкового інтерфейсу та інтерфейсу чату використовувався React Native. Початковий інтерфейс був розроблений з використанням доступних елементів відповідно до рекомендацій React Native. Він дозволяє задати ім'я користувача і вибрати колір фону для інтерфейсу чату. В інтерфейсі чату відображається ім'я користувача, історія повідомлень, текстове поле і меню з додатковими файловими опціями. Для розробки необхідних функцій я використав такі бібліотеки, як Gifted Chat, Expo Media, Expo Image Picker, Stack Navigation та інші. Для забезпечення автономного використання був використаний AsyncStorage.",
    "owriteCaseAboutServer": "Написання логіки сервера почалося зі створення облікового запису в Google Firebase та його налаштування. Потім я приступив до налаштування конфігурації Google Firebase.",
    "owriteCaseConclusionData": "Додаток OWrite був передостаннім проектом, над яким я працював на курсі веб-розробки Full-Stack. Коли все було закінчено, я зосередився на подальшому вдосконаленні своїх навичок розробки, зокрема, додав ще один фреймворк та систему проектування до свого набору навичок, Angular та Material UI відповідно. Наступний проект вимагав створення інтерфейсу для API R3PLAY, цього разу за допомогою Angular та Material UI.",
    "owriteCaseDurationData": "1 тиждень",
    "owriteCaseChallenge1": "Проблеми, з якими я стикнувся під час цього проекту, були більше пов'язані з самим часом, що залишався на курсі, ніж з фактичною роботою над кодом. Як згадувалося раніше, оскільки я доклав додаткових зусиль для вдосконалення API та фронтенд R3play App, до кінця курсу залишалося менше часу. Як результат, мені довелося спланувати свій графік, щоб вчасно завершити проект і зосередитись лише на необхідних та рекомендованих функціях.",
    "owriteCaseChallenge2": "мені особливо сподобалося розробляти цей додаток, тому що я завжди хотів зануритися в розробку власних додатків, і React Native був у моєму списку завдань. Крім того, було приємно знати, що раніше набуті навички (управління часом та визначення пріоритетів) допомогли мені дуже швидко завершити проект та додати нові навички нативної розробки до мого набору інструментів.",
    "owriteMainTakeaway1": "Практикувати створення real-time додатків на додаткових проектах",
    "owriteMainTakeaway2": "Дослідити тему розробки нативних додатків",
    
    
    "pokedexLink":"API Pokedex",
    "pokemonCaseHeading": "Кейс додатку Pokemon App",
    "pokemonCaseIntroduction": "Pokemon App - це веб-додаток, розроблений за допомогою HTML, CSS, Javascript та Bootstrap. Він надає користувачам інформацію про покемонів, отриману з API Pokedex. Користувачі можуть отримати доступ до такої інформації: ідентифікатор покемона, зріст і вага, бачити зображення покемона спереду і ззаду, а також шукати покемона за назвою.",
    "Pokemoncaseaim": "Pokemon App був обов'язковим проектом, який я розробив у рамках курсу повного занурення в розробку повного стеку в CareerFoundry, щоб продемонструвати свою майстерність у веб-розробці за допомогою JavaScript та Bootstrap",
    "pokemonCaseAim": "Метою проекту було розробити повнофункціональний додаток, який я міг би додати до свого професійного портфоліо. Проблема, яку я хотів вирішити, полягала у створенні веб-додатку за допомогою зовнішнього API та популярного CSS фреймворку.",
    "pokemonCaseAboutApi": "Я використовував API Pokedex як частину необхідних інструментів проекту, щоб заповнити додаток різною інформацією про покемонів. Для цієї мети були використані Javascript promises для обробки асинхронних запитів і відповідей до/з Pokedex API.",
    "pokemonCaseAboutClient": "Після завершення логічної частини програми я приступив до етапу стилізації, включивши Bootstrap в якості обов'язковго CSS-фреймворка. Завдання полягало в тому, щоб використовувати сітку, класи і компоненти Bootstrap для реалізації необхідної функціональності. Нарешті, я протестував програму на різних екранах, пристроях та операційних системах за допомогою емуляторів пристроїв/систем.",
    "pokemonCaseConclusionData": "Додаток Pokemon став першим проектом курсу повного занурення в розробку повного стеку. Коли він був завершений, я зосередився на вдосконаленні своїх навичок розробки, зокрема на роботі з Node.js, Express та API. Розробка мого власного API була корисним і важливим кроком на шляху до подальшого оволодіння найважливішими навичками серверної веб-розробки",
    "pokemonCaseDurationData": "4 тижні",
    "pokemonCaseChallenge1": "Частина, яка вимагала використання асинхронного Javascript, була найбільш трудомісткою, тоді як робота над стилізацією була відносно простою. В цілому, на завершення проекту у мене пішов 1 місяць, що було приблизно середньостатистичним на курсі. Також у мене виникли труднощі з відображенням конкретної інформації про покемонів, як описано в документації Pokedex. Крім того, мені довелося вирішити проблему, коли дані не відображалися в інтерфейсі.",
    "pokemonCaseChallenge2": "Тим не менш, це був цікавий і відносно простий у виконанні проект. Мені сподобалося занурюватися в основи Javascript, вивчаючи Ajax. Крім того, мене надихнула стилізація за допомогою Bootstrap. Я також швидко набув корисних навичок роботи з Javascript promises та API, читання документації, стилізації за допомогою CSS-фреймворків та усунення несправностей. На щастя, мій наставник допомагав мені під час проекту, і я зміг застосувати отримані навички пізніше при впровадженні додаткових функцій у веь-додатку.",
    "pokemonMainTakeaway1": "Вдосконалити навички вирішення проблем, практикуючись та використовуючи освітні ресурси",
    "pokemonMainTakeaway2": "Зберігати мотивацію, навіть коли виникають тимчасові труднощі з навчанням",
    "pokemonMainTakeaway3": "Покращити цифрову гігієну та знаходити час на відпочинок",
    
    
    
    
    "toDoCaseHeading": "Кейс To Do App",
    "toDoCaseIntroduction": "To Do App - це адаптивний веб-додаток, розроблений за допомогою HTML, Bootstrap та Javascript і надає користувачам можливість керувати своїми завданнями. Користувачі можуть додавати та видаляти свої завдання, а також виконувати інші функції.",
    "toDoCaseRequired": "To Do App був необхідним до виконання міні-проект, який я розробив у рамках курсу повного занурення в фулстек розробку в CareerFoundry, щоб продемонструвати свою майстерність роботи з jQuery",
    "toDoCaseAim": "Метою проекту було створити повнофункціональний веб-додаток, яким я міг би поповнити своє професійне портфоліо. Проблема, яку я хотів вирішити, полягала в тому, щоб перетворити звичайний Javascript код на код jQuery.",
    "toDoCaseAboutClient": "Отримавши оригінальний звичайний код Javascript з базовою функціональністю програми, я почав перетворювати його в код jQuery. Це завдання дозволило мені застосувати додаткові функції та стилі.",
    "toDoCaseConclusionData": "To-Do App був додатковим міні-проектом, який я виконував у рамках повного курсу занурення, але мені сподобалося додавати до нього нові функції та стилі, що виходило за рамки основні вимог. Це швидко покращило мої навички jQuery, Bootstrap, налагодження та роботи з додатковими бібліотеками.",
    "toDoCaseDurationData": "1 день на створення необхідної функціональності і близько 3 тижнів для створення додаткових функцій.",
    "toDoCaseChallenge1": "Розробка основних функцій додатку не викликала ніяких труднощів, і я впорався із завданням протягом 1 дня. Однак я не був задоволений його функціональністю і вирішив знайти додатковий час для вдосконалення. Ці доповнення спричинили багато проблем з налаштуванням, оскільки різні бібліотеки jQuery не працювали належним чином разом, як я планував. На щастя, мій наставник допоміг мені усунути неполадки в роботі. До додаткових функцій, додаток міг:",
    "toDoCaseChallenge2":"Завдяки новим функціям можливо:",
    "toDoMainTakeaway1": "Покращити навички роботи з Bootstrap",
    "toDoMainTakeaway2": "Працювати над навичками вирішення помилок в коді",
    "toDoMainTakeaway3": "Розширити можливості додатку в подальшому",
    "toDoBeforeFeature1": "Додавати / видаляти завдання",
    "toDoBeforeFeature2": "Змінювати порядок завдань в списку",
    "toDoBeforeFeature3": "викреслювати завдання",
    "toDoBeforeFeature4": "Показувати вбудовані в браузер попереджувальні сповіщення",
    "toDoAfterFeature1": "Додавати / видаляти списки справ",
    "toDoAfterFeature2": "Додавати/видаляти завдання в /зі списку справ (включаючи натискання клавіші \"Enter\" на клавіатурі)",
    "toDoAfterFeature3": "Очищувати поле введення",
    "toDoAfterFeature4": "Переміщувати та викреслювати завдання на мобільних пристроях за допомогою JQuery Mobile та jQuery Touch Punch",
    "toDoAfterFeature5": "Сповіщення стали більш привабливими за допомогою Bootstrap та jQuery UI",
    "toDoAfterFeature6": "Переглядати гід із використання додатку на різних платформах за допомогою Bootstrap",



    "notFound":"Ми не змогли знайти ресурс, який Ви шукали",
    "returnHomeParagraph":"Але Ви завжди можете повернутися на ",
    "returnHomeLink":"Головну сторінку",
    
    "copySkill":"Полірування тексту",
    "terminalSkill":"Робота в командному рядку",
    "accessibilitySkill":"Доступність",
    "externalApiSkill":"Сторонній API",
    "nativeSkill":"Нативна розробка додатків",
    "troubleshootingSkill":"Усунення помилок в коді",
    "TDDSkill":"Розробка на основі тестування",
    "kanbanSkill": "Kanban-дошка",
    "agileSkill": "Робочий процес Agile",
    "documentationSkill": "Вміння документувати",
    "userStoriesSkill": "Історії користувачів",
    "collabSkill": "Командна робота",
    "feedbackSkill": "Надання зворотного зв'язку",
    "contributeSkill": "Участь у проекті",
    "testingSkill": "Розробка з позиції тестування",
    "apiSkill": "Google Calendar API",
    "pwsSkill": "Прогресивні веб-програми",
    "responsiveSkill": "Адаптивний дизайн",
    "deploySkill": "Розміщення веб-сайту онлайн",
    "caseLead": "Роль: провідний розробник",
    "caseTutor": "Tonny Ntambaazi:",
    "caseTutor2": "Творчий директор",
    "caseMentor": "Nizar Triki:",
    "caseMentor2": "Менеджер програмного забезпечення",
    "r3playMainTakeaway1": "Спочатку зосередитись на необхідному функціоналі",
    "r3playMainTakeaway2": "Покращити навички тайм-менеджменту",
    "r3playMainTakeaway3": "Поглибити знання про використовувані технології, читаючи та практикуючи більше",
    "r3playMainTakeaway4": "Не сумніватись звернутися за допомогою у разі технічних питань",
    "r3playCaseChallenge1": "Розвиток бекенда був найбільш трудомістким, тоді як робота на стороні клієнта була найбільш складною технічно. Як результат, мені знадобилося більше часу, щоб завершити розробку повного стеку порівняно зі звичайною тривалістю двох проектів CareerFoundry. Причиною цього було те, що я зосередився на функціональних та візуальних вдосконаленнях обох проектів, що перевищувало основні вимоги. Також мені знадобилось більше часу, щоб вирішити проблеми умовної візуалізації елементів JSX, як реалізувати Redux в React та логіку візуалізації пропозицій фільмів користувачеві.",
    "r3playCaseChallenge2": "Тим не менш, це був мій улюблений проект. Мені сподобалось розробляти інтерфейс користувача та працювати з інформацією в базі даних. Я також швидко покращив свої навички рооти в командному рядку, роботи із запитами у базі даних MongoDB NoSQL, умовної візуалізації, фільтрації даних, налаштування компонентів React Bootstrap, а також навички тайм-менеджменту та встановлення пріоритетів. На щастя, мої кваліфікований викладач та наставник допомагали мені під час проекту, і я зміг застосувати отримані навички пізніше впровадивши інші функції у додаток.",
    "r3playSlide1Heading": "Інтерфейс входу",
    "r3playSlide2Heading": "Інтерфейс фільму",
    "r3playSlide3Heading": "Інтерфейс профілю",
    "r3playSlide1Description": "Інтерфейс входу в R3play App, де користувачі можуть увійти в додаток",
    "r3playSlide2Description": "Інтерфейс фільмів в R3play App, який відображає список фільмів, доступних у додатку",
    "r3playSlide3Description": "Інтерфейс профілю в R3play App, де користувачі можуть змінювати інформацію свого облікового запису",
    
    
    "myFlixSlide1Heading": "Інтерфейс Входу",
"myFlixSlide2Heading": "Інтерфейс Фільмів",
"myFlixSlide3Heading": "Інтерфейс Профілю",
"myFlixSlide1Description": "Інтерфейс входу в додаток MyFlix, де користувачі можуть авторизуватись в додатку",
"myFlixSlide2Description": "Інтерфейс фільмів в додатку MyFlix, який відображає список фільмів, доступних у додатку",
"myFlixSlide3Description": "Інтерфейс профілю в додатку MyFlix, де користувачі можуть змінювати інформацію про свій обліковий запис",


"meetSlide1Heading": "Загальний інтерфейс",
"meetSlide2Heading": "Помилки та попередження",
"meetSlide3Heading": "Відомості про подію",
"meetSlide1Description": "Події Meet App відображаються в додатку з формою, що дозволяє коригувати результати",
"meetSlide2Description": "Інтерфейс подій Meet App відображається з попередженнями і помилками через неправильно введені дані",
"meetSlide3Description": "Інтерфейс подій Meet App з інформацією про події",


"owriteSlide1Heading":"Початковий інтерфейс",
"owriteSlide2Heading":"Інтерфейс чату",
"owriteSlide1Description": "Початковий інтерфейс додатку Owrite, де користувачі можуть вибрати тему та увійти в чат",
"owriteSlide2Description": "Інтерфейс чату додатку Owrite, в якому користувачі можуть спілкуватися, в тому числі надсилати аудіо та графічні файли",


"pokemonSlide1Heading": "Привітання",
"pokemonSlide2Heading": "Результати пошуку покемонів",
"pokemonSlide3Heading": "Картка покемона",
"pokemonSlide1Description": "Головна сторінка Pokemon App з привітанням",
"pokemonSlide2Description": "Веб-додаток Pokemon відфільтрував результати пошуку покемонів, що відображаються у вигляді списку",
"pokemonSlide3Description": "Картка покемона з даними, які користувач може переглянути, натиснувши на ім'я покемона",


"toDoSlide1Heading": "Головна сторінка",
"toDoSlide2Heading":"Новий список",
"toDoSlide3Heading":"Сповіщення",
"toDoSlide1Description": "Головна сторінка додатку, де користувачі можуть переглянути поради щодо використання додатка та додавання першого списку",
"toDoSlide2Description": "Додано новий список завдань",
"toDoSlide3Description": "Коли користувач залишає поле введення порожнім і намагається додати нове завдання, з'являється сповіщення",
    

"cookieInfo1": "Цей додаток використовує файли cookie та збирає дані про відвідувачів. Дізнайтеся більше про використання ",
"cookieInfo2":"та",
"cookieInfo3": "",
"cookieLink1": "Cookie",
"cookieLink2":"Конфіденційності",
"cookieConfirm":"Я згоден",
    
    "menu": {
        "portfolioMenu": "Portfolio App",
        "aboutMenu": "Про",
        "projectsMenu": "Проекти",
        "casesMenu": "Кейси",
        "testimonialsMenu": "Рекомендації",
        "contactMenu": "Контакт",
        "resumeMenu": "Резюме",
        "r3playMenu": "R3play App",
        "myFlixMenu": "MyFlix App",
        "meetMenu": "Meet App",
        "owriteMenu": "Owrite App",
        "pokemonMenu": "Pokemon App",
        "toDoMenu": "To Do App",
        "policiesMenu":"Політика",
"cookies":"Cookies",
"privacy": "Конфіденційність"
    },
    "footer": {
        "copy": "© Євгеній Айрапетян, 2024 Всі права захищені.",
        "impressumFooter": "Відбиток",
        "toggleTitle": "Натисніть, щоб переключити бічну панель"
    },


    "notFoundImageAlt": "Зображення, що показує старий телевізор",
"caseHeroAlt": "Зображення, що показує скріншот з кейса проекту",
"caseSliderAlt": "Зображення, що показує скріншот з одного з інтерфейсів додатку",
"logoAlt": "Зображення, що показує логотип додатку",
"contactImageAlt": "Зображення, що показує Письмове приладдя і пише людини",
"testimonialsSliderImageAlt": "Зображення, що показує рецензента",
"testimonialsImageAlt": "Зображення, що показує роботу команди",
"projectsSliderImageAlt": "Зображення, що показує скріншот, зроблений із живої версії додатку",
"projectsImageAlt": "Зображення робочого місця з ноутбуком та аксесуарами",
    "aboutCvDeAlt": "Значок із зображенням німецького прапора",
"aboutCvEnAlt": "Значок із зображенням американського прапора",
"aboutCvUkAlt":"Значок із зображенням українського прапора",
"aboutCvDeTitle": "Натисніть тут, щоб завантажити моє резюме німецькою мовою. Можливо, вам доведеться скористатися засобом перегляду файлів, таким як Adobe Acrobat або подібним",
"aboutCvEnTitle": "Натисніть тут, щоб завантажити моє резюме англійською мовою. Можливо, вам знадобиться програма для перегляду файлів, наприклад, Adobe Acrobat або аналогічна",
"aboutCvUkTitle": "Натисніть тут, щоб завантажити моє резюме українською мовою. Можливо, вам знадобиться переглядач файлів, наприклад Adobe Acrobat або подібний",
"toggleResumeTitle": "Показати або сховати файли резюме",
"checkOutCodeTitle": "Переглянути код на Github",
"profileImageAlt": "Фотографія, на якій зображений чоловік у куртці"
}