


    {
      "notificationCloseTitle":"انقر للإغلاق",
      "whatsNewInfo":"ما الجديد: انتقل التطبيق للرد.جس ، مترجمة الآن ، ولها موضوع توغلر. اقرأ المزيد ",
      "whatsNewLink":"هنا",
      "darkModalMessage": "",
      "lightModalMessage": "",
      "modalConfirm": "تم تبديل وضع اللون. لنذهب!",
      "modalHint": "انقر لإغلاق مشروط",
      "app_title":"Yevhenii Airapetian - محفظة",
      "languages":"اللغات",
      "themeSwitcherLightHint": "انقر هنا من فضلك للتبديل إلى موضوع الضوء",
      "themeSwitcherDarkHint": "انقر هنا من فضلك للتبديل إلى المظهر الداكن",
      "welcome text": "مرحبا ، أنا Yevhenii!",
      "resume":"السيرة الذاتية",
      "introduction":"أنا مطور ويب شغوف بالتكنولوجيا",
      "experience": "مع الخبرة السابقة في تدريس اللغات الأجنبية والكتابة الأكاديمية ، أنا متحمس لمتابعة مهنة كمطور ويب.",
      "first focus": "لقد ركزت دائما على تقديم عمل عالي الجودة يفي بالمواعيد النهائية ، وتوظيف مهاراتي في حل المشكلات وإدارة الوقت والتفكير المنطقي.",
      "second focus": "ينصب تركيزي على الجمع بين خبرتي وتطلعاتي المهنية للمساعدة في إنشاء حلول برمجية وظيفية وسريعة الاستجابة ويمكن الوصول إليها.",
      "availability": "أنا متاح للعمل في الموقع والعمل المختلط في منطقة برلين وبوتسدام أو عن بعد.",
      "hobbies": "بالإضافة إلى شغفي في تطوير الويب ، فأنا أيضا مصور هواية نشط ومتحمس للياقة البدنية ، وفي أي يوم آخر يمكنك أن تجدني بالخارج تلتقط الصور أو ترفع أوزانا ثقيلة.",
      "code":"كود",
      "projects":"المشاريع",
      "projectsInfo": "هنا سوف تجد مشاريع تطوير الشبكة الحالية التي أكملت وعملت على. تحتوي جميعها على ارتباطات تشعبية إلى قاعدة التعليمات البرمجية وحالات المشروع ، ومعظمها يحتوي على رابط إلى الإصدار المنشور ، وبعضها يحتوي أيضا على روابط إضافية.",
      "projectsViewTip":"استخدام عناصر التحكم المنزلق من خلال النقر على قائمة المشاريع. مرر مؤشر الماوس فوق شريحة معينة للوصول إلى روابط المشروع. اضغط على شريحة معينة لعرض مزيد من المعلومات (على الهاتف المحمول)",
      "r3playInfo": "الواجهة الأمامية لواجهة برمجة تطبيقات الويب آر 3 بلاي التي تتيح للمستخدمين التسجيل وإلغاء التسجيل وعرض معلومات حول الأفلام والمسلسلات التلفزيونية والأنيمي وإدارة قائمة المفضلة لديهم.",
      "r3playAPIInfo": "أبي ويب وضعت مع عقدة.شبيبة ، اكسبرس ، ومونغودب ، مما يسمح للمستخدمين لتسجيل ، إلغاء تسجيل ، عرض معلومات حول الأفلام والمسلسلات التلفزيونية ، وأنيمي ، وإدارة المفضلة.",
      "myFlixInfo": "جزء أمامي لواجهة برمجة تطبيقات الويب آر 3 بلاي المصممة بواجهة مستخدم زاوي ، وطبعي ، ومادي تسمح للمستخدمين بالتسجيل وعرض معلومات حول الأفلام وإضافة المفضلة.",
      "meetInfo": "تطبيق ويب تقدمية مكتوبة مع وظائف أوس لامدا التي توظف أوث 2 التفويض والمصادقة ويعرض الأحداث من كاريرفوندري جوجل التقويم أبي.",
      "owriteInfo": "رد فعل التطبيق الأصلي الذي يسمح للمستخدمين للدردشة. يمكن للمستخدمين تعيين اسم مستخدم واختيار لون خلفية الدردشة وإرسال الرسائل النصية والصور والتسجيلات الصوتية.",
      "pokemonInfo": "تطبيق بوكيمون سريع الاستجابة يجلب بوكيمون مع أجاكس من واجهة برمجة تطبيقات بوكيدكس خارجية ويعرض معلوماتهم مثل ارتفاع البوكيمون والوزن والمعرف والصور الأمامية والخلفية",
      "toDoInfo": "ومسج والتمهيد لتأليف التطبيق الذي يسمح للمستخدمين لإدارة لدوس. يمكن للمستخدمين إضافة المهام وحذفها وإعادة ترتيبها وإنشاء قوائم المهام وحذفها والاطلاع على دليل حول كيفية استخدام التطبيق.",
      
      
      
      "r3playInfoTitle":"انقر لقراءة المزيد عن واجهة برمجة تطبيقات إعادة التشغيل",
    "r3playInfoTitleAPIDeployed":"انقر لفتح واجهة برمجة تطبيقات إعادة التشغيل",
    "r3playInfoTitleGithub":"انقر لفتح مستودع إعادة تشغيل واجهة برمجة التطبيقات جيثب",
    "myFlixInfoTitle":"انقر لقراءة المزيد عن تطبيق ماي فليكس",
    "myFlixInfoTitleGithub":"انقر لفتح مستودع جيثب لتطبيق ميفليكس",
    "myFlixInfoTitleKanban":"انقر لفتح لوحة كانبان لمشروع تطبيق ميفليكس",
    "meetInfoTitle":"انقر لقراءة المزيد عن التطبيق لقاء",
    "meetInfoTitleDeployed":"انقر لفتح تطبيق لقاء",
    "meetInfoTitleGithub":"انقر لفتح التطبيق لقاء جيثب مستودع",
    "owriteInfoTitle":"انقر لقراءة المزيد عن تطبيق الكتابة",
    "owriteInfoTitleGithub":"انقر لفتح التطبيق الكتابة جيثب مستودع",
    "pokemonInfoTitle":"انقر لقراءة المزيد عن التطبيق بوكيمون",
    "pokemonInfoTitleDeployed":"انقر لفتح تطبيق بوكيمون",
    "pokemonInfoTitleGithub":"انقر لفتح التطبيق بوكيمون جيثب مستودع",
    "toDoInfoTitle":"انقر لقراءة المزيد حول تطبيق قائمة المهام",
    "toDoInfoTitleDeployed":"انقر لفتح تطبيق قائمة المهام",
    "toDoInfoTitleGithub":"انقر لفتح مستودع جيثب في قائمة التطبيقات",
    "portfolioInfoTitle":"انقر لقراءة المزيد عن تطبيق المحفظة",
    "portfolioInfoTitleDeployed":"انقر لفتح تطبيق المحفظة",
    "portfolioInfoTitleGithub":"انقر لفتح محفظة التطبيق جيثب مستودع",
    "testimonialSliderMore":"انقر لعرض النص الكامل للمراجعة",

      
      "portfolioInfo":"تطبيق ويب استجابة وضعت مع رد فعل ، رد فعل التمهيد والاعتبارات إمكانية الوصول ، مما يسمح للمستخدمين لعرض معلومات حول مشاريعي ، وما إلى ذلك.",
      "projectsSliderMore": "المزيد",
      "testimonials": "التعليقات",
      "wordOfMouth": "لن أكون حيث أنا اليوم بدون كل الأشخاص الرائعين الذين كان لي شرف العمل معهم.",
      "testimonialsViewTip":"استخدام عناصر التحكم المنزلق من خلال النقر على قائمة الشهادات. مرر مؤشر الماوس فوق عناوين الشهادات لقراءة المزيد. اضغط على شهادة محددة لعرض معلومات إضافية (على الهاتف المحمول)",
      "testimonial1": "Maya Septriana, مستشار مهني, مؤسسة مهنية",
      "testimonial2": "Nizar Triki, مدير هندسة البرمجيات شي إكسبينسيا",
      "testimonial3": "Dejan Gogov, مطور ويب, Wild Code School",
      "testimonial1Text": "يفهيني هو شخص يسهل التعاون معه. يسعى دائما للتميز. في كل مرة أعطيه ردود الفعل انه سيكون على استعداد للاستماع وضبط تقديم...",
      "testimonial2Text": "لقد أتيحت لي الفرصة لتوجيه يفهيني طوال تدريبه على تطوير الويب في مؤسسة كاريرفو فاوندري. الاكتفاء الذاتي يفهيني ، فهم سريع للمفاهيم...",
      "testimonial3Text":" خلال معسكرنا التدريبي الكامل لمدة 6 أشهر ، أظهر يفهيني باستمرار سلوكا إيجابيا ووديا. اقترب من المهام بعزم...",
      "testimonialsMore": "أكثر",
      "contact": "جهة الاتصال",
      "suggestion": "هل تريد العمل معا أو لديك اقتراح? أنا منفتح على فرص التوظيف والتعليقات",
      "eMailMe": "لا تتردد في مراسلتي عبر البريد الإلكتروني باستخدام النموذج أدناه",
      "contactFormHeader": "الاتصال",
      "firstName": "الاسم الأول",
      "firstNamePlaceholder":"جوي",
      "lastName": "اسم العائلة",
      "lastNamePlaceholder": "تريبياني",
      "phoneNumber": "رقم الهاتف",
      "phoneNumberPlaceholder":"+49 1234 5678910",
      "eMail":"البريد الإلكتروني",
      "eMailPlaceholder":"example@mail.com",
      "messageOrComment": "رسالة أو تعليق. من فضلك كن لطيفا!",
      "messageOrCommentPlaceholder": "رسالتك",
      "contactFormTip": "الحقول التي تحمل علامة النجمة مطلوبة",
      "contactFormPoweredBy": "مدعوم من",
   


    "caseWorkflow":"سير العمل",
    "caseUpgrade":"ترقية",
    "caseDatabase":"قاعدة البيانات",
    "caseApi": "أبي",
    "caseInterface":"واجهة التطبيق",
    "caseTDD": "التنمية يحركها الاختبار",
    "caseServerAndApi": "جانب الخادم و أبي",
    "caseAgile": "سير عمل رشيق",
    "caseOverview": "نظرة عامة",
    "casePurpose": "الغرض والسياق",
    "caseObjective":"الهدف",
    "caseServer": "من جانب الخادم",
    "caseClient": "جانب العميل",
    "caseApproach":"النهج",
    "caseDuration":"المدة",
    "caseRetrospective": "بأثر رجعي",
    "caseChallenges": "التحديات.",
    "caseConclusion": "الاستنتاج والوجبات الرئيسية",
    "caseMainTakeaways": "الوجبات الرئيسية للمشاريع المستقبلية",
    "apiPreview":"أبي معاينة",
    "appPreview":"معاينة التطبيق",
    "caseTechnologies": "التقنيات المستخدمة / المهارات",
    "caseCredits":"الاعتمادات",
    "r3playCaseHeading": "R3Play App دراسة حالة",
    "r3playCaseIntroduction": "آر 3 بلاي هو تطبيق ويب ، تم تطويره باستخدام مكدس ميرن ، يوفر للمستخدمين معلومات حول الأفلام والمسلسلات التلفزيونية والأنيمي. يمكن للمستخدمين الوصول إلى معلومات حول الأفلام والمخرجين والأنواع. يمكن للمستخدمين إنشاء حساب وتحديث معلوماتهم وإنشاء قائمة بالأفلام والمسلسلات التلفزيونية والأنيمي المفضلة.",
    "r3playCaseRequired": "كان ر3بلاي مشروعا مطلوبا قمت بتطويره كجزء من دورة الغمر الكاملة في كاريرفو فاوندري لإثبات إتقاني لتطوير الويب الكامل باستخدام جافا سكريبت.",
    "r3playCaseAim": "يهدف المشروع إلى تطوير تطبيق كامل المكدس يعمل بكامل طاقته ويمكنني إضافته إلى محفظتي المهنية. كانت المشكلة التي أردت حلها هي إنشاء تطبيق ويب كامل المكدس من خلال توصيل جانب الخادم المصمم مسبقا وجانب العميل للتطبيق من البداية.",
    "r3playCaseAboutServer": "أنا وضعت أبي ريستفول باستخدام عقدة.جس و إكسبريس ، الذي يتفاعل مع قاعدة بيانات غير العلائقية (مونغودب). أبي توظف أساليب هتب المشتركة مثل جيت ، بوت ، بوست ، وحذف. لاسترداد البيانات من البيانات وتخزينها في قاعدة البيانات ، يتم استخدام طرق الخام. توفر واجهة برمجة التطبيقات معلومات عن الأفلام والمسلسلات التلفزيونية والأنيمي بتنسيق جسون.",
    "caseViewEndpoints": "عرض نقاط النهاية",
    "r3playCasePostman": "لقد استخدمت ساعي البريد لاختبار الردود والطلبات إلى أبي. كما أنني استخدمت مصادقة هتب الأساسية ومصادقة جوت لتوفير ميزات المصادقة والترخيص.",
    "r3playCaseAboutClient": "بعد الانتهاء من مشروع أبي ، شرعت في بناء واجهة الواجهة الأمامية التي يحتاجها المستخدمون عند التفاعل مع المنطق والبيانات من أبي وقاعدة البيانات. وهو صفحة واحدة ، وتطبيق ويب استجابة ، وضعت مع رد فعل ورد فعل مسترجع. يعرض العديد من طرق عرض الواجهة ، بما في ذلك (على سبيل المثال لا الحصر) طريقة عرض رئيسية (تعرض قائمة بجميع الأفلام والمسلسلات التلفزيونية والأنيمي) ، وفيلم واحد ، ومسلسلات تلفزيونية ، ومشاهد أنيمي (تعرض بيانات حول فيلم واحد ، ومسلسلات تلفزيونية ، وأنيمي ، ويسمح للمستخدمين بإضافتها أو حذفها من أو إلى قائمة المفضلة لديهم) ، وعرض تسجيل الدخول ، وعرض التسجيل وعرض الملف الشخصي (حيث يمكن للمستخدمين تحديث بيانات المستخدم وقائمة المفضلة).",
    "caseSliderTip": "استخدم عناصر التحكم في شريط التمرير للنقر فوق قائمة المشاريع. مرر مؤشر الماوس فوق عناوين الشرائح لقراءة المزيد. اضغط على شريحة معينة لعرض معلومات إضافية(على الهاتف المحمول)",
    "r3playCaseDurationData": "12 أسبوعا في المجموع (الخلفية: 7 أسابيع ، الواجهة: 5 أسابيع)",
    "r3playCaseConclusionData": "كان تطبيق الفيلم هو ثاني تطبيق ويب كامل قمت بتطويره في دورة تطوير الويب الكاملة. عندما تم الانتهاء من ذلك ، ركزت على تعزيز مهاراتي التنموية ، وتحديدا نهج التطوير القائم على الاختبار. يتطلب تنفيذ مرحلة الاختبار قبل إضافة المنطق الوظيفي الفعلي ، مما يسمح بتطوير أكثر أمانا وخالية من الأخطاء وأسرع.",




    
  
    



    "portfolioCaseHeading":"دراسة حالة تطبيق المحفظة",
"portfolioCaseIntroduction": "محفظة التطبيق هو تطبيق ويب استجابة ، وضعت باستخدام رد فعل ورد فعل التمهيد ، التي توفر للمستخدمين معلومات حول مشاريعي الحالية ، والشهادات ، والاتصال ، والمعلومات المنصات الاجتماعية ، ومترجمة إلى عدة لغات أجنبية. يمكن للمستخدمين الوصول إلى المعلومات في طرق عرض منفصلة ، وترجمة التطبيق إلى لغتهم المفضلة ، وتبديل النمط إلى سمة فاتحة أو داكنة. ",
"portfolioCaseRequired": "محفظة التطبيق كان المشروع المطلوب أنا وضعت كجزء من بلدي \" مقدمة إلى دورة تطوير الويب\" في كاريرفوندري لإثبات إتقاني من هتمل ، كس ، ونشر الموقع. بالإضافة إلى ذلك ، أتقنت ممارسات تطوير الويب على نطاق واسع مثل اختبار التطبيق ، وتقليل كس ، وإمكانية الوصول ، ودعم المتصفحات القديمة ، والرسوم المتحركة كس.",
"portfolioCaseAim": "يهدف المشروع إلى تطوير ونشر موقع ثابت يعمل بكامل طاقته ويمكنني استخدامه كمحفظة مهنية. كانت المشكلة التي أردت حلها هي استخدام الأدوات التي تمت تغطيتها في \" مقدمة إلى دورة تطوير الويب\"في كاريرفو فاوندري لبناء ونشر واجهة عمل يمكن استخدامها كمحفظة مهنية.",
"portfolioCaseAboutWorkflow": "في المراحل الأولى من عملية التنمية ، أنا منظم المحتوى مع هتمل ثم نصب الصفحات مع كس عادي. تماما.ساعد شبيبة المساعد لهيكلة وأسلوب الموقع وفقا للمبادئ التوجيهية على شبكة الإنترنت إمكانية الوصول الموصى بها. توجد هذه الإرشادات لمساعدة الأشخاص الذين يعانون من قيود جسدية أو غيرها للحصول على تجربة مستخدم أفضل على الإنترنت. تم استخدام علامات الأغنية الخاصة لهذه الأغراض بالإضافة إلى الأوصاف الإعلامية وبيانات النص البديلة. في المراحل النهائية من المشروع ، اختبرت موقع الويب للعمل المناسب على أنظمة التشغيل والمتصفحات المختلفة ، بما في ذلك استخدام جافا سكريبت الاحتياطي لدعم متصفح إنترنت إكسبلورر الأقدم.",
"portfolioCaseAboutUpgrade1": "بعد الانتهاء من حياتي المهنية مسبك \" كامل كومة برنامج تطوير الشبكة\"وأثناء الدراسة في\"دورة إعداد الوظيفة\" المهنية ، قررت تغيير التطبيق بطرق مختلفة. أولا ، حصل الموقع على صفحات جديدة تحتوي على بيانات حالة المشاريع ، حيث وصفت بالتفصيل كيف عملت في كل مشروع أثناء الدراسة في مؤسسة كاريرفو فاوندري. ثانيا, لقد قمت بتحديث التصميم ليكون أكثر إرضاء بصريا, وظيفي, والجمالية. ومع ذلك ، نظرا لأن مواقع الويب الثابتة أصبحت قديمة أكثر فأكثر في الوقت الحاضر ، فقد حان الوقت لترحيل أعمالي إلى إحدى مكتبات جافا سكريبت المستخدمة على نطاق واسع من قبل مجتمع المطورين. كما, بعد الانتهاء من عدة مشاريع في البرنامجين مع رد فعل.شبيبة ، ويجري الأكثر خبرة معها ، قررت استخدامه كهيكل عظمي مشروعي.",
"portfolioCaseAboutUpgrade2": "أنا تهيئة العمل مع إنشاء رد فعل التطبيق الأمر ، ثم انتقل وإعادة كتابة جميع ملفات هتمل و كس لفصل مكونات وظيفة ، وتثبيت تبعيات المشروع اللازمة. حصلت المشاريع والشهادات والحالات على منزلقات منفصلة مع أمثلة ومقاطع فيديو. في وقت لاحق ، قمت بترجمة التطبيق إلى عدة لغات أجنبية ، وقدمت سمة داكنة ، وقمت بتحديث التطبيق لحفظ تفضيلات لغة المستخدم والموضوع. وأخيرا ، حولت أعمالي إلى تطبيق ويب تقدمي. مع هذه الميزة ، يمكن للمستخدمين تثبيت التطبيق على سطح المكتب والأجهزة النقالة ، ومحاكاة تجربة التطبيق الأصلي مثل على منصات الروبوت أو ويندوز.",
"caseTotally": "رابط ل Totally.js",
"portfolioCaseAboutClient": "لقد قمت ببناء الواجهة الأمامية لتزويد المستخدمين بإمكانية التفاعل مع البيانات المتعلقة بمحفظة الأعمال المهنية الخاصة بي. كان في الأصل موقع ثابت ، وضعت باستخدام هتمل عادي ، كس ، وتماما.شبيبة ، البرنامج المساعد جافا سكريبت لاختبار إمكانية الوصول. وكان صفحات هتمل منفصلة عن الرئيسية والمشاريع والاتصال ، وغيرها من المعلومات.",
"portfolioCaseDurationData": "2 أسابيع في المجموع للمشروع الأولي. 3-6 أشهر في المجموع للنتيجة الحالية",
"portfolioCaseConclusionData": "كان موقع المحفظة هو المشروع الأول في معسكر تطوير الويب الخاص بالمسبك الوظيفي. عندما تم الانتهاء من ذلك ، بدأت \"كامل كومة الغمر بالطبع\" مع العمل على التطبيق بوكيمون.",
"portfolioCaseConclusionData2": "لقد كانت تجربة رائعة ومجزية لتصميم وتصحيح التطبيق في حالته الأولية حتى أحدث التحسينات التي لديه. أضفت أيضا مهارات جديدة ومبنية على المهارات القديمة (بما في ذلك عند العمل بمفردي) ، مثل تلميع النسخة ، وتصحيح نشر تطبيقات التفاعل ، واستخدام مكتبات الترجمة ، وإدخال وتخصيص السمات ، والعمل مع التخزين المحلي ، وممارسات التصميم الأفضل ، وغيرها.",
"portfolioCaseChallenge": "كان تطوير المشروع الأولي سهلا نسبيا وخاليا من الأخطاء حيث كان لدي بالفعل خبرة في التقنيات المطلوبة لذلك. في الحقيقة, تمكنت من إكماله 1 قبل أسبوع من الموعد النهائي المطلوب وعرضت تقديماتي كمثال للطلاب الآخرين.",
"portfolioCaseChallenge2": "ومع ذلك ، مع انتقالي إلى التقنيات الأكثر تعقيدا وما وراء متطلبات المشروع بمفردي ، واجهت العديد من المشكلات. كانت إحدى المشكلات هي أنني لم أتمكن من تقديم المظهر الداكن بالكامل إلى التطبيق. عندما قمت بتشغيل السمة الداكنة ، غير جزء فقط من التطبيق أسلوبه. واحد آخر يتعلق بصعوبات النشر والتفاعل الإعدادات المطلوبة لذلك. لحسن الحظ ، ساعدتني المعرفة المكتسبة خلال المعسكر التدريبي في حل هذه العقبات وتمكنت من:",
"portfolioCaseChallengeDetail1": "استخدم مهاراتي في البحث واستكشاف الأخطاء وإصلاحها لإصلاح المشكلات المتعلقة بالموضوع المظلم",
"portfolioCaseChallengeDetail2": "البحث واستكشاف المشكلات المتعلقة بالنشر وإصلاحها",
"portfolioMainTakeaway1": "المثابرة مهارة مهمة في تطوير الويب ، فضلا عن اختيار التسوية وتحديد الأولويات",
"portfolioMainTakeaway2": "في بعض الأحيان قد يحدث خطأ بشكل غير متوقع ويحتاج الحل إلى اهتمام أفضل بالتفاصيل",
"portfolioMainTakeaway3": "هناك دائما مساحة للتحسين في مشاريعك ، لذلك من الأهمية بمكان فهم اللحظة التي يجب فيها المضي قدما و/أو تحديد الأولويات",
"portfolioMainTakeaway4": "رمز (بسرعة) يصبح عفا عليها الزمن أو يحتاج إلى تحديث ، لذلك التدقيق في المشاريع القديمة الخاصة بك من وقت لآخر هو فكرة جيدة ",

"portfolioSlide1Heading": "حول عرض (موضوع الضوء)",
"portfolioSlide2Heading": "حول عرض (موضوع الظلام)",
"portfolioSlide3Heading": "عرض حالة المشروع المترجمة",
"portfolioSlide1Description": "التطبيق محفظة حول عرض حيث يمكن للمستخدمين قراءة المزيد عن المؤلف ، والوصول إلى مصدر برنامج ، ويستأنف (عرض في موضوع الضوء)",
"portfolioSlide2Description": "التطبيق محفظة حول عرض حيث يمكن للمستخدمين قراءة المزيد عن المؤلف ، والوصول إلى مصدر برنامج ، ويستأنف (عرض في موضوع الظلام)",
"portfolioSlide3Description":" واحدة من الحالات عرض المشاريع التي يتم ترجمتها (إلى اللغة الألمانية في هذا المثال)",

    

"myFlixCaseHeading":"MyFlix App دراسة حالة",
"myFlixCaseIntroduction": "ميفليكس-الزاوي-التطبيق هو التطبيق على شبكة الإنترنت ، وضعت باستخدام كومة يعني ، التي توفر للمستخدمين معلومات عن الأفلام. يمكن للمستخدمين الوصول إلى معلومات حول الأفلام والمخرجين والأنواع. يمكن للمستخدمين إنشاء حساب وتحديث معلوماتهم وإنشاء قائمة بالأفلام المفضلة.",
    "myFlixCaseRequired": "كان ميفليكس-الزاوي التطبيق مشروع مطلوب أنا وضعت كجزء من بلدي كامل كومة دورة الغمر في كاريرفوندري لإثبات إتقاني من تطوير الويب كومة كاملة باستخدام جافا سكريبت. بالإضافة إلى ذلك ، مارست إدارة المشاريع الرشيقة ، وتقديم الملاحظات ، ومهارات إنشاء الوثائق.",
    "myFlixCaseAboutServer": "أنا وضعت أبي ريستفول باستخدام عقدة.شبيبة والتعبير الذي يتفاعل مع قاعدة بيانات غير العلائقية (مونغودب). أبي توظف أساليب هتب المشتركة مثل جيت ، بوت ، بوست ، وحذف. لاسترداد البيانات من البيانات وتخزينها في قاعدة البيانات ، يتم استخدام طرق الخام. توفر واجهة برمجة التطبيقات معلومات عن الأفلام والمسلسلات التلفزيونية والأنيمي بتنسيق جسون.",
    "myFlixCasePostman": "لقد استخدمت ساعي البريد لاختبار الردود والطلبات إلى أبي. كما أنني استخدمت مصادقة هتب الأساسية ومصادقة جوت لتوفير ميزات المصادقة والترخيص.",
    "myFlixCaseAgileData": "بدأ العمل في المشروع مع إنشاء مجلس كانبان وملئه مع متطلبات المشروع وقصص المستخدم. عند اكتمال مهمة المشروع ، تم نقلها إلى قسم \"تم\". كذلك ، أنا ولدت وثائق مفصلة مع تيبيدوك وفقا لمتطلبات المشروع.",
    "myFlixCaseAim": "يهدف المشروع إلى تطوير تطبيق كامل المكدس يعمل بكامل طاقته ويمكنني إضافته إلى محفظتي المهنية. كانت المشكلة التي أردت حلها هي إنشاء تطبيق ويب كامل المكدس من خلال توصيل جانب الخادم المصمم مسبقا وجانب العميل للتطبيق من البداية.",
    "myFlixCaseConclusion": "كان تطبيق ميفليكس آخر تطبيق ويب كامل طورته في دورة تطوير الويب كاملة المكدس. عندما تم الانتهاء من ذلك ، شرعت في تعزيز أعمالي.",
    "myFlixCaseAboutClient": "لقد بنيت واجهة الواجهة الأمامية للمستخدمين لتكون قادرة على التفاعل مع المنطق والبيانات من أبي وقاعدة البيانات. إنه تطبيق ويب سريع الاستجابة من صفحة واحدة ، تم تطويره باستخدام واجهة المستخدم الزاوية والمادية. يعرض العديد من طرق عرض الواجهة ، بما في ذلك طريقة العرض الرئيسية (تعرض قائمة بجميع الأفلام ، وزرا لإدارة المفضلة ، وأزرار لعرض معلومات الفيلم الإضافية) ، وعرض تسجيل الدخول/الاشتراك ، وعرض الملف الشخصي (حيث يمكن للمستخدمين تحديث بيانات المستخدم الخاصة بهم).",
    "myFlixCaseConclusionData": "كان التطبيق ميفليكس آخر تطبيق ويب كامل أنا وضعت في دورة تطوير الويب كومة كاملة. عندما تم الانتهاء من ذلك ، شرعت في تعزيز أعمالي.",
    "myFlixCaseConclusionData2": "الصعوبات التي واجهتها حدثت في نهاية المشروع وترتبط أكثر بخصائص الزاوي وجيثب. حدثت مشكلة واحدة عندما رفضت صفحات جيثب نشر التطبيق لفترة طويلة. حدث الآخر عندما لم يتم عرض التغييرات المحلية على مصدر البرنامج في التطبيق المنشور. لاستكشاف هذا ، وصلت إلى معلمي والمعلم ، وخلال جلسة البرمجة الزوج ، تمكنا من إصلاح المشاكل.",
    "myFlixCaseConclusionData3": "كان أيضا تجربة مفيدة في التصحيح واستكشاف الأخطاء وإصلاحها ، وذلك باستخدام أوامر محطة جيت ، تفاصيل العمل مع الزاوي ، وجلسات البرمجة الزوج. أضفت أيضا مهارات جديدة إلى ترسانتي ، مثل الكتابة المطبوعة ، والزاوية ، وواجهة المستخدم المادية ، والتعليق الصحيح على الكود ، والتعاون ، وغيرها.",
    "myFlixCaseDurationData": "ما يقرب من 1.5 أسابيع (10 أيام)",
    "myFlixCaseChallenge": "استغرق تطوير تطبيق ميفليكس وقتا وجهدا أقل بكثير مقارنة بتطبيق آر 3 بلاي رد منذ:",
    "myFlixCaseChallengeDetail1":"وقد تم بالفعل بناء أبي",
    "myFlixCaseChallengeDetail2": "الممارسة الواسعة مع رد فعل ساعد على التقدم بشكل أسرع",
    "myFlixCaseChallengeDetail3": "لم أكن إضافة العديد من الميزات الإضافية والتمسك بمتطلبات الدورة الأساسية",
    "myFlixCaseChallengeDetail4": "الوقت المتبقي في البرنامج كان محدودا بالفعل",
    "myFlixMainTakeaway1": "تحسين وظائف التطبيق لتعكس ميزات تطبيق آر 3 بلاي",
    "myFlixMainTakeaway2": "بحث المزيد عن تيبسكريبت",
    "myFlixMainTakeaway3": "قراءة المزيد عن واجهة المستخدم المادية",
    "myFlixMainTakeaway4": "مواصلة استكشاف التقنيات الأخرى وأفضل الممارسات في تطوير الويب",
    
    
    
    "meetCaseHeading": "Meet App دراسة حالة",
    "meetCaseIntroduction": "تلبية التطبيق هو تطبيق ويب تقدمية استجابة ، وضعت باستخدام نهج التنمية يحركها الاختبار باستخدام وظائف أوس سيرفرليس لامدا ، أوث 2 جوجل المصادقة والترخيص الشاشة ، ومكتبة ريشارتس للسماح للمستخدمين لعرض الأحداث أبي تقويم جوجل. يمكن للمستخدمين مصادقة مع جوجل ، وتحديد المدينة وعدد من الأحداث لعرض الأحداث ، وقراءة المزيد عنها. يمكن تثبيت التطبيق على سطح المكتب / بفضل المحمول لتوصيات سلطة المياه الفلسطينية ، وتستخدم على حد سواء على الانترنت وغير متصل ، ويظهر الإخطارات عندما يتم إدخال بيانات غير صحيحة و/أو يتم فقدان الاتصال بالإنترنت.",
    "meetCaseRequired": "كان لقاء التطبيق مشروع مطلوب أنا وضعت كجزء من بلدي كامل كومة دورة الغمر في كاريرفوندري لإثبات إتقاني من مهارات تطوير الويب كومة كاملة يحركها الاختبار باستخدام جافا سكريبت والتقنيات بدون خادم.",
    "meetCaseAboutTDD": "أنا وضعت التطبيق عن طريق كتابة قصص المستخدم أولا. بمساعدة نهج التطوير القائم على الاختبار ، قمت بدمج الوحدة والتكامل وقبول المستخدم وطرق الاختبار من طرف إلى طرف لكتابة الاختبارات المطلوبة قبل تنفيذ الكود.",
    "meetCaseAboutServerAndApi": "أنا وضعت جانب الخادم باستخدام وظائف أوس سيرفرليس لامدا كشرط للمشروع. يسمح استخدام الخادم بتقليل العمل الإضافي لإدارة الخادم ويجعل قابلية التوسع أسهل. بالنسبة لبيانات أحداث التطبيق ، تم استخدام تقويم جوجل الوظيفي. تم إعداد شاشة مصادقة غوغل أوث 2 لمصادقة المستخدمين وتفويض المستخدمين إلى التطبيق. في المراحل النهائية من التطوير ، استفادت من عامل خدمة رد الفعل لتحويل التطبيق إلى تطبيق ويب تقدمي. مكتبة يعيد شحن يسمح التصور من بيانات الحدث في شكل نوعين من الرسوم البيانية (مبعثر وفطيرة).",
    "meetCaseAim": "يهدف المشروع إلى تطوير تطبيق مكدس كامل يعمل بكامل طاقته ويمكنني إضافته إلى محفظتي المهنية. كانت المشكلة التي أردت حلها هي بناء تطبيق ويب كامل كومة كاملة من خلال توظيف نهج التنمية يحركها الاختبار باستخدام وظائف أوس سيرفرليس لامدا ، رد فعل.شبيبة, ومتطلبات تطبيق الويب التقدمية.",
    "meetCaseAboutClient": "بالنسبة للجزء المرئي ، تم تصميم الواجهة الأمامية بشكل مستجيب مع كس العادية و جسك.",
    "meetCaseConclusionData": "كان التطبيق لقاء واحدة من المشاريع الأخيرة في دورة تطوير الشبكة كومة كاملة. عندما تم الانتهاء من ذلك ، ركزت على تعزيز مهاراتي تطوير رد فعل ، وتحديدا من خلال الغوص في موضوع جديد - تطوير التطبيق الأصلي مع رد فعل الأصلي والروبوت ستوديو.",
    "meetCaseDurationData":" تقريبا 1 شهر (28 يوما)",
    "meetCaseChallenge1": "كان التحدي الأكبر بالنسبة لي في هذا المشروع هو نهج التطوير القائم على الاختبار نفسه. بعد كتابة التعليمات البرمجية في نمط يحركها السلوك من قبل ، واضطررت لقضاء بعض الوقت التعود على الطريقة الجديدة. ومع ذلك ، فإن العمل على التطبيق سار بشكل جيد واعتدت على الموضوع الجديد بسرعة. كانت إحدى المشكلات أثناء العمل في المشروع هي عدم قدرة المستخدمين على المصادقة على التطبيق. بعد الوصول إلى معلمي ، قمت بحل المشكلة عن طريق إضافة مستخدمي الاختبار يدويا من خلال وحدة تحكم مطوري غوغل.",
    "meetCaseChallenge2":" بعد استكشاف أخطاء تثبيت التطبيق وإصلاحها على هاتف ذكي ، نجحت في تحويله إلى تطبيق ويب تقدمي. لقد استمتعت أيضا بالعمل مع إشعارات المستخدم ومكتبة إعادة الشحن. أنا أيضا تحسين معرفتي ومهاراتي من نهج تد وإعداد حسابات أوس وجوجل المطور ، فضلا عن تأكيد ملكية المجال.",
    "meetMainTakeaway1": "ممارسة نهج تد على المشاريع الجانبية",
    "meetMainTakeaway2": "اكتشف المزيد حول تصور البيانات",
    


    "owriteCaseHeading": "Owrite App دراسة حالة",
    "owriteCaseIntroduction": "أوريتي هو رد فعل الأصلي في الوقت الحقيقي تطبيق الدردشة ، وضعت باستخدام رد فعل الأصلي ، المعرض كلي ، المبادئ التوجيهية للمعاقين ، والروبوت ستوديو للتطبيق نفسه ، وجوجل فيريباس و فايرستور لقاعدة البيانات. يوفر للمستخدمين ميزات الدردشة في الوقت الفعلي ، بما في ذلك عرض محفوظات الرسائل بفضل التخزين المتزامن وإرسال الرسائل والصور والتسجيلات الصوتية وبيانات الموقع الجغرافي. يمكن للمستخدمين تعيين اسم المستخدم الخاص بهم واختيار لون خلفية التطبيق.",
    "owriteCaseRequired": "كان أوريت مشروع مطلوب أنا وضعت كجزء من بلدي كامل كومة دورة الغمر في كاريرفوندري لإثبات بلدي إتقان تطوير التطبيق الأصلي باستخدام رد فعل الأصلي ، المعرض كلي ، الروبوت ستوديو ، وجوجل فيريباس/فايرستور.",
    "owriteCaseAim": "يهدف المشروع إلى تطوير تطبيق أصلي يعمل بكامل طاقته ويمكنني إضافته إلى محفظتي المهنية. كانت المشكلة أردت أن تحل لبناء التطبيق الأصلي الكامل من خلال ربط قاعدة بيانات جوجل فيريباس / فايرستور إلى واجهة التطبيق مصممة مع رد فعل الأصلي.",
    "owriteCaseAboutDatabase": "أنا وضعت قاعدة البيانات باستخدام غوغل فيريباس لتخزين اثنين من المستخدمين المطلوبة للاختبار. في وقت لاحق ، وظفت جوجل فايرستور لاحتواء بيانات الدردشة المستخدمين.",
    "owriteCaseAboutInterface":" للواجهة ، الروبوت ستوديو ومعرض الذهاب الروبوت التطبيق أدرجت لأغراض الاختبار. تم استخدام رد الفعل الأصلي لتصميم شاشتين للتطبيق: ترحيب وشاشة دردشة. تم تصميم شاشة الترحيب بعناصر يمكن الوصول إليها وفقا للتوصيات الأصلية للتفاعل ، وتسمح بتعيين اسم مستخدم واختيار لون الخلفية لشاشة الدردشة. تعرض شاشة الدردشة اسم المستخدم وسجل الرسائل وحقل النص وقائمة بها خيارات ملف إضافية. لتطوير الميزات المطلوبة ، قمت بدمج مكتبات مثل الدردشة الموهوبة ، ووسائط المعرض ، ومنتقي صور المعرض ، والتنقل المكدس ، وغيرها. للسماح للاستخدام دون اتصال ، تم استخدام أسينكستوراج.",
    "owriteCaseAboutServer": "إنشاء منطق الخادم بدأت مع إنشاء حساب في جوجل فيريباس وتكوينه. مضيت ثم لإضافة إعدادات التكوين فيريباس جوجل إلى كودباس.",
    "owriteCaseConclusionData": "كان التطبيق أوريت المشروع قبل الأخير عملت على في كامل كومة دورة تطوير الشبكة. عندما تم الانتهاء من ذلك ، ركزت على زيادة تعزيز مهارات التطوير الخاصة بي ، وتحديدا إضافة إطار أمامي آخر ونظام تصميم إلى مجموعة المهارات الخاصة بي ، وواجهة المستخدم الزاوية والمادية على التوالي. يتطلب المشروع التالي إعادة إنشاء الواجهة الأمامية لواجهة برمجة تطبيقات آر 3 بلاي مع واجهة المستخدم الزاوية والمادية هذه المرة.",
    "owriteCaseDurationData":" 1 أسبوع",
    "owriteCaseChallenge1": "كانت التحديات التي واجهتها خلال هذا المشروع أكثر ارتباطا بالجدول الزمني للدورة نفسها من العمل الفعلي على كودباس. كما ذكر سابقا ، منذ أن كرست جهدا إضافيا لتحسين أبي ر3 بلاي والتطبيق ، فإنه ترك وقتا أقل لنهاية دورة الغمر. نتيجة لذلك ، كان علي أن أخطط لجدولي الزمني لإنهاء المشروع في الوقت المحدد والتركيز فقط على الميزات المطلوبة والموصى بها.",
    "owriteCaseChallenge2": "لقد استمتعت بشكل خاص تطوير التطبيق لأنني كنت أريد دائما أن يغوص في تطوير التطبيق الأصلي ، وكان رد فعل الأصلي على بلدي المرجعية. بالإضافة إلى ذلك ، كان من دواعي سروري معرفة أن المهارات المكتسبة سابقا (إدارة الوقت وتحديد الأولويات) ساعدتني على إكمال المشروع بسرعة كبيرة وإضافة مهارات تطوير أصلية جديدة إلى صندوق الأدوات الخاص بي.",
    "owriteMainTakeaway1": "ممارسة إنشاء تطبيقات في الوقت الحقيقي على المشاريع الجانبية",
    "owriteMainTakeaway2": "اكتشف المزيد حول تطوير التطبيقات الأصلية",
    
    
    "pokedexLink":"رابط ل Pokedex",
    "pokemonCaseHeading":"Pokemon App دراسة حالة",
    "pokemonCaseIntroduction": "بوكيمون التطبيق هو تطبيق ويب ، وضعت باستخدام هتمل ، كس ، جافا سكريبت ، و بوتستراب. فإنه يوفر للمستخدمين معلومات حول بوكيمون جلب من أبي بوكيدكس. يمكن للمستخدمين الوصول إلى معلومات حول معرف البوكيمون والطول والوزن ، ومشاهدة صورة البوكيمون الأمامية والخلفية ، والبحث عن بوكيمون بالاسم.",
    "pokemonCaseRequired": "كان بوكيمون التطبيق مشروع مطلوب أنا وضعت كجزء من بلدي كامل كومة الغمر بالطبع في كاريرفوندري لإثبات بلدي إتقان تطوير الشبكة باستخدام جافا سكريبت و بوتستراب.",
    "pokemonCaseAim": "يهدف المشروع إلى تطوير تطبيق يعمل بشكل كامل يمكنني إضافته إلى محفظتي المهنية. كانت المشكلة التي أردت حلها هي بناء وتصميم تطبيق ويب من خلال استخدام واجهة برمجة تطبيقات خارجية وإطار عمل كس شائع.",
    "pokemonCaseAboutApi": "لقد استخدمت أبي بوكيدكس كجزء من التبعيات المطلوبة للمشروع لتزويد التطبيق مع مختلف المعلومات حول بوكيمون. لهذا الغرض ، تم استخدام وعود جافا سكريبت للتعامل مع الطلبات غير المتزامنة والردود على / من أبي بوكيدكس.",
    "pokemonCaseAboutClient":"بعد الانتهاء من الجزء المنطق من التطبيق ، بدأت مرحلة الأسلوب من خلال دمج بوتستراب كإطار كس المطلوب للمشروع. وكانت المهمة لاستخدام شبكة بوتستراب ، والطبقات ، والمكونات لتنفيذ الوظائف المطلوبة والاستجابة. أخيرا ، اختبرت التطبيق على شاشات وأجهزة وأنظمة تشغيل مختلفة باستخدام محاكيات الجهاز / النظام.",
    "pokemonCaseConclusionData": "كان تطبيق بوكيمون أول مشروع دورة غمر كامل المكدس. عندما تم الانتهاء من ذلك ، ركزت على تعزيز مهاراتي التنموية ، وتحديدا الغوص في العقدة.شبيبة ، اكسبرس ، واجهات برمجة التطبيقات. كان تصميم واجهة برمجة التطبيقات الخاصة بي خطوة مفيدة ومهمة لزيادة إتقان مهارات تطوير الويب الخلفية الحاسمة.",
    "pokemonCaseDurationData":" 4 أسابيع",
    "pokemonCaseChallenge1": "الجزء الذي يتطلب استخدام جافا سكريبت غير متزامن كان الأكثر استهلاكا للوقت ، في حين أن العمل على التصميم كان سهلا نسبيا. شاملة, استغرق الأمر مني 1 شهر لإكمال المشروع الذي كان حول متوسط الوقت الذي يقضيه. أولا ، واجهت صعوبات في عرض معلومات البوكيمون المحددة كما هو موضح في وثائق بوكيدكس. أيضا ، اضطررت إلى استكشاف المشكلة وإصلاحها عندما لا يتم عرض البيانات في الواجهة الأمامية.",
    "pokemonCaseChallenge2": "ومع ذلك ، كان هذا مشروعا ممتعا وسهلا نسبيا للعمل عليه. لقد استمتعت الغوص في أساسيات جافا سكريبت من خلال تعلم اياكس. كان أيضا محفزا لتعلم التصميم بمساعدة التمهيد. كما اكتسبت بسرعة مهارات مفيدة في العمل مع وعود جافا سكريبت وواجهات برمجة التطبيقات ، وقراءة الوثائق ، والتصميم مع أطر كس ، واستكشاف الأخطاء وإصلاحها. لحسن الحظ ، ساعدني معلمي ومعلمي أثناء المشروع وتمكنت من تطبيق المهارات المكتسبة لاحقا عند تنفيذ ميزات إضافية على التطبيق.",
    "pokemonMainTakeaway1": "تحسين مهارات التصحيح من خلال ممارسة واستخدام الموارد التعليمية الخارجية.",
    "pokemonMainTakeaway2": "ابق متحمسا حتى عند حدوث صعوبات تعليمية مؤقتة.",
    "pokemonMainTakeaway3": "تحسين الرعاية الذاتية الرقمية فيما يتعلق بوقت الراحة",
    
    
    
    
    "toDoCaseHeading": "To Do دراسة حالة",
    "toDoCaseIntroduction": "تأليف لائحة التطبيق هو تطبيق ويب استجابة ، وضعت باستخدام هتمل ، بوتستراب ، وجافا سكريبت ويوفر للمستخدمين القدرة على إدارة لدوس. يمكن للمستخدمين إضافة وحذف المهام الخاصة بهم من بين ميزات أخرى.",
    "toDoCaseRequired": "كان التطبيق تأليف لائحة مشروع صغير الجانب المطلوب أنا وضعت كجزء من بلدي كامل كومة دورة الغمر في كاريرفوندري لإثبات إتقاني للعمل مع مسج.",
    "toDoCaseAim": "يهدف المشروع إلى تصميم تطبيق ويب يعمل بكامل طاقته ويمكنني إضافته إلى محفظتي المهنية. كانت المشكلة التي أردت حلها هي تحويل جافا سكريبت عادي إلى مسج.",
    "toDoCaseAboutClient": "بعد تلقي شفرة جافا سكريبت عادي الأولي مع وظيفة التطبيق الأساسية ، بدأت تحويلها إلى مسج واحد. سمح لي هذا النوع من العمل بتقديم ميزات وأنماط إضافية.",
    "toDoCaseConclusionData": "كان التطبيق تأليف لائحة فقط مشروع صغير الجانب فعلت في دورة الغمر كومة كاملة ولكن استمتعت إضافة ميزات جديدة والتصميم إليها فوق المتطلبات الأساسية. وسرعان ما عززت مهاراتي في مسج ، التمهيد ، والتصحيح ، والعمل مع مكتبات إضافية.",
    "toDoCaseDurationData": "1 يوم للوظائف المطلوبة وحوالي 3 أسابيع لميزات إضافية",
    "toDoCaseChallenge1": "إن تطوير الميزات الأساسية للتطبيق لم يخلق أي صعوبات وانتهيت من المهمة في غضون 1 يوم. ومع ذلك ، لم أكن راضيا عن الوظيفة التي كانت تتمتع بها وقررت إيجاد وقت إضافي لإضافة تحسينات. تسببت هذه الإضافات الكثير من التصحيح لأن المكتبات مسج مختلفة لم تعمل بشكل جيد معا وكما خططت لهم. لحسن الحظ ، ساعدني معلمي ومعلمي في استكشاف أخطاء العمل وإصلاحها. قبل إدخال وظائف إضافية ، يمكن للتطبيق:",
    "toDoCaseChallenge2": "مع الميزات الجديدة ، فإنه يسمح ل:",
    "toDoMainTakeaway1": "تعزيز مهارات التمهيد",
    "toDoMainTakeaway2": "العمل على مهارات التصحيح",
    "toDoMainTakeaway3": "تمديد ميزات التطبيق في وقت لاحق",
    "toDoBeforeFeature1": "إضافة / حذف لدوس",
    "toDoBeforeFeature2": "إعادة ترتيب المهام على سطح المكتب",
    "toDoBeforeFeature3": "شطب إلى دوس",
    "toDoBeforeFeature4": "إظهار إشعارات تنبيه المتصفح المضمنة",
    "toDoAfterFeature1": "إضافة / حذف قوائم المهام",
    "toDoAfterFeature2": "إضافة / حذف المهام إلى / من قوائم المهام (بما في ذلك الضغط \"أدخل\" على لوحة المفاتيح)",
    "toDoAfterFeature3": "مسح حقل الإدخال",
    "toDoAfterFeature4": "إعادة ترتيب وشطب لدوس على الهاتف المحمول مع مساعدة من مسج موبايل ومسج اللمس لكمة",
    "toDoAfterFeature5": "إظهار الإخطارات أجمل مع مساعدة من التمهيد و مسج واجهة المستخدم",
    "toDoAfterFeature6": "عرض دليل على كيفية استخدام التطبيق على منصات مختلفة مع مساعدة من بوتستراب",

    
    
    "notFound": "لم نتمكن من العثور على المورد الذي كنت تبحث عنه.",
    "returnHomeParagraph": "ولكن يمكنك دائما العودة إلى الصفحة الرئيسية",
    "returnHomeLink": "العودة إلى المنزل",
    
    "copySkill": "تلميع النسخة",
    "terminalSkill": "العمل في المحطة",
    "accessibilitySkill": "إمكانية الوصول",
    "externalApiSkill": "أبي الخارجية",
    "nativeSkill":"تطوير التطبيق الأصلي",
    "troubleshootingSkill":"استكشاف الأخطاء وإصلاحها",
    "TDDSkill": "التنمية يحركها الاختبار",
    "kanbanSkill":"مجلس كانبان",
    "agileSkill":"سير العمل رشيقة",
    "documentationSkill":"الوثائق",
    "userStoriesSkill": "قصص المستخدم",
    "collabSkill":"التعاون",
    "feedbackSkill": "تقديم الملاحظات",
    "contributeSkill": "المساهمة",
    "testingSkill":"اختبار",
    "apiSkill":"جوجل التقويم أبي",
    "pwsSkill":"تطبيقات الويب التقدمية",
    "responsiveSkill": "التصميم المتجاوب",
    "deploySkill": "نشر موقع ويب",
    "caseLead": "الدور: المطور الرئيسي",
    "caseTutor": "Tonny Ntambaazi:",
    "caseTutor2": "المدير الإبداعي",
    "caseMentor": "Nizar Triki:",
    "caseMentor2": "مدير هندسة البرمجيات",
    "r3playMainTakeaway1": "التركيز على الوظيفة المطلوبة أولا",
    "r3playMainTakeaway2": "تعزيز مهارات إدارة الوقت",
    "r3playMainTakeaway3": "تعميق المعرفة بالتقنيات المستخدمة من خلال القراءة والممارسة أكثر",
    "r3playMainTakeaway4": "لا تشك في الوصول إلى المساعدة في حالة حدوث مشكلات فنية",
    "r3playCaseChallenge1": "كان تطوير الجانب الخلفي هو الأكثر استهلاكا للوقت ، في حين كان العمل على جانب العميل هو الأكثر تحديا من الناحية الفنية. نتيجة لذلك ، استغرق الأمر مني وقتا أطول لإكمال المكدس الكامل مقارنة بالمدة المعتادة لإنجازين مهنيين. والسبب في ذلك هو أنني ركزت على التحسينات الوظيفية والبصرية لكل من الإنجازات فوق المتطلبات الأساسية ، وتحتاج إلى مزيد من الوقت لاستكشاف العرض الشرطي لعناصر جسك ، وكيفية تنفيذ ريدوكس في رد فعل ، والمنطق الشرطي وراء تقديم اقتراحات الفيلم للمستخدم.",
    "r3playCaseChallenge2": "ومع ذلك ، كان هذا مشروعي المفضل. لقد استمتعت بتطوير واجهة المستخدم والعمل مع معلومات قاعدة البيانات. أنا أيضا بسرعة تعزيز مهاراتي الطرفية ، وفهم الاستعلام عن قاعدة بيانات مونغودب نوسقل ، وتقديم الشرطي ، وتصفية البيانات ، وتخصيص مكونات بوتستراب رد فعل ، فضلا عن إدارة الوقت ومهارات تحديد الأولويات. لحسن الحظ ، ساعدني معلمي ومعلمي المهرة أثناء المشروع وتمكنت من تطبيق المهارات المكتسبة لاحقا عند تنفيذ ميزات إضافية على التطبيق.",
    
    
    
    
    "r3playSlide1Heading": "عرض تسجيل الدخول",
    "r3playSlide2Heading": "عرض الفيلم",
    "r3playSlide3Heading": "عرض الملف الشخصي",
    "r3playSlide1Description": "عرض تسجيل الدخول إلى تطبيق آر 3 بلاي حيث يمكن للمستخدمين تسجيل الدخول إلى التطبيق",
    "r3playSlide2Description": "عرض فيلم تطبيق آر3 بلايزلايد الذي يعرض قائمة بالأفلام المتوفرة في التطبيق",
    "r3playSlide3Description": "عرض ملف تعريف تطبيق آر 3 بلاي حيث يمكن للمستخدمين تغيير معلومات حساباتهم",
    
    "myFlixSlide1Heading": "عرض تسجيل الدخول",
    "myFlixSlide2Heading": "عرض الفيلم",
    "myFlixSlide3Heading": "عرض الملف الشخصي",
    "myFlixSlide1Description": "عرض تسجيل الدخول إلى تطبيق ميفليكس حيث يمكن للمستخدمين تسجيل الدخول إلى التطبيق",
    "myFlixSlide2Description": "عرض فيلم تطبيق ميفليكس الذي يعرض قائمة بالأفلام المتوفرة في التطبيق",
    "myFlixSlide3Description": "عرض ملف تعريف تطبيق ميفليكس حيث يمكن للمستخدمين تغيير معلومات حساباتهم",


  

  "meetSlide1Heading": "واجهة عامة",
"meetSlide2Heading": "الأخطاء والتحذيرات",
"meetSlide3Heading":"تفاصيل الحدث",
"meetSlide1Description": "أحداث التطبيق لقاء تحميلها في التطبيق مع حقول النموذج مما يسمح لضبط النتائج",
"meetSlide2Description": "شاشة أحداث التطبيق لقاء أظهرت مع التحذيرات والأخطاء بسبب البيانات غير صحيحة دخلت",
"meetSlide3Description": "شاشة أحداث التطبيق لقاء مع بطاقة الأحداث الموسعة",


"owriteSlide1Heading":"شاشة الترحيب",
"owriteSlide2Heading":"شاشة الدردشة",
"owriteSlide1Description": "شاشة ترحيب أوريت التطبيق حيث يمكن للمستخدمين اختيار موضوع ودخول غرفة الدردشة",
"owriteSlide2Description": "شاشة الدردشة التطبيق أوريتي حيث يمكن للمستخدمين الدردشة ، بما في ذلك إرسال ملفات الصوت والصورة",


"pokemonSlide1Heading":"رسالة ترحيب",
"pokemonSlide2Heading":"نتائج بوكيمون",
"pokemonSlide3Heading": "بطاقة البوكيمون",
"pokemonSlide1Description": "الصفحة الرئيسية لتطبيق بوكيمون مع رسالة ترحيب",
"pokemonSlide2Description": "التطبيق بوكيمون تصفيتها نتائج البوكيمون عرض كقائمة",
"pokemonSlide3Description": "بطاقة البوكيمون مع البيانات التي يمكن للمستخدم رؤية عند النقر على اسم بوكيمون",


"toDoSlide1Heading": "العرض الأولي",
"toDoSlide2Heading":"قائمة جديدة",
"toDoSlide3Heading":"إعلام",
"toDoSlide1Description": "إن للقيام التطبيق العرض الأولي حيث عرض المستخدمين نصائح حول كيفية استخدام التطبيق وإضافة القائمة الأولى",
"toDoSlide2Description":"تمت إضافة قائمة جديدة من المهام",
"toDoSlide3Description": "عندما يترك المستخدم الإدخال فارغا ويحاول إضافة مهمة جديدة ، تظهر رسالة إعلام",



"cookieInfo1":"يستخدم هذا التطبيق ملفات تعريف الارتباط ويجمع بيانات الزوار. اقرأ المزيد عن السياسات ",
"cookieInfo2" : "",
"cookieInfo3": "", 
"cookieLink1": "سياسات ملفات تعريف الارتباط",
"cookieLink2": "سياسات الخصوصية",
"cookieConfirm":"أنا موافق",




"menu": {
"portfolioMenu":"التطبيق Portfolio",
"aboutMenu":"حول",
"projectsMenu":"مشاريع",
"casesMenu": "الحالات",
"testimonialsMenu":"الشهادات",
"contactMenu":"الاتصال",
"resumeMenu":"السيرة الذاتية",
"r3playMenu": "التطبيق R3play",
"myFlixMenu": "التطبيق MyFlix",
"meetMenu": "التطبيق Meet",
"owriteMenu": "التطبيق Owrite",
"pokemonMenu":"التطبيق Pokemon",
"toDoMenu": "التطبيق To Do",
"policiesMenu":"السياسات",
"cookies": "الكوكيز",
        "privacy": "الخصوصية"
},
"footer": {
"copy": "تنويه Yevhenii Airapetian, 2024. جميع الحقوق محفوظة.",
"impressumFooter":"بصمة",
"toggleTitle":"انقر لتبديل الشريط الجانبي"
},



"notFoundImageAlt":"صورة تظهر تلفزيون قديم",
"caseHeroAlt":"صورة تظهر لقطة شاشة من حالة المشروع",
"caseSliderAlt":"صورة تظهر لقطة شاشة من إحدى طرق عرض التطبيق",
"logoAlt":"صورة تظهر شعار التطبيق",
"contactImageAlt": "صورة تظهر أدوات الكتابة وشخص يكتب",
"testimonialsSliderImageAlt":"صورة تظهر مراجع",
"testimonialsImageAlt":"صورة تظهر فريق العمل",
"projectsSliderImageAlt":"صورة تظهر لقطة شاشة مصنوعة من تطبيق تم نشره",
"projectsImageAlt":"صورة تظهر مكان العمل مع جهاز كمبيوتر محمول وملحقاتها",
"aboutCvDeAlt": "أيقونة تظهر العلم الألماني",
"aboutCvEnAlt": "أيقونة تظهر العلم الأمريكي",
"aboutCvUkAlt": "أيقونة تظهر العلم الأوكراني",
"aboutCvDeTitle": "انقر هنا لتنزيل سيرتي الذاتية باللغة الألمانية. قد تحتاج إلى استخدام عارض ملف مثل أدوبي أكروبات أو ما شابه ذلك",
"aboutCvEnTitle": "انقر هنا لتنزيل سيرتي الذاتية باللغة الإنجليزية. قد تحتاج إلى استخدام عارض ملف مثل أدوبي أكروبات أو ما شابه ذلك",
"aboutCvUkTitle": "انقر هنا لتنزيل سيرتي الذاتية باللغة الأوكرانية. قد تحتاج إلى استخدام عارض ملف مثل أدوبي أكروبات أو ما شابه ذلك",
"toggleResumeTitle": "تبديل ملفات السيرة الذاتية",
"checkOutCodeTitle": "تحقق من التعليمات البرمجية على جيثب",
"profileImageAlt": "صورة تظهر رجل في سترة"


}