{
  "notificationCloseTitle":"Затворете го прозорецот",
  "whatsNewInfo":"Што е ново: апликацијата се пресели да Реагира.јс, сега е локализиран, и има тема toggler. Прочитајте повеќе ",
    "whatsNewLink":"овде",
  
  "darkModalMessage":"Добредојдовте на темната страна",
  "lightModalMessage":"Добредојдовте на страната на светлината",
  "modalConfirm":"Го Добив!",
  "modalHint": "Кликни за затворање на модалот",
  "app_title": "Yevhenii Airapetian - Портфолио",
  "languages": "Јазици",
  "themeSwitcherLightHint":"Кликни тука ве молиме да се префрлите на темата на светлината",
    "themeSwitcherDarkHint":"Кликнете овде ве молиме да се префрлите на темната тема",
    "welcome text": "Здраво, јас сум Евгениј!",
    "resume": "ЦВ",
    "introduction":"Јас сум веб развивач со страст кон технологијата",
    "experience":"Веќе имам искуство со предавање странски јазици и академско пишување и со нетрпение очекувам кариера како веб развивач.",
    "first focus":"Секогаш сум се фокусирал на испорака на висококвалитетни работни и исполнувајќи ги роковите, користејќи ги моите полирани вештини за решавање проблеми, менаџмент на времето и размислување.",
    "second focus":"Мојата цел е да ја комбинирам мојата експертиза со моите професионални амбиции да развивам функционални, ангажирачки и достапни софтверски решенија.",
    "availability":"Јас сум на располагање за канцеларија и хибридна работа во областа Берлин и Потсдам или далечинско.",
    "hobbies":"Покрај моите страсти во развојот на веб, јас сум и активен аматерски фотограф и фитнес ентузијаст, и секој ден можете да ме најдете надвор од фотографирање или кревање тегови.",
    "code":"Код",
    "projects":"Проекти",
    "projectsInfo": "Еве ги сегашните веб-развојни проекти на кои сум ги завршил и работел. Сите тие имаат хиперлинк со кодната база и проектните случаи, повеќето од нив имаат линкови до онлајн верзијата, а некои имаат дополнителни линкови",
    "projectsViewTip": "Користете ги контролите на лизгачот за да кликнете преку списокот со проекти. Лебди над одреден слајд за пристап до врските на проектот. Допрете на одреден слајд за да видите повеќе информации (на мобилен)",    
    "r3playInfo":"Веб API на R3play им овозможува на корисниците да се регистрираат и да излегуваат, да гледаат информации за филмови, серии и аниме и да управуваат со наведените листи за колекција.",
    "r3playAPIInfo":"Web API се разви со Node.js, Експрес и MongoDB кој им овозможува на корисниците да влезат, да излезат, да гледаат информации за филмови, тв шоуа и аниме и да управуваат со фаворити.",
    "myFlixInfo":"Преден дел за R3play Web API дизајниран со Angular, Typescript и Material UI кој им овозможува на корисниците да се регистрираат, да гледаат информации за филмовите и да додаваат омилени.",
    "meetInfo":"Прогресивна веб апликација напишана со користење на AWS Lambda Functions која користи OAuth2 овластување и автентикација и прикажува настани од Google Calendar API на CareerFoundry.",
    "owriteInfo":"React Native апликација која им овозможува на корисниците да разговараат. Корисниците можат да постават корисништво, да ја изберат бојата на позадината на чатот и да испраќаат смс пораки, слики и аудио снимки.",
    "pokemonInfo":"Респонзивна апликација Pokemon која го повлекува Pokémon користејќи Ајакс од надворешниот API на Pokedex и ги прикажува нивните информации како висина, тежина, Pokémon ID и слики од предната и задната страна",
    "toDoInfo":"A jQuery и Bootstrap to-do апликација која им овозможува на корисниците да управуваат со заданите. Корисниците можат да додаваат, избришуваат и пренаредуваат задања, да креираат и избришуваат списоци на задања и да видат водич за тоа како да ја користат апликацијата.",
    "portfolioInfo":"Одговорна веб-апликација развиена со размислувања за React, React Bootstrap и пристапност, овозможувајќи им на корисниците да гледаат информации за моите проекти итн.",


    "r3playInfoTitle":"Кликнете за да прочитате повеќе за R3PLAY API",
    "r3playInfoTitleAPIDeployed":"Кликнете за да ја отворите R3PLAY API",
    "r3playInfoTitleGithub":"Кликни за да ја отворите r3play api Github складиште",
    "myFlixInfoTitle":"Кликнете за да прочитате повеќе за Апликацијата MyFlix",
    "myFlixInfoTitleGithub":"Кликнете за да ја отворите апликацијата Myflix Github складиште",
    "myFlixInfoTitleKanban":"Кликнете за да ја отворите апликацијата myFlix проект канбан одбор",
    "meetInfoTitle":"Кликнете за да прочитате повеќе за Meet App",
    "meetInfoTitleDeployed":"Кликнете за да ја отворите Апликацијата за Meet",
    "meetInfoTitleGithub":"Кликни за да ја отвориш Апликацијата Meet Github складиште",
    "owriteInfoTitle":"Кликнете за да прочитате повеќе за Апликацијата Owrite",
    "owriteInfoTitleGithub":"Кликнете за да ја отворите Апликацијата Owrite Github складиште",
    "pokemonInfoTitle":"Кликнете за да прочитате повеќе за Апликацијата Покемон",
    "pokemonInfoTitleDeployed":"Кликнете за да ја отворите Апликацијата Pokemon",
    "pokemonInfoTitleGithub":"Кликнете за да ја отворите апликацијата Pokemon Github складиште",
    "toDoInfoTitle":"Кликнете за да прочитате повеќе за Апликацијата To Do List",
    "toDoInfoTitleDeployed":"Кликнете за да ја отворите Апликацијата To Do List",
    "toDoInfoTitleGithub":"Кликнете за да ја отворите апликацијата Todolist Github складиште",
    "portfolioInfoTitle":"Кликнете за да прочитате повеќе За Апликацијата Портфолио",
    "portfolioInfoTitleDeployed":"Кликнете за да ја отворите Апликацијата Портфолио",
    "portfolioInfoTitleGithub":"Кликнете за да ја отворите Апликацијата Портфолио складиште На Github",
    "testimonialSliderMore":"Кликнете за да го видите целиот текст на сведоштвото",


    "projectsSliderMore":"Повеќе",
    "testimonials":"Збор на уста",
    "wordOfMouth":"Не би бил таму каде што сум денес без сите прекрасни луѓе со кои имав привилегија да работам.",
    "testimonialsViewTip":"Користете ги контролите на лизгачот за да кликнете преку списокот со прегледи. Лебдете над насловите на прегледите за да прочитате повеќе. Допрете на одредено сведоштво за да видите дополнителни информации (на мобилен)",    "testimonial1":"Maya Septriana, Кариерен консултант, CareerFoundry",
    "testimonial2":"Nizar Triki, Менаџер за софтверско инженерство chez Expensya",
    "testimonial3":"Dejan Gogov, Веб развивач, Wild Code School",
    "testimonial1Text":"Евгениј е некој со кој е толку лесно да соработуваш. Секогаш се стреми кон извонредност. Секогаш кога ќе му дадам повратни информации, тој би сакал да слуша и да го прилагоди поднесувањето...",
    "testimonial2Text":"Имав можност да го менторот Евгениј во текот на неговата обука за развој на веб во CareerFoundry. Самодостојноста на Евгенија, брзото сфаќање на концептите...",
    "testimonial3Text":"За време на нашиот 6-месечен bootcamp, Евгениј постојано покажува позитивен и пријателски настроен...",
    "testimonialsMore":"Повеќе",

    "contact":"Контакт",
    "suggestion":"Сакате да работите заедно или да имате предлог? Јас сум отворен за можности за регрутирање и коментари",
    "eMailMe":"Слободно ме праќајте мејл користејќи го формуларот подолу",
    "contactFormHeader":"Контакт",
    "firstName":"Име",
    "firstNamePlaceholder":"Џои",
    "lastName":"Презиме",
    "lastNamePlaceholder":"Трибијани",
    "phoneNumber":"Телефонски број",
    "phoneNumberPlaceholder":"+49 1234 5678910",
    "eMail":"E-Mail",
    "eMailPlaceholder":"example@mail.com",
    "messageOrComment":"Порака или коментар. Те молам биди фина!",
    "messageOrCommentPlaceholder":"Твојата порака",
    "contactFormTip":"Потребни се полиња означени со ѕидачка",
    "contactFormPoweredBy":"Напојувана од",
    
    "caseWorkflow":"Работен Тек",
    "caseUpgrade":"Надградба",
    "caseDatabase":"База На Податоци",
    "caseApi":"API",
    "caseInterface":"Интерфејс За Апликација",
    "caseTDD": "Тест-Управувано Развој",
    "caseServerAndApi": "Сервер-Страна и API",
    "caseAgile":"Агилен Работен Тек",
    "caseOverview": "Преглед",
    "casePurpose": "Цел и контекст",
    "caseObjective": "Објективно",
    "caseServer": "Серверска страна",
    "caseClient": "Клиент-страна",
    "caseApproach": "Пристап",
    "caseDuration": "Времетраење",
    "caseRetrospective": "Ретроспектива",
    "caseChallenges": "Предизвици.",
    "caseConclusion": "Заклучок и преземања на клучеви",
    "caseMainTakeaways": "Главни јадења за идни проекти",
    "apiPreview": "API Preview",
    "appPreview": "Преглед на апликација",
    "caseTechnologies": "Употребени технологии/Вештини",
    "caseCredits": "Кредити",
    
    
    

    "portfolioCaseHeading":"Студија на случај Portfolio",
    "portfolioCaseIntroduction":"Portfolio App е одговорна веб-апликација, развиена со Користење на React и Ract Bootstrap, која им обезбедува на корисниците информации за моите тековни проекти, препораки, информации за контакт и социјални платформи и е локализирана на неколку странски јазици. Корисниците можат да пристапат до информации во одделни прегледи, да ја преведат апликацијата на нивниот претпочитан јазик и да го префрлат стилот или на светла или темна тема.",
    "portfolioCaseRequired":"Portfolio App беше потребен проект што го развив како дел од мојот \"Вовед во курсот за веб-развој\" во Кариерата за да го демонстрирам моето владеење СО HTML, CSS и распоредување на веб-страници. Дополнително, ги совладав таквите широко распространети практики за веб-развој како тестирање на апликации, минимизирање на CSS, пристапност, поддршка на постари прелистувачи и css анимации.",
    "portfolioCaseAim":"Проектот имаше за цел да развие и распореди целосно функционална статичка веб-страница што би можел да ја користам како мое професионално портфолио. Проблемот што сакав да го решам беше да ги користам алатките опфатени во \"Курсот за развој на веб\" во Кариерата за да изградам и распоредам работен фронт што ќе се користи како мое професионално портфолио.",
    "portfolioCaseAboutWorkflow":"Во раните фази на процесот на развој, ја структурирав содржината СО HTML, а потоа ги стилизирав страниците со обичен CSS. Целосно.приклучокот јс помогна да се структурира и стилизира веб-страницата според препорачаните упатства за веб-пристапност. Овие упатства постојат за да им помогнат на луѓето со физички или други ограничувања да имаат подобро корисничко искуство на Интернет. За овие цели се користени специјални ознаки \"aria\", како и информативни описи и алтернативни текстуални податоци. Во завршните фази на проектот, ја тестирав веб-страницата за правилна работа на различни оперативни системи и прелистувачи, вклучително и користење на повратен javascript за постара поддршка на прелистувачот на Internet Explorer.",
    "portfolioCaseAboutUpgrade1":"По завршувањето на Мојата CareerFoundry \"Целосна Магацинот Веб-Развој програма\" и додека студирав на CareerFoundy \"Подготовка на работа курс\", решив да ја сменам апликацијата на различни начини. Прво, веб-страницата доби нови страници со податоците за случајот на проектите, каде што детално опишав како работев на секој проект додека студирав во CareerFoundry. Второ, го ажурирав стајлингот за да бидам визуелно попријатен, функционален иesетски. Меѓутоа, бидејќи статичните веб-страници стануваат се повеќе застарени во денешно време, време беше да го мигрирам Моето Портфолио во една од Библиотеките Javascript широко користена од заедницата на развивачи. Како, по завршувањето на неколку проекти во подигањето со React.js, и бидејќи бев најискусен со тоа, решив да го користам како скелет на мојот проект.",
    "portfolioCaseAboutUpgrade2":"Jа иницијализирав работата со команда за апликација креирај реакт, потоа ги преместив и повторно ги напишав сите HTML и CSS датотеки за да ги одделам компонентите на функцијата и ги инсталирав потребните зависности од проектот. Проектите, препораките и случаите добија свои посебни лизгачи со примери и видео прошетки. Подоцна, ја локализирав апликацијата на неколку странски јазици, воведов темна тема и ја ажурирав апликацијата за да ги зачувам јазикот и преференциите на корисникот. И конечно, го претворив Моето Портфолио во Прогресивна Веб-Апликација. Со оваа функција, корисниците можат да ја инсталираат апликацијата на десктоп и мобилни уреди, имитирајќи мајчин стан искуство како на Android или Windows платформи.",   
    "caseTotally":"Посетете Totally.js Github складиште",
    "portfolioCaseAboutClient":"Го изградив предниот интерфејс за да им обезбедам на корисниците можност да комуницираат со податоците поврзани со моето професионално портфолио. Првично беше статична веб-страница, развиена со користење на обичен HTML, CSS и Totally.js, приклучок Javascript за тестирање на пристапноста. Имаше одделни страници на HTML за главните, проектите, контактите и другите информации.",
    "portfolioCaseDurationData":"Вкупно 2 недели за првичниот проект. 3-6 месеци во сума за тековниот резултат",
    "portfolioCaseConclusionData":"Веб-страницата на Portfolio беше првиот проект во веб-кампот за развој на CareerFoundry. Кога беше завршено, го започнав курсот за \"Full-Stack Immersion course\" со работата на Pokemon App.",
    "portfolioCaseConclusionData2":"Беше одлично и наградувачко искуство за дизајнирање и дебагирање на апликацијата во почетната состојба до најновите подобрувања што ги има. Исто така, додадов нови и изградени врз старите вештини (вклучително и кога работам самостојно), како што се полирање на копијата, дебагирање на распоредување на Апликации за React, користење библиотеки за локализација, воведување и прилагодување на теми, работа со локално складирање, подобри практики за стилизирање и други.",
    "portfolioCaseChallenge":"Развојот на првичниот проект беше релативно лесен и без грешки бидејќи веќе имав искуство во технологиите што беа потребни за него. Всушност, успеав да го завршам 1 недела пред потребниот рок и ги добив моите поднесоци прикажани како пример за другите студенти.",
    "portfolioCaseChallenge2":"Сепак, додека се преселив во посложените технологии и самостојно надвор од барањата на проектот, наидов на неколку прашања. Еден проблем беше што не можев целосно да ја запознаам темната тема со апликацијата. Кога ја вклучив темната тема, само дел од апликацијата го смени својот стил. Друг поврзан со тешкотиите при распоредување и реагирање на поставките потребни за тоа. За среќа, знаењето стекнато за време на кампот за подигање ми помогна во решавањето на овие пречки и можев:",
    "portfolioCaseChallengeDetail1":"Користете ги моите вештини за истражување и решавање проблеми за да ги поправите проблемите поврзани со темната тема",
    "portfolioCaseChallengeDetail2":"Истражување и решавање проблеми поврзани со распоредувањето",
    "portfolioMainTakeaway1":"Упорноста е важна вештина во развојот на веб, како и изборот за компромис и поставување приоритети",
    "portfolioMainTakeaway2":"Понекогаш бубачката може да биде неочекувано предизвикана и на решението му треба подобро внимание на деталите",
    "portfolioMainTakeaway3":"Секогаш има простор за подобрување во вашите проекти, па затоа е клучно да се разбере моментот кога да се продолжи понатаму и/или да се даде приоритет",
    "portfolioMainTakeaway4":"Кодот (брзо) станува застарен или има потреба од ажурирање, така што пријавувањето на вашите постари проекти од време на време е добра идеја",

    "portfolioSlide1Heading":"За Интерфејсот (Светлосна тема)",
    "portfolioSlide2Heading":"За Интерфејсот (Темна тема)",
    "portfolioSlide3Heading":"Локализиран Интерфејс на случај на проект",
    "portfolioSlide1Description":"Апликацијата Портфолио за интерфејс каде што корисниците можат да прочитаат повеќе за авторот, да пристапат до базата на кодови и да продолжат (прикажана во светлосна тема)",
    "portfolioSlide2Description":"Апликацијата Портфолио за интерфејс каде што корисниците можат да прочитаат повеќе за авторот, да пристапат до базата на кодови и да продолжат (прикажани во темна тема)",
    "portfolioSlide3Description":"One of the projects' cases interfaces that is localized (to the German language in this example)",
    
    
    
    "r3playCaseHeading": "Студија на случај на R3play App",
    "r3playCaseIntroduction": "R3play е веб-апликација, развиена со користење на стекот MERN, која им обезбедува на корисниците информации за филмови, ТВ серии и аниме. Корисниците можат да пристапат до информации за филмови, режисери и жанрови. Корисниците можат да креираат сметка, да ги ажурираат своите информации и да создадат листа на омилени филмови, ТВ серии и аниме.",
    "r3playCaseRequired": "R3play беше задолжителен проект што го развив како дел од мојот курс за потопување со целосен оџак во CareerFoundry за да го покажам моето мајсторство за развој на веб со целосен оџак користејќи JavaScript.",
    "r3playCaseAim": "Проектот имаше за цел да развие целосно функционална апликација со целосен стек што би можел да ја додадам во моето професионално портфолио. Проблемот што сакав да го решам беше да ја изградам комплетната веб-апликација со целосен оџак со поврзување на претходно дизајнираната серверска страна и клиентската страна за апликацијата од нула.",
    "r3playCaseAboutServer": "Развив RESTful API користејќи Node.js и Express, кој е во интеракција со нерелациона база на податоци (MongoDB). API користи вообичаени HTTP методи како GET, PUT, POST и DELETE. За да се извлечат податоци и да се складираат податоци во базата на податоци, се користат CRUD методи. API обезбедува информации за филмови, ТВ серии и аниме во формат JSON.",
    "caseViewEndpoints": "Погледи на крајот",
    "r3playCasePostman": "Го користев Postman за тестирање на одговорите и барањата до API. Исто така, користев основна HTTP автентикација и JWT автентикација за да ги обезбедам карактеристиките за автентикација и овластување.",
    "r3playCaseAboutClient": "По завршувањето на проектот API, продолжив да го градам предниот интерфејс што ќе им треба на корисниците при интеракција со логиката и податоците од API и базата на податоци. Тоа е веб-апликација на една страница, одговорна, развиена со React и React-Redux. Прикажува неколку прегледи на интерфејсот, вклучувајќи (но не ограничувајќи се на) главен приказ (покажува листа на сите филмови, ТВ серии и аниме), еден филм, ТВ серии и прегледи на аниме (покажува податоци за еден филм, ТВ серија, и аниме, и им овозможува на корисниците да ги додадат или избришат на или од нивната листа на омилени), приказ за најавување, приказ на регистрација и приказ на профил (каде што корисниците можат да ги ажурираат своите кориснички податоци и листа на омилени).",
    "caseSliderTip": "Користете ги контролите на лизгачот за да кликнете преку списокот на проекти. Лебди над насловите на слајдовите за да прочитате повеќе. Допрете на одреден слајд за да видите дополнителни информации (на мобилен)",    
    "r3playCaseDurationData": "вкупно 12 недели (заднина: 7 недели, преден дел: 5 недели)",
    "r3playCaseConclusionData": "Филмската апликација беше само втората целосна веб-апликација што ја развив во курсот за развој на веб со целосен стек. Кога беше завршен, се фокусирав на подобрување на моите развојни вештини, особено на развојниот пристап управуван од тестот. Потребно е спроведување на фазата на тестирање пред да се додаде вистинската функционална логика, овозможувајќи побезбеден, без грешки и побрз развој.",
   
    "myFlixCaseHeading":"Студија На Случај На Апликација MyFlix",
    "myFlixCaseIntroduction":"MyFlix-Angular-App е веб-апликација, развиена со КОРИСТЕЊЕ НА СРЕДНИОТ оџак, која им овозможува на корисниците информации за филмовите. Корисниците можат да пристапат до информации за филмови, режисери и жанрови. Корисниците можат да креираат сметка, да ги ажурираат своите информации и да создадат список на омилени филмови.",
    "myFlixCaseRequired":"MyFlix-Angular-App беше потребен проект што го развив како дел од мојот курс за потопување во целосен оџак во Кариерата за да го демонстрирам моето мајсторство за развој на веб со целосен оџак користејќи JavaScript. Дополнително, практикував агилно управување со проекти, обезбедување повратни информации и вештини за генерирање документација.",
    "myFlixCaseAboutServer":"Развив Restful API користејќи Node.js И Express што комуницира со нерелациона база на податоци (MongoDB). API користи вообичаени методи нА HTTP како што СЕ GET, PUT, POST и DELETE. За да се добијат податоци од и складираат податоци во базата на податоци, се користат CRUD методи. API обезбедува информации за филм, ТВ серија и аниме во формат JSON.",
    "myFlixCasePostman":"Jас го користев Postman за тестирање на одговорите и барањата до API. Јас, исто така, користев основна автентикација на HTTP и автентикација на JWT за да обезбедам карактеристики за автентикација и овластување.",
    "myFlixCaseAgileData":"работата на проектот започна со создавање на одборот На Канбан и пополнување со барањата на проектот и кориснички приказни. Кога беше завршена проектната задача, таа беше преместена во делот \"Готово\". Исто така, генерирав детална документација Со Типедок според барањата на проектот.",
    "myFlixCaseAim":"Проектот имаше за цел да развие целосно функционална апликација со целосен оџак што би можел да ја додадам во моето професионално портфолио. Проблемот што сакав да го решам беше да ја изградам целосната веб-апликација со целосен оџак со поврзување на претходно дизајнираната страна на серверот и страната на клиентот за апликацијата од нула.",
    "myFlixCaseConclusion":"Апликацијата myFlix беше последната целосна веб-апликација што ја развив во целосниот курс за развој на веб-Стек. Кога заврши, продолжив да го подобрувам моето портфолио.",
    "myFlixCaseAboutClient":"Го изградив предниот интерфејс за корисниците да можат да комуницираат со логиката и податоците од API и базата на податоци. Тоа е веб-апликација со една страница, одговорна, развиена Со Аголен И МАТЕРИЈАЛЕН ИНТЕРФЕЈС. Прикажува неколку прегледи на интерфејсот, вклучувајќи главен приказ (прикажува список на сите филмови, копче за управување со омилени и копчиња за прегледување дополнителни информации за филмот), приказ за најава/регистрација и приказ на профил (каде што корисниците можат да ги ажурираат своите кориснички податоци).",
    "myFlixCaseConclusionData":"Апликацијата myFlix беше последната целосна веб-апликација што ја развив во целосниот курс за развој на веб-Стек. Кога заврши, продолжив да го подобрувам моето портфолио.",
    "myFlixCaseConclusionData2":"Тешкотиите што ги сретнав се случија на крајот од проектот и повеќе се однесуваа на особеностите На Аголна и Github. Едно прашање се случи кога страниците На Гитуб одбија да ја распоредат апликацијата долго време. Другиот се случи кога локалните промени во базата на кодови не се прикажаа во распоредената апликација. За да го решам ова, се обратив до мојот ментор и учител и, за време на сесијата за програмирање во пар, успеавме да ги поправиме проблемите.",
    "myFlixCaseConclusionData3":"Тоа беше исто така корисно искуство во дебагирање и решавање проблеми, користејќи git терминални команди, специфики за работа со Angular и сесии за програмирање во парови. Додадов и нови вештини во мојот арсенал, како што Се Typescript, Angular, Material UI, правилно коментирање на кодот, соработка и други.",
    "myFlixCaseDurationData":"Речиси 1,5 недели (10 дена)",
    "myFlixCaseChallenge":"Развојот на апликацијата myFlix одзеде многу помалку време и напор во споредба со апликацијата R3play Ract од:",
    "myFlixCaseChallengeDetail1":"АПИ е веќе изградена",
    "myFlixCaseChallengeDetail2":"Обемната практика Со Реагира помогна да напредува побрзо",
    "myFlixCaseChallengeDetail3":"Не додадов многу дополнителни функции и се држев до основните барања на курсот",



    "myFlixCaseChallengeDetail4":"Времето што остана во програмата веќе беше ограничено",    
    "myFlixMainTakeaway1":"Подобрете ја функционалноста на апликацијата за да ги одразува карактеристиките на апликацијата R3play",
    "myFlixMainTakeaway2":"Дознајте повеќе за Typescript",
    "myFlixMainTakeaway3":"Прочитајте повеќе за Material UI",
    "myFlixMainTakeaway4":"Продолжете да истражувате други технологии и најдобри практики во развојот на веб",
    

    
    "meetCaseHeading":"Студија на Случај на Meet App",
    "meetCaseIntroduction":"Meet App е одговорна Прогресивна Веб-Апликација, развиена со користење на пристапот за развој управуван од тестот користејќи ги функциите НА AWS Serverless Lambda, oauth2 google за автентикација и овластување и Библиотеката Recharts за да им овозможи на корисниците да ги гледаат настаните на GOOGLE Calendar api. Корисниците можат да се автентицираат Со Google, да го наведат градот и бројот на настани за прикажување на настаните и да прочитаат повеќе за нив. Апликацијата може да се инсталира на десктоп/мобилен благодарение на препораките НА PWA, користени и преку интернет и офлајн и покажува известувања кога се внесуваат неточни податоци и/или се губи интернет-врската.",
    "meetCaseRequired":"Meet App беше потребен проект што го развив како дел од мојот курс за потопување со целосен оџак во Кариерата за да го демонстрирам моето мајсторство во вештините за развој на веб со целосен оџак со користење на JavaScript и технологии без сервери.",
    "meetCaseAboutTDD":"Jа развив апликацијата со прво пишување на корисничките приказни. Со помош на пристапот за развој управуван од тестот, ја вклучив единицата, интеграцијата, прифаќањето на корисникот и методите за тестирање од крај до крај за да ги напишам потребните тестови пред да го имплементирам кодот.",
    "meetCaseAboutServerAndApi":"Jа развив страната на серверот користејќи ги функциите на AWS Serverless Lambda како услов за проектот. Употребата на сервери овозможува намалување на дополнителната работа за управување со сервер и ја олеснува приспособливоста. За податоците за настаните на апликацијата, се користеше Календарот на Google CareerFoundry. Екранот за автентикација на Google OAuth2 е поставен за да ги автентицира и овласти корисниците на апликацијата. Во последните фази на развој, го искористив сервисниот работник На Реакт за да ја трансформирам апликацијата во Прогресивна Веб-Апликација. Библиотеката Recharts овозможува визуелизација на податоците за настанот во форма на два вида графикони (Расфрлање и Пита).",
    "meetCaseAim":"Проектот имаше за цел да развие целосно функционална апликација со целосен оџак што би можел да ја додадам во моето професионално портфолио. Проблемот што сакав да го решам беше да изградам комплетна веб-апликација со целосен оџак со користење на пристапот за развој управуван од тестот користејќи ги функциите на AWS Serverless Lambda, Реагирајте.јс И прогресивните барања за Веб-Апликација.",
    "meetCaseAboutClient":"За визуелниот дел, предниот дел беше одговорно стилизиран со редовни CSS и JSX.",
    "meetCaseConclusionData":"Meet App беше предизвикувачки, но интересен проект што требаше да се заврши. Кога беше завршена, продолжив со следниот проект кој вклучува мајчин развој на апликации со React Native",
    "meetCaseDurationData":"Речиси 1 месец (28 дена)",
    "meetCaseChallenge1":"Најголемиот предизвик за мене во овој проект беше самиот тест-управуван развоен пристап. Имајќи напишан код во стилот на однесување, претходно морав да поминам некое време навикнувајќи се на новиот метод. Сепак, работата на апликацијата помина доста добро и брзо се навикнав на новата тема. Едно од прашањата додека работеше на проектот беше неможноста на корисниците да се автентицираат на апликацијата. Откако допрев до мојот учител, го решив проблемот со рачно додавање на корисниците на тестот преку конзолата за Google Developer Concole.",
    "meetCaseChallenge2":"По решавањето проблеми со инсталацијата на апликацијата на паметен телефон, успешно ја претворив во Прогресивна Веб-Апликација. Уживав и во работата со корисничките известувања и библиотеката за Графикони. Исто така, ги подобрив моите знаења и вештини за пристапот НА ТДД и поставување на Сметките НА AWS и Google Developer, како и потврдување на сопственоста на доменот.",    
    "meetMainTakeaway1":"Вежбајте го пристапот на тдд на странични проекти",
    "meetMainTakeaway2":"Откријте повеќе за визуелизација на податоците",


    "owriteCaseHeading": "Owrite Стан Студија На Случај",
    "owriteCaseIntroduction": "OWrite Е Реагира Мајчин разговор апликација Во реално време, развиена со Користење Реагираат Мајчин, Експо CLI, упатства за пристапност, И Андроид Студио за самата апликација, И Google Firebase и Firestore за базата на податоци. Им овозможува на корисниците функции за разговор во реално време, вклучително и прегледување историја на пораки благодарение на Асинхронизацијата, испраќање пораки, фотографии, аудио снимки и податоци за геолокација. Корисниците можат да го постават своето корисничко име и да ја изберат бојата на позадината на апликацијата.",
    "writeCaseRequired": "Оврит беше потребен проект што го развив како дел од мојот курс за потопување во целост во Кариерата за да го демонстрирам моето мајсторство за развој на мајчин апликации користејќи Реагирај Мајчин, Експо КЛИ, Андроид Студио и Огнена База На Google/Firestore.",
    "owriteCaseAim": "Проектот имаше за цел да развие целосно функционална мајчин апликација што би можел да ја додадам во моето професионално портфолио. Проблемот што сакав да го решам беше да ја изградам целосната мајчин апликација со поврзување на базата На Податоци На Google Firebase/Firestore со интерфејсот на апликацијата дизајниран Со Реагирај Мајчин.",
    "owriteCaseAboutDatabase": "Jа развив базата на податоци користејќи Google Firebase за складирање на двајца корисници потребни за тестирање. Подоцна, го вработив Google Firestore за да ги содржи податоците за разговор на корисниците.",
    "owriteCaseAboutInterface": "За интерфејсот, Android Studio И Expo Go Android Апликацијата беа вградени за цели на тестирање. Реагира Мајчин беше искористен за дизајнирање на два екрани на апликации: добредојде и екран за разговор. Екранот за добредојде е дизајниран со достапни елементи според Реагираат Мајчин препораки, овозможува да поставите корисничко име и да изберете боја на позадина за екранот за разговор. Екранот за разговор го прикажува името на корисникот, историјата на пораките, полето за текст и менито со дополнителни опции за датотеки. За да ги развијам потребните карактеристики, вградив библиотеки како Што се Надарен Разговор, Експо Медиуми, Избирач На Слики На Експо, Навигација На Магацинот и други. За да се овозможи офлајн употреба, се користеше Асинхронизација.",
    "owriteCaseAboutServer": "Креирање на логиката на серверот започна со поставување сметка во Google Firebase и нејзино конфигурирање. Потоа продолжив да ги додавам поставките за конфигурација На Google Firebase во кодната база.",
    "owriteCaseConlusionData": "Апликацијата OWrite беше претпоследниот проект на кој работев на курсот за развој на Веб Во Целост. Кога беше завршено, се фокусирав на понатамошно подобрување на моите развојни вештини, конкретно додавајќи друга предна рамка и систем за дизајн на мојот вештина, Аголна И МАТЕРИЈАЛНА ИНТЕРФЕЈС соодветно. Следниот проект бараше пресоздавање на предниот дел за R3PLAY API со Аголен И МАТЕРИЈАЛЕН ИНТЕРФЕЈС овој пат.",
    "owriteCaseDurationData": "1 недела",
    "owriteCaseChallenge1": "Предизвиците со кои се соочив за време на овој проект беа повеќе поврзани со самата временска рамка на курсот отколку со вистинската работа на кодната база. Како што споменавме порано, бидејќи посветив дополнителен напор за подобрување НА R3PLAY API И Апликацијата, остави помалку време за крајот на курсот За Потопување. Како резултат на тоа, морав да го испланирам распоредот за да го завршам проектот на време и да се концентрирам само на потребните и препорачаните карактеристики.",
    "owriteCaseChallenge2": "Jас особено уживав во развојот на апликацијата, бидејќи отсекогаш сум сакал да се нурнам во мајчин развој на апликации и Да Реагирам Мајчин беше на мојата листа за проверка. Дополнително, беше пријатно да се знае дека претходно стекнатите вештини (управување со времето и приоритизација) ми помогнаа многу брзо да го завршам проектот и да додадам нови вештини за мајчин развој во мојата кутија со алатки.",
    "owriteMainTakeaway1": "Вежбајте создавање апликации во реално време на странични проекти",
    "owriteMainTakeaway2": "Откријте повеќе за мајчин развој на апликации",
    
    
    "pokedexLink": "Pokedex API",
    "pokemonCaseHeading":"Покемон Стан Студија На Случај",
    "pokemonCaseIntroduction": "Апликацијата Pokemon е веб-апликација, развиена со користење НА HTML, CSS, Javascript и Bootstrap. На корисниците им обезбедува информации за Одг донесени од POKEDEX api. Корисниците можат да пристапат до информации за ИДЕНТИФИКАЦИЈА На Покемон, висина и тежина, да ја видат предната и задната слика на Покемон и да бараат Покемон по име.",
    "pokemonCaseRequired": "Апликацијата Покемон беше потребен проект што го развив како дел од мојот курс за потопување со целосен оџак во Кариерата за да го демонстрирам моето мајсторство за развој на веб користејќи JavaScript и Bootstrap.",
    "pokemonCaseAim": "Проектот имаше за цел да развие целосно функционална апликација што би можел да ја додадам во моето професионално портфолио. Проблемот што сакав да го решам беше да изградам и стилизирам веб-апликација со користење на надворешна АПИ и популарна РАМКА НА ЦСС.",
    "pokemonCaseAboutApi": "Го користев POKEDEX API како дел од потребните зависности на проектот за снабдување на апликацијата со разни информации за Одг. За таа цел, Javascript ветувања беа искористени за справување со асинхрони барања и одговори на/ОД POKEDEX api.",
    "pokemonCaseAboutClient": "По завршувањето на логичкиот дел од апликацијата, ја започнав фазата на стилизација со вклучување На Подигање Како потребна РАМКА НА CSS на проектот. Задачата беше да се користат мрежата, часовите и компонентите на Подигање за да се спроведе потребната функционалност и одговорност. Конечно, ја тестирав апликацијата на различни екрани, уреди и оперативни системи користејќи емулатори на уредот/системот.",
    "pokemoncaseconlusiondata": "Апликацијата Одг беше првиот проект за курс За Потопување Со Целосен Оџак. Кога беше завршено, се фокусирав на подобрување на моите развојни вештини, конкретно нуркање во Јазол.јс, Експрес и Апис. Дизајнирањето на сопствен АПИ беше корисен и важен чекор за понатамошно совладување на клучните вештини за развој на веб-страници.",
    "pokemoncasedurationdatas":"4 недели",
    "pokemonCaseChallenge1": "Делот што бара да се користи асинхрон Javascript беше најмногу време, додека работата на стајлинг беше релативно лесна. Генерално, ми требаше 1 месец да го завршам проектот кој беше околу просечното време поминато. Прво, имав потешкотии да ги прикажам специфичните информации За Покемон како што е опишано во документацијата На Покедекс. Исто така, морав да го решам проблемот кога податоците не се прикажуваа на предниот дел.",
    "pokemonCaseChallenge2": "Сепак, ова беше забавен и релативно лесен проект за работа. Уживав во нуркањето во основите На Јаваскрипт со учење АЈАКС. Исто така, беше мотивирачки да се научи стајлинг со помош на Подигање. Исто така, брзо стекнав корисни вештини за работа со Javascript ветувања и Api, читање документација, стајлинг со CSS рамки и решавање проблеми. За среќа, мојот ментор и учител ми помогнаа за време на проектот и јас бев во можност да ги применам стекнатите вештини подоцна при спроведување на дополнителни функции на апликацијата.",
    "pokemonMainTakeaway1": "Подобрете ги вештините за дебагирање со вежбање и користење надворешни образовни ресурси.",
    "pokemonMainTakeaway2": "Останете мотивирани дури и кога се појавуваат привремени образовни тешкотии.",
    "pokemonMainTakeaway13": "Подобрете ја дигиталната грижа за себе во однос на времето за одмор",
    
    
    
    
    "toDoCaseHeading":"Случај На Апликација Тодо",
    "toDoCaseIntroduction": "Апликацијата За Списоци Со Задачи е одговорна веб-апликација, развиена со помош на HTML, Bootstrap и Javascript и им овозможува на корисниците можност да управуваат со своите задачи. Корисниците можат да ги додаваат и бришат своите задачи меѓу другите функции.",
    "toDoCaseRequired": "Апликацијата За Список Со Задачи беше потребен страничен мини-проект што го развив како дел од мојот курс за потопување во целост во Кариерата за да го покажам моето мајсторство во работата со jQuery.",
    "toDoCaseAim": "Проектот имаше за цел да дизајнира целосно функционална веб-апликација што би можел да ја додадам во моето професионално портфолио. Проблемот што сакав да го решам беше да го претворам Обичниот Јаваскрипт во jQuery.",
    "toDoCaseAboutClient": "Откако го добив првичниот обичен Javascript код со основна функционалност на апликацијата, почнав да го претворам во jQuery. Овој тип на работа ми овозможи да воведам дополнителни карактеристики и стилови.",
    "toDoCaseConclusionData": "Апликацијата За Списоци со Задачи беше само страничен мини-проект што го направив на курсот за потопување во целосен оџак, но уживав да додавам нови функции и стајлинг на неа над основните барања. Тоа брзо ги подобри моите вештини во jQuery, Подигање, дебагирање и работа со дополнителни библиотеки.",
    "toDoCaseDurationData": "1 ден за потребната функционалност и околу 3 недели за дополнителни функции",
    "toDoCaseChallenge1": "Развојот на основните карактеристики на апликацијата не создаде никакви тешкотии и ја завршив задачата во рок од 1 ден. Сепак, не бев задоволен од функционалноста што ја имаше и решив да најдам дополнително време за да додадам подобрувања. Овие додатоци предизвикаа многу дебагирање бидејќи различните библиотеки jQuery не функционираа добро заедно и како што планирав. За среќа, мојот ментор и учител ми помогнаа да ја решам работата. Пред воведување дополнителни функции, апликацијата може:",
    "toDoCaseChallenge2": "Со новите функции, тоа овозможува:",
    "toDoMainTakeaway1":"Подобрете ги вештините за Подигање",
    "toDoMainTakeaway2": "Работете на вештините за дебагирање",
    "toDoMainTakeaway3": "Проширете ги карактеристиките на апликацијата подоцна",
    "toDoBeforeFeature1": "Додај/избриши до-dos",
    "toDoBeforeFeature2": "Преуредување на задачи на работната површина",
    "toDoBeforeFeature3": "Пречкртајте до-dos",
    "toDoBeforeFeature4": "Прикажи вградени известувања за предупредување за прелистувачот",
    "toDoAfterFeature1": "Додај/избриши списоци со задачи",
    "toDoAfterFeature2": "Додај/избриши до-dos до/од списоците со задачи (вклучувајќи притискање \"Внеси\" на тастатурата)",
    "toDoAfterFeature3":"Исчистете го полето за внесување",
    "toDoAfterFeature4": "Преуредување и прецртување на задачи на мобилен со помош на jQuery Mobile и jQuery Touch Punch",
    "toDoAfterFeature5": "Прикажи поубави известувања со помош на BOOTSTRAP и JQUERY UI",
    "toDoAfterFeature6": "Погледнете водич за тоа како да ја користите апликацијата на различни платформи со помош на Подигање",

    "notFound":"Не можевме да го најдеме ресурсот што го баравте.",
    "returnHomeParagraph": "Но, секогаш можете да се вратите на ",
    "returnHomeLink":"Почетната страница",

    "copySkill":"Полирање на копијата",
    "terminalSkill":"Работа во терминалот",
    "accessibilitySkill":"Пристапност",
    "externalApiSkill":"Надворешен API",
    "nativeSkill":"Мајчин Развој На Апликации",
    "troubleshootingSkill":"Решавање Проблеми",
    "TDDSkill":"Тест-управувано развој",
    "kanbanSkill" :"канбан одбор",
    "agileSkill": "Агилен работен тек",
    "documentationSkill": "Вештина за документација",
    "userStoriesSkill":" кориснички приказни",
    "collabSkill": "Соработка",
    "feedbackSkill": "Обезбедување повратни информации",
    "contributeSkill": "Придонес",
    "testingSkill": "Тестирање",
    "apiSkill": "Google Calendar API",
    "pwsSkill": "Прогресивни веб-апликации",
    "responsiveSkill": "Одговорен дизајн",
    "deploySkill": "Распоредување на веб-страница",
    "caseLead": "Улога: Главен програмер",
    "caseTutor": "Тони Нтамбаази:",
    "caseTutor2": "Креативен директор",
    "caseMentor": "Низар Трики:",
    "caseMentor2": "Менаџер за инженерство на софтвер",
    "r3playMainTakeaway1": "Прво фокусирајте се на потребната функционалност",
    "r3playMainTakeaway2": "Водобрување на вештините за управување со времето",
    "r3playMainTakeaway3": "Длабоко го продлабочува знаењето за користените технологии со читање и практикување повеќе",
    "r3playMainTakeaway4": "Не се сомневам дека ќе посегнете по помош во случај на технички проблеми",
    "r3playCaseChallenge1": "Развојот на задната страна одземаше најмногу време, додека работата на страната на клиентот беше технички најпредизвикувачки. Како резултат на тоа, ми требаше подолго време да го завршам целиот куп во споредба со вообичаеното времетраење на две достигнувања на CareerFoundry. Причината за ова беше тоа што се концентрирав на функционалните и визуелните подобрувања на двете достигнувања над основните барања и ми требаше повеќе време за да го решам условното прикажување на JSX елементите, како да го имплементирам Redux in React и условната логика зад прикажувањето на филмот предлози до корисникот.",
    "r3playCaseChallenge2": "Сепак, ова беше мојот омилен проект. Уживав во развивањето на корисничкиот интерфејс и работата со информации за базата на податоци. Исто така, брзо ги подобрив моите терминални вештини, разбирање за барање на базата на податоци MongoDB NoSQL, условно рендерирање, филтрирање на податоци, прилагодување на компонентите React Bootstrap, како и вештини за управување со времето и приоритизација. За среќа, мојот вешт учител и ментор ми помагаше за време на проектот и можев да ги применам стекнатите вештини подоцна при имплементирање на дополнителни функции на апликацијата.",


    "r3playSlide1Heading": "Интерфејс за авторизација",
    "r3playSlide2Heading": "филмски интерфејс",
    "r3playSlide3Heading":"интерфејс на профилот",
    "r3playSlide1Description": "Интерфејсот за овластување во апликацијата R3play каде што корисниците можат да се најават во апликацијата",
    "r3playSlide2Description": "Интерфејс за филм за апликација R3play што прикажува листа на филмови достапни во апликацијата",
    "r3playSlide3Description": "Интерфејс на профилот на апликацијата R3play каде што корисниците можат да ги променат информациите за нивната сметка",
    

    "myFlixSlide1Heading":"Поглед на Најава",
    "myFlixSlide2Heading": "Филм Поглед",
    "myFlixSlide3Heading":"Приказ на Профилот",
    "myFlixSlide1Description": "приказ за најавување на Апликацијата MyFlix каде што корисниците можат да се најават на апликацијата",
    "myFlixSlide2Description": "приказот на Филмот на Апликацијата MyFlix што прикажува список на филмови достапни во апликацијата",
    "myFlixSlide3Description": "приказ на Профилот на Апликацијата MyFlix каде што корисниците можат да ги менуваат информациите за нивната сметка",
    
    
    "meetSlide1Heading":"Општ интерфејс",
    "meetSlide2Heading": "Грешки и Предупредувања",
    "meetSlide3Heading":"детали за Настанот",
    "meetSlide1Description": "Настаните На Апликацијата Meet вчитани во апликацијата со полињата за формулари што овозможуваат прилагодување на резултатите",
    "meetSlide2Description": "Екранот за настани на Апликацијата Meet демонстрираше со предупредувања и грешки поради внесените неточни податоци",
    "meetSlide3Description": "Екранот за настани На Апликацијата Meet со картичка за настани се прошири",
    
    
    "owriteSlide1Heading":"Добредојдовте на Екранот",
    "owriteSlide2Heading":"Разговор Екран",
    "owriteSlide1Description": "екранот за Добредојде на Апликацијата Owrite каде што корисниците можат да изберат тема и да влезат во собата за разговор",
    "owriteSlide2Description": "екранот за Разговор на Апликацијата Owrite каде што корисниците можат да разговараат, вклучително и испраќање аудио и датотеки со слики",
    
    
    "pokemonslide1Heading":"Добредојдовте Порака",
    "pokemonSlide2Heading":"Одг Резултати",
    "pokemonSlide3Heading":"Одг Картичка",
    "pokemonSlide1Description": "главната страница на Апликацијата Покемон со порака за добредојде",
    "pokemonSlide2Description": "Одг Стан филтрирани одг резултати прикажани како листа",
    "pokemonSlide3Description": "картичката Одг со податоци што корисникот може да ја види при кликнување на името на Покемон",
    

    "cookieInfo1":"Оваа апликација користи колачиња и ги собира податоците на посетителите. Прочитајте повеќе за политиките ",
    "cookieInfo2" : " и ",
    "cookieInfo3": "", 
    "cookieLink1": "за Колачиња",
    "cookieLink2": "Приватност",
    "cookieConfirm":"Се согласувам",

    
    "toDoSlide1Heading": "Почетен Поглед",
    "toDoSlide2Heading":"Нова Листа",
    "toDoSlide3Heading": "Известување",
    "toDoSlide1Description": "Почетен приказ на Апликацијата што треба Да се Направи каде што корисниците гледаат совети како да ја користат апликацијата и да додадат прва листа",
    "toDoSlide2Description":"додадена е нова листа на задачи",
    "toDoSlide3Description": "кога корисникот ќе го остави празно внесувањето и ќе се обиде да додаде нова задача, се појавува порака за известување",


    "menu":{
        "aboutMenu" : "За",
        "projectsMenu": "Проекти", 
        "casesMenu": "Случаи",
        "portfolioMenu": "Portfolio App",
        "testimonialsMenu": "Сведоштва",
        "contactMenu": "Контактирајте",
        "resumeMenu": "ЦВ",
        "r3playMenu": "R3play App",
        "myFlixMenu": "MyFlix App",
        "meetMenu": "Meet App",
        "owriteMenu": "Owrite App",
        "pokemonMenu": "Pokemon App",
        "toDoMenu": "To Do App",
        "policiesMenu":"Политика",
        "cookies": "Cookies",
        "privacy": "Приватност"
      },
      "footer":{
         "copy":"© Yevhenii Airapetian, 2024 Сите права се задржани.",
         "impressumFooter":"Отпечаток",
         "toggleTitle":"Кликнете за да ја вклучите страничната лента"

     },


     "notFoundImageAlt": "Слика што покажува стара телевизиja",
"caseHeroAlt": "Слика што покажува слика од екранот од случајот на проектот",
"caseSliderAlt": "Слика што покажува слика од екранот од една од прегледите на апликацијата",
"logoAlt": "Слика што го покажува логото на апликацијата",
"contactImageAlt": "Слика што покажува прибор за пишување и лице што пишува",
"testimonialsSliderImageAlt": "Слика што покажува рецензент",
"testimonialsImageAlt": "Слика што покажува тим кој работи",
"projectsSliderImageAlt": "Слика што покажува слика од екранот направена од распоредена апликација",
"projectsImageAlt": "Слика што покажува работно место со лаптоп и додатоци",
     "aboutCvDeAlt": "Икона што го покажува германското знаме",
"aboutCvEnAlt": "Икона што го покажува американското знаме",
"зaboutCvUkAlt": "Икона што го покажува украинското знаме",
"aboutCvDeTitle": "Кликни тука за да ја преземете мојата биографија на германски јазик. Можеби ќе треба да користите прегледувач на датотеки Како Adobe Acrobat или слично",
"aboutCvEnTitle": "Кликнете овде за да ја преземете мојата биографија на англиски јазик. Можеби ќе треба да користите прегледувач на датотеки Како Adobe Acrobat или слично",
"aboutCvUkTitle": "Кликни тука за да ја преземете мојата биографија на украински јазик. Можеби ќе треба да користите прегледувач на датотеки Како Adobe Acrobat или слично",
"toggleResumeTitle":"Вклучи датотеки за продолжување",
    "checkOutCodeTitle":"Проверете го кодот на Githubb",
    "profileImageAlt":"Слика што покажува човек во јакна"
  }